enum class ACLCompressionLevel {
    ACLCL_Lowest = 0,
    ACLCL_Low = 1,
    ACLCL_Medium = 2,
    ACLCL_High = 3,
    ACLCL_Highest = 4,
    ACLCL_Automatic = 5,
    ACLCL_MAX = 6,
};

enum class ACLRotationFormat {
    ACLRF_Quat_128 = 0,
    ACLRF_QuatDropW_96 = 1,
    ACLRF_QuatDropW_Variable = 2,
    ACLRF_MAX = 3,
};

enum class ACLVectorFormat {
    ACLVF_Vector3_96 = 0,
    ACLVF_Vector3_Variable = 1,
    ACLVF_Vector3_MAX = 2,
};

enum class ACLVisualFidelity {
    Highest = 0,
    Medium = 1,
    Lowest = 2,
    ACLVisualFidelity_MAX = 3,
};

enum class ACLVisualFidelityChangeResult {
    Dispatched = 0,
    Completed = 1,
    Failed = 2,
    ACLVisualFidelityChangeResult_MAX = 3,
};

// Size: 0x38
class UAnimBoneCompressionCodec_ACL : public UAnimBoneCompressionCodec_ACLBase {
};

// Size: 0x38
class UAnimBoneCompressionCodec_ACLBase : public UAnimBoneCompressionCodec {
};

// Size: 0x38
class UAnimBoneCompressionCodec_ACLCustom : public UAnimBoneCompressionCodec_ACLBase {
};

// Size: 0x40
class UAnimBoneCompressionCodec_ACLDatabase : public UAnimBoneCompressionCodec_ACLBase {
    /* 0x0038 */ UAnimationCompressionLibraryDatabase* DatabaseAsset;
};

// Size: 0x38
class UAnimBoneCompressionCodec_ACLSafe : public UAnimBoneCompressionCodec_ACLBase {
};

// Size: 0x28
class UAnimCurveCompressionCodec_ACL : public UAnimCurveCompressionCodec {
};

// Size: 0x128
class UAnimationCompressionLibraryDatabase : public UObject {
    /* 0x0028 */ TArray<uint8_t> CookedCompressedBytes;
    /* 0x0038 */ TArray<uint64_t> CookedAnimSequenceMappings;
    /* 0x0120 */ uint32_t MaxStreamRequestSizeKB;
    /* 0x0124 */ ACLVisualFidelity DefaultVisualFidelity;

    static ACLVisualFidelity GetVisualFidelity(UAnimationCompressionLibraryDatabase* DatabaseAsset);
    static void SetVisualFidelity(UObject* WorldContextObject, FLatentActionInfo LatentInfo, UAnimationCompressionLibraryDatabase* DatabaseAsset, ACLVisualFidelityChangeResult& Result, ACLVisualFidelity VisualFidelity);
};

// Size: 0x68
class UAIAsyncTaskBlueprintProxy : public UObject {
    /* 0x0028 */ FMulticastInlineDelegate OnSuccess;
    /* 0x0038 */ FMulticastInlineDelegate OnFail;

    void OnMoveCompleted(FAIRequestID RequestId, uint8_t MovementResult);
};

// Size: 0x28
class UAIBlueprintHelperLibrary : public UBlueprintFunctionLibrary {

    static UAIAsyncTaskBlueprintProxy* CreateMoveToProxyObject(UObject* WorldContextObject, APawn* Pawn, FVector destination, AActor* TargetActor, float AcceptanceRadius, bool bStopOnOverlap);
    static AAIController* GetAIController(AActor* ControlledActor);
    static UBlackboardComponent* GetBlackboard(AActor* Target);
    static UNavigationPath* GetCurrentPath(AController* Controller);
    static int32_t GetCurrentPathIndex(const AController* Controller);
    static TArray<FVector> GetCurrentPathPoints(AController* Controller);
    static int32_t GetNextNavLinkIndex(const AController* Controller);
    static bool IsValidAIDirection(FVector DirectionVector);
    static bool IsValidAILocation(FVector Location);
    static bool IsValidAIRotation(FRotator Rotation);
    static void LockAIResourcesWithAnimation(UAnimInstance* AnimInstance, bool bLockMovement, bool LockAILogic);
    static void SendAIMessage(APawn* Target, FName Message, UObject* MessageSource, bool bSuccess);
    static void SimpleMoveToActor(AController* Controller, const AActor* Goal);
    static void SimpleMoveToLocation(AController* Controller, const FVector& Goal);
    static APawn* SpawnAIFromClass(UObject* WorldContextObject, UClass* PawnClass, UBehaviorTree* BehaviorTree, FVector Location, FRotator Rotation, bool bNoCollisionFail, AActor* Owner);
    static void UnlockAIResourcesWithAnimation(UAnimInstance* AnimInstance, bool bUnlockMovement, bool UnlockAILogic);
};

// Size: 0x3c8
class AAIController : public AController {
    /* 0x0378 */ bool bStartAILogicOnPossess;
    /* 0x0378 */ bool bStopAILogicOnUnposses;
    /* 0x0378 */ bool bLOSflag;
    /* 0x0378 */ bool bSkipExtraLOSChecks;
    /* 0x0378 */ bool bAllowStrafe;
    /* 0x0378 */ bool bWantsPlayerState;
    /* 0x0378 */ bool bSetControlRotationFromPawnOrientation;
    /* 0x0380 */ UPathFollowingComponent* PathFollowingComponent;
    /* 0x0388 */ UBrainComponent* BrainComponent;
    /* 0x0390 */ UAIPerceptionComponent* PerceptionComponent;
    /* 0x0398 */ UBlackboardComponent* Blackboard;
    /* 0x03a0 */ UGameplayTasksComponent* CachedGameplayTasksComponent;
    /* 0x03a8 */ UClass* DefaultNavigationFilterClass;
    /* 0x03b0 */ FMulticastInlineDelegate ReceiveMoveCompleted;

    void ClaimTaskResource(UClass* ResourceClass);
    UAIPerceptionComponent* GetAIPerceptionComponent();
    FVector GetFocalPoint() const;
    FVector GetFocalPointOnActor(const AActor* Actor) const;
    AActor* GetFocusActor() const;
    FVector GetImmediateMoveDestination() const;
    uint8_t GetMoveStatus() const;
    UPathFollowingComponent* GetPathFollowingComponent() const;
    bool HasPartialPath() const;
    void K2_ClearFocus();
    void K2_SetFocalPoint(FVector FP);
    void K2_SetFocus(AActor* NewFocus);
    uint8_t MoveToActor(AActor* Goal, float AcceptanceRadius, bool bStopOnOverlap, bool bUsePathfinding, bool bCanStrafe, UClass* FilterClass, bool bAllowPartialPath);
    uint8_t MoveToLocation(const FVector& Dest, float AcceptanceRadius, bool bStopOnOverlap, bool bUsePathfinding, bool bProjectDestinationToNavigation, bool bCanStrafe, UClass* FilterClass, bool bAllowPartialPath);
    void OnGameplayTaskResourcesClaimed(FGameplayResourceSet NewlyClaimed, FGameplayResourceSet FreshlyReleased);
    void OnUsingBlackBoard(UBlackboardComponent* BlackboardComp, UBlackboardData* BlackboardAsset);
    bool RunBehaviorTree(UBehaviorTree* BTAsset);
    void SetMoveBlockDetection(bool bEnable);
    void SetPathFollowingComponent(UPathFollowingComponent* NewPFComponent);
    void UnclaimTaskResource(UClass* ResourceClass);
    bool UseBlackboard(UBlackboardData* BlackboardAsset, UBlackboardComponent*& BlackboardComponent);
};

// Size: 0x50
struct FAIDamageEvent {
    /* 0x0000 */ float amount;
    /* 0x0008 */ FVector Location;
    /* 0x0020 */ FVector HitLocation;
    /* 0x0038 */ AActor* DamagedActor;
    /* 0x0040 */ AActor* Instigator;
    /* 0x0048 */ FName Tag;
};

// Size: 0x28
class UAIDataProvider : public UObject {
};

// Size: 0x38
struct FAIDataProviderBoolValue : public FAIDataProviderTypedValue {
    /* 0x0030 */ bool DefaultValue;
};

// Size: 0x38
struct FAIDataProviderFloatValue : public FAIDataProviderTypedValue {
    /* 0x0030 */ float DefaultValue;
};

// Size: 0x38
struct FAIDataProviderIntValue : public FAIDataProviderTypedValue {
    /* 0x0030 */ int32_t DefaultValue;
};

// Size: 0x30
struct FAIDataProviderStructValue : public FAIDataProviderValue {
};

// Size: 0x30
struct FAIDataProviderTypedValue : public FAIDataProviderValue {
    /* 0x0020 */ UClass* PropertyType;
};

// Size: 0x20
struct FAIDataProviderValue {
    /* 0x0010 */ UAIDataProvider* DataBinding;
    /* 0x0018 */ FName DataField;
};

// Size: 0x40
class UAIDataProvider_QueryParams : public UAIDataProvider {
    /* 0x0028 */ FName paramName;
    /* 0x0030 */ float FloatValue;
    /* 0x0034 */ int32_t IntValue;
    /* 0x0038 */ bool boolValue;
};

// Size: 0x50
class UAIDataProvider_Random : public UAIDataProvider_QueryParams {
    /* 0x0040 */ float min;
    /* 0x0044 */ float max;
    /* 0x0048 */ bool bInteger;
};

// Size: 0x38
struct FAIDynamicParam {
    /* 0x0000 */ FName paramName;
    /* 0x0008 */ EAIParamType ParamType;
    /* 0x0009 */ bool bAllowBBKey;
    /* 0x000c */ float Value;
    /* 0x0010 */ FBlackboardKeySelector BBKey;
};

// Size: 0x28
class UAIHotSpotManager : public UObject {
};

// Size: 0x50
struct FAIMoveRequest {
    /* 0x0000 */ TWeakObjectPtr<AActor> GoalActor;
};

// Size: 0x40
struct FAINoiseEvent {
    /* 0x0008 */ FVector NoiseLocation;
    /* 0x0020 */ float Loudness;
    /* 0x0024 */ float MaxRange;
    /* 0x0028 */ AActor* Instigator;
    /* 0x0030 */ FName Tag;
};

// Size: 0x1a8
class UAIPerceptionComponent : public UActorComponent {
    /* 0x00b8 */ TArray<UAISenseConfig*> SensesConfig;
    /* 0x00c8 */ UClass* DominantSense;
    /* 0x00e0 */ AAIController* AIOwner;
    /* 0x0168 */ FMulticastInlineDelegate OnPerceptionUpdated;
    /* 0x0178 */ FMulticastInlineDelegate OnTargetPerceptionForgotten;
    /* 0x0188 */ FMulticastInlineDelegate OnTargetPerceptionUpdated;
    /* 0x0198 */ FMulticastInlineDelegate OnTargetPerceptionInfoUpdated;

    void ForgetAll();
    bool GetActorsPerception(AActor* Actor, FActorPerceptionBlueprintInfo& Info);
    void GetCurrentlyPerceivedActors(UClass* SenseToUse, TArray<AActor*>& OutActors) const;
    void GetKnownPerceivedActors(UClass* SenseToUse, TArray<AActor*>& OutActors) const;
    void GetPerceivedHostileActors(TArray<AActor*>& OutActors) const;
    void GetPerceivedHostileActorsBySense(const UClass* SenseToUse, TArray<AActor*>& OutActors) const;
    bool IsSenseEnabled(UClass* SenseClass) const;
    void OnOwnerEndPlay(AActor* Actor, uint8_t EndPlayReason);
    void RequestStimuliListenerUpdate();
    void SetSenseEnabled(UClass* SenseClass, const bool bEnable);
};

// Size: 0x28
class IAIPerceptionListenerInterface : public UInterface {
};

// Size: 0xd0
class UAIPerceptionStimuliSourceComponent : public UActorComponent {
    /* 0x00b8 */ bool bAutoRegisterAsSource;
    /* 0x00c0 */ TArray<UClass*> RegisterAsSourceForSenses;

    void RegisterForSense(UClass* SenseClass);
    void RegisterWithPerceptionSystem();
    void UnregisterFromPerceptionSystem();
    void UnregisterFromSense(UClass* SenseClass);
};

// Size: 0x138
class UAIPerceptionSystem : public UAISubsystem {
    /* 0x0088 */ TArray<UAISense*> Senses;
    /* 0x0098 */ float PerceptionAgingRate;

    static UClass* GetSenseClassForStimulus(UObject* WorldContextObject, const FAIStimulus& Stimulus);
    void OnPerceptionStimuliSourceEndPlay(AActor* Actor, uint8_t EndPlayReason);
    static bool RegisterPerceptionStimuliSource(UObject* WorldContextObject, UClass* Sense, AActor* Target);
    void ReportEvent(UAISenseEvent* PerceptionEvent);
    static void ReportPerceptionEvent(UObject* WorldContextObject, UAISenseEvent* PerceptionEvent);
};

// Size: 0x18
struct FAIPredictionEvent {
    /* 0x0000 */ AActor* Requestor;
    /* 0x0008 */ AActor* PredictedActor;
};

// Size: 0x4
struct FAIRequestID {
    /* 0x0000 */ uint32_t RequestId;
};

// Size: 0x28
class IAIResourceInterface : public UInterface {
};

// Size: 0x38
class UAIResource_Logic : public UGameplayTaskResource {
};

// Size: 0x38
class UAIResource_Movement : public UGameplayTaskResource {
};

// Size: 0x78
class UAISense : public UObject {
    /* 0x0028 */ EAISenseNotifyType NotifyType;
    /* 0x002c */ bool bWantsNewPawnNotification;
    /* 0x002c */ bool bAutoRegisterAllPawnsAsSources;
    /* 0x0030 */ UAIPerceptionSystem* PerceptionSystemInstance;
};

// Size: 0x4
struct FAISenseAffiliationFilter {
    /* 0x0000 */ bool bDetectEnemies;
    /* 0x0000 */ bool bDetectNeutrals;
    /* 0x0000 */ bool bDetectFriendlies;
};

// Size: 0x108
class UAISenseBlueprintListener : public UUserDefinedStruct {
};

// Size: 0x48
class UAISenseConfig : public UObject {
    /* 0x0028 */ FColor DebugColor;
    /* 0x002c */ float MaxAge;
    /* 0x0030 */ bool bStartsEnabled;
};

// Size: 0x50
class UAISenseConfig_Blueprint : public UAISenseConfig {
    /* 0x0048 */ UClass* Implementation;
};

// Size: 0x50
class UAISenseConfig_Damage : public UAISenseConfig {
    /* 0x0048 */ UClass* Implementation;
};

// Size: 0x60
class UAISenseConfig_Hearing : public UAISenseConfig {
    /* 0x0048 */ UClass* Implementation;
    /* 0x0050 */ float HearingRange;
    /* 0x0054 */ float LoSHearingRange;
    /* 0x0058 */ bool bUseLoSHearing;
    /* 0x005c */ FAISenseAffiliationFilter DetectionByAffiliation;
};

// Size: 0x48
class UAISenseConfig_Prediction : public UAISenseConfig {
};

// Size: 0x70
class UAISenseConfig_Sight : public UAISenseConfig {
    /* 0x0048 */ UClass* Implementation;
    /* 0x0050 */ float SightRadius;
    /* 0x0054 */ float LoseSightRadius;
    /* 0x0058 */ float PeripheralVisionAngleDegrees;
    /* 0x005c */ FAISenseAffiliationFilter DetectionByAffiliation;
    /* 0x0060 */ float AutoSuccessRangeFromLastSeenLocation;
    /* 0x0064 */ float PointOfViewBackwardOffset;
    /* 0x0068 */ float NearClippingRadius;
};

// Size: 0x48
class UAISenseConfig_Team : public UAISenseConfig {
};

// Size: 0x50
class UAISenseConfig_Touch : public UAISenseConfig {
    /* 0x0048 */ FAISenseAffiliationFilter DetectionByAffiliation;
};

// Size: 0x28
class UAISenseEvent : public UObject {
};

// Size: 0x78
class UAISenseEvent_Damage : public UAISenseEvent {
    /* 0x0028 */ FAIDamageEvent Event;
};

// Size: 0x68
class UAISenseEvent_Hearing : public UAISenseEvent {
    /* 0x0028 */ FAINoiseEvent Event;
};

// Size: 0xa0
class UAISense_Blueprint : public UAISense {
    /* 0x0078 */ UClass* ListenerDataType;
    /* 0x0080 */ TArray<UAIPerceptionComponent*> ListenerContainer;
    /* 0x0090 */ TArray<UAISenseEvent*> UnprocessedEvents;

    void GetAllListenerActors(TArray<AActor*>& ListenerActors) const;
    void GetAllListenerComponents(TArray<UAIPerceptionComponent*>& ListenerComponents) const;
    void K2_OnNewPawn(APawn* NewPawn);
    void OnListenerRegistered(AActor* ActorListener, UAIPerceptionComponent* PerceptionComponent);
    void OnListenerUnregistered(AActor* ActorListener, UAIPerceptionComponent* PerceptionComponent);
    void OnListenerUpdated(AActor* ActorListener, UAIPerceptionComponent* PerceptionComponent);
    float OnUpdate(const TArray<UAISenseEvent*>& EventsToProcess);
};

// Size: 0x88
class UAISense_Damage : public UAISense {
    /* 0x0078 */ TArray<FAIDamageEvent> RegisteredEvents;

    static void ReportDamageEvent(UObject* WorldContextObject, AActor* DamagedActor, AActor* Instigator, float DamageAmount, FVector EventLocation, FVector HitLocation, FName Tag);
};

// Size: 0xe0
class UAISense_Hearing : public UAISense {
    /* 0x0078 */ TArray<FAINoiseEvent> NoiseEvents;
    /* 0x0088 */ float SpeedOfSoundSq;

    static void ReportNoiseEvent(UObject* WorldContextObject, FVector NoiseLocation, float Loudness, AActor* Instigator, float MaxRange, FName Tag);
};

// Size: 0x88
class UAISense_Prediction : public UAISense {
    /* 0x0078 */ TArray<FAIPredictionEvent> RegisteredEvents;

    static void RequestControllerPredictionEvent(AAIController* Requestor, AActor* PredictedActor, float PredictionTime);
    static void RequestPawnPredictionEvent(APawn* Requestor, AActor* PredictedActor, float PredictionTime);
};

// Size: 0x1a8
class UAISense_Sight : public UAISense {
    /* 0x0150 */ int32_t MaxTracesPerTick;
    /* 0x0154 */ int32_t MaxAsyncTracesPerTick;
    /* 0x0158 */ int32_t MinQueriesPerTimeSliceCheck;
    /* 0x0160 */ double MaxTimeSlicePerTick;
    /* 0x0168 */ float HighImportanceQueryDistanceThreshold;
    /* 0x0170 */ float MaxQueryImportance;
    /* 0x0174 */ float SightLimitQueryImportance;
    /* 0x0178 */ float PendingQueriesBudgetReductionRatio;
    /* 0x017c */ bool bUseAsynchronousTraceForDefaultSightQueries;
};

// Size: 0x88
class UAISense_Team : public UAISense {
    /* 0x0078 */ TArray<FAITeamStimulusEvent> RegisteredEvents;
};

// Size: 0xd8
class UAISense_Touch : public UAISense {
    /* 0x0078 */ TArray<FAITouchEvent> RegisteredEvents;

    static void ReportTouchEvent(UObject* WorldContextObject, AActor* TouchReceiver, AActor* OtherActor, FVector Location);
};

// Size: 0x18
struct FAISightEvent {
    /* 0x0008 */ AActor* SeenActor;
    /* 0x0010 */ AActor* Observer;
};

// Size: 0x28
class IAISightTargetInterface : public UInterface {
};

// Size: 0x58
struct FAIStimulus {
    /* 0x0000 */ float Age;
    /* 0x0004 */ float ExpirationAge;
    /* 0x0008 */ float Strength;
    /* 0x0010 */ FVector StimulusLocation;
    /* 0x0028 */ FVector ReceiverLocation;
    /* 0x0040 */ FName Tag;
    /* 0x0054 */ bool bSuccessfullySensed;
};

// Size: 0x38
class UAISubsystem : public UObject {
    /* 0x0030 */ UAISystem* AISystem;
};

// Size: 0x1a0
class UAISystem : public UAISystemBase {
    /* 0x0060 */ FSoftClassPath PerceptionSystemClassName;
    /* 0x0080 */ FSoftClassPath HotSpotManagerClassName;
    /* 0x00a0 */ FSoftClassPath EnvQueryManagerClassName;
    /* 0x00c0 */ float AcceptanceRadius;
    /* 0x00c4 */ float PathfollowingRegularPathPointAcceptanceRadius;
    /* 0x00c8 */ float PathfollowingNavLinkAcceptanceRadius;
    /* 0x00cc */ bool bFinishMoveOnGoalOverlap;
    /* 0x00cd */ bool bAcceptPartialPaths;
    /* 0x00ce */ bool bAllowStrafing;
    /* 0x00cf */ bool bAllowControllersAsEQSQuerier;
    /* 0x00d0 */ bool bEnableDebuggerPlugin;
    /* 0x00d1 */ bool bForgetStaleActors;
    /* 0x00d2 */ bool bAddBlackboardSelfKey;
    /* 0x00d3 */ bool bClearBBEntryOnBTEQSFail;
    /* 0x00d4 */ bool bBlackboardKeyDecoratorAllowsNoneAsValue;
    /* 0x00d8 */ TSoftObjectPtr<UBlackboardData> DefaultBlackboard;
    /* 0x0100 */ uint8_t DefaultSightCollisionChannel;
    /* 0x0108 */ UBehaviorTreeManager* BehaviorTreeManager;
    /* 0x0110 */ UEnvQueryManager* EnvironmentQueryManager;
    /* 0x0118 */ UAIPerceptionSystem* PerceptionSystem;
    /* 0x0120 */ TArray<UAIAsyncTaskBlueprintProxy*> AllProxyObjects;
    /* 0x0130 */ UAIHotSpotManager* HotSpotManager;
    /* 0x0138 */ UNavLocalGridManager* NavLocalGrids;

    void AIIgnorePlayers();
    void AILoggingVerbose();
};

// Size: 0x70
class UAITask : public UGameplayTask {
    /* 0x0068 */ AAIController* OwnerController;
};

// Size: 0x70
class UAITask_LockLogic : public UAITask {
};

// Size: 0x138
class UAITask_MoveTo : public UAITask {
    /* 0x0088 */ FMulticastInlineDelegate OnRequestFailed;
    /* 0x0098 */ FMulticastInlineDelegate OnMoveFinished;
    /* 0x00a8 */ FAIMoveRequest MoveRequest;

    static UAITask_MoveTo* AIMoveTo(AAIController* Controller, FVector GoalLocation, AActor* GoalActor, float AcceptanceRadius, uint8_t StopOnOverlap, uint8_t AcceptPartialPath, bool bUsePathfinding, bool bLockAILogic, bool bUseContinuousGoalTracking, uint8_t ProjectGoalOnNavigation, uint8_t RequireNavigableEndLocation);
};

// Size: 0xe8
class UAITask_RunEQS : public UAITask {

    static UAITask_RunEQS* RunEQS(AAIController* Controller, UEnvQuery* QueryTemplate);
};

// Size: 0x50
struct FAITeamStimulusEvent {
    /* 0x0040 */ AActor* Broadcaster;
    /* 0x0048 */ AActor* Enemy;
};

// Size: 0x30
struct FAITouchEvent {
    /* 0x0018 */ AActor* TouchReceiver;
    /* 0x0020 */ AActor* OtherActor;
};

// Size: 0x20
struct FActorPerceptionBlueprintInfo {
    /* 0x0000 */ AActor* Target;
    /* 0x0008 */ TArray<FAIStimulus> LastSensedStimuli;
    /* 0x0018 */ bool bIsHostile;
    /* 0x0018 */ bool bIsFriendly;
};

// Size: 0x68
struct FActorPerceptionUpdateInfo {
    /* 0x0000 */ int32_t TargetId;
    /* 0x0004 */ TWeakObjectPtr<AActor> Target;
    /* 0x0010 */ FAIStimulus Stimulus;
};

// Size: 0x60
class UBTAuxiliaryNode : public UBTNode {
};

// Size: 0x30
struct FBTCompositeChild {
    /* 0x0000 */ UBTCompositeNode* ChildComposite;
    /* 0x0008 */ UBTTaskNode* ChildTask;
    /* 0x0010 */ TArray<UBTDecorator*> Decorators;
    /* 0x0020 */ TArray<FBTDecoratorLogic> DecoratorOps;
};

// Size: 0x80
class UBTCompositeNode : public UBTNode {
    /* 0x0058 */ TArray<FBTCompositeChild> Children;
    /* 0x0068 */ TArray<UBTService*> Services;
    /* 0x0078 */ bool bApplyDecoratorScope;
};

// Size: 0x80
class UBTComposite_Selector : public UBTCompositeNode {
};

// Size: 0x80
class UBTComposite_Sequence : public UBTCompositeNode {
};

// Size: 0x88
class UBTComposite_SimpleParallel : public UBTCompositeNode {
    /* 0x0080 */ uint8_t FinishMode;
};

// Size: 0x68
class UBTDecorator : public UBTAuxiliaryNode {
    /* 0x0060 */ bool bInverseCondition;
    /* 0x0064 */ uint8_t FlowAbortMode;
};

// Size: 0x4
struct FBTDecoratorLogic {
    /* 0x0000 */ uint8_t Operation;
    /* 0x0002 */ uint16_t Number;
};

// Size: 0xc0
class UBTDecorator_Blackboard : public UBTDecorator_BlackboardBase {
    /* 0x0090 */ int32_t IntValue;
    /* 0x0094 */ float FloatValue;
    /* 0x0098 */ FString StringValue;
    /* 0x00a8 */ FString CachedDescription;
    /* 0x00b8 */ uint8_t OperationType;
    /* 0x00b9 */ uint8_t NotifyObserver;
};

// Size: 0x90
class UBTDecorator_BlackboardBase : public UBTDecorator {
    /* 0x0068 */ FBlackboardKeySelector BlackboardKey;
};

// Size: 0xa0
class UBTDecorator_BlueprintBase : public UBTDecorator {
    /* 0x0068 */ AAIController* AIOwner;
    /* 0x0070 */ AActor* ActorOwner;
    /* 0x0078 */ TArray<FName> ObservedKeyNames;
    /* 0x0098 */ bool bShowPropertyDetails;
    /* 0x0098 */ bool bCheckConditionOnlyBlackBoardChanges;

    bool IsDecoratorExecutionActive() const;
    bool IsDecoratorObserverActive() const;
    bool PerformConditionCheck(AActor* OwnerActor);
    bool PerformConditionCheckAI(AAIController* OwnerController, APawn* ControlledPawn);
    void ReceiveExecutionFinish(AActor* OwnerActor, uint8_t NodeResult);
    void ReceiveExecutionFinishAI(AAIController* OwnerController, APawn* ControlledPawn, uint8_t NodeResult);
    void ReceiveExecutionStart(AActor* OwnerActor);
    void ReceiveExecutionStartAI(AAIController* OwnerController, APawn* ControlledPawn);
    void ReceiveObserverActivated(AActor* OwnerActor);
    void ReceiveObserverActivatedAI(AAIController* OwnerController, APawn* ControlledPawn);
    void ReceiveObserverDeactivated(AActor* OwnerActor);
    void ReceiveObserverDeactivatedAI(AAIController* OwnerController, APawn* ControlledPawn);
    void ReceiveTick(AActor* OwnerActor, float DeltaSeconds);
    void ReceiveTickAI(AAIController* OwnerController, APawn* ControlledPawn, float DeltaSeconds);
};

// Size: 0xc8
class UBTDecorator_CheckGameplayTagsOnActor : public UBTDecorator {
    /* 0x0068 */ FBlackboardKeySelector ActorToCheck;
    /* 0x0090 */ EGameplayContainerMatchType TagsToMatch;
    /* 0x0098 */ FGameplayTagContainer GameplayTags;
    /* 0x00b8 */ FString CachedDescription;
};

// Size: 0xc0
class UBTDecorator_CompareBBEntries : public UBTDecorator {
    /* 0x0068 */ uint8_t Operator;
    /* 0x0070 */ FBlackboardKeySelector BlackboardKeyA;
    /* 0x0098 */ FBlackboardKeySelector BlackboardKeyB;
};

// Size: 0xc0
class UBTDecorator_ConditionalLoop : public UBTDecorator_Blackboard {
};

// Size: 0xf0
class UBTDecorator_ConeCheck : public UBTDecorator {
    /* 0x0068 */ FValueOrBBKey_Float ConeHalfAngle;
    /* 0x0078 */ FBlackboardKeySelector ConeOrigin;
    /* 0x00a0 */ FBlackboardKeySelector ConeDirection;
    /* 0x00c8 */ FBlackboardKeySelector Observed;
};

// Size: 0x78
class UBTDecorator_Cooldown : public UBTDecorator {
    /* 0x0068 */ FValueOrBBKey_Float CoolDownTime;
};

// Size: 0x108
class UBTDecorator_DoesPathExist : public UBTDecorator {
    /* 0x0068 */ FBlackboardKeySelector BlackboardKeyA;
    /* 0x0090 */ FBlackboardKeySelector BlackboardKeyB;
    /* 0x00b8 */ bool bUseSelf;
    /* 0x00c0 */ FValueOrBBKey_Enum PathQueryType;
    /* 0x00e8 */ FValueOrBBKey_Class FilterClass;
};

// Size: 0x68
class UBTDecorator_ForceSuccess : public UBTDecorator {
};

// Size: 0xf8
class UBTDecorator_IsAtLocation : public UBTDecorator_BlackboardBase {
    /* 0x0090 */ float AcceptableRadius;
    /* 0x0098 */ FAIDataProviderFloatValue ParametrizedAcceptableRadius;
    /* 0x00d0 */ FAIDistanceType GeometricDistanceType;
    /* 0x00d4 */ bool bUseParametrizedRadius;
    /* 0x00d8 */ FValueOrBBKey_Bool bUseNavAgentGoalLocation;
    /* 0x00e8 */ FValueOrBBKey_Bool bPathFindingBasedTest;
};

// Size: 0xb0
class UBTDecorator_IsBBEntryOfClass : public UBTDecorator_BlackboardBase {
    /* 0x0090 */ FValueOrBBKey_Class TestClass;
};

// Size: 0xd0
class UBTDecorator_KeepInCone : public UBTDecorator {
    /* 0x0068 */ FValueOrBBKey_Float ConeHalfAngle;
    /* 0x0078 */ FBlackboardKeySelector ConeOrigin;
    /* 0x00a0 */ FBlackboardKeySelector Observed;
    /* 0x00c8 */ bool bUseSelfAsOrigin;
    /* 0x00c8 */ bool bUseSelfAsObserved;
};

// Size: 0x90
class UBTDecorator_Loop : public UBTDecorator {
    /* 0x0068 */ FValueOrBBKey_Int32 NumLoops;
    /* 0x0078 */ bool bInfiniteLoop;
    /* 0x007c */ FValueOrBBKey_Float InfiniteLoopTimeoutTime;
};

// Size: 0x90
class UBTDecorator_LoopUntil : public UBTDecorator {
    /* 0x0068 */ FValueOrBBKey_Enum RequiredResult;
};

// Size: 0x68
class UBTDecorator_ReachedMoveGoal : public UBTDecorator {
};

// Size: 0x90
class UBTDecorator_SetTagCooldown : public UBTDecorator {
    /* 0x0068 */ FGameplayTag CooldownTag;
    /* 0x0070 */ FValueOrBBKey_Float CooldownDuration;
    /* 0x0080 */ FValueOrBBKey_Bool bAddToExistingDuration;
};

// Size: 0xa0
class UBTDecorator_TagCooldown : public UBTDecorator {
    /* 0x0068 */ FGameplayTag CooldownTag;
    /* 0x0070 */ FValueOrBBKey_Float CooldownDuration;
    /* 0x0080 */ FValueOrBBKey_Bool bAddToExistingDuration;
    /* 0x0090 */ FValueOrBBKey_Bool bActivatesCooldown;
};

// Size: 0x78
class UBTDecorator_TimeLimit : public UBTDecorator {
    /* 0x0068 */ FValueOrBBKey_Float TimeLimit;
};

// Size: 0x28
class UBTFunctionLibrary : public UBlueprintFunctionLibrary {

    static void ClearBlackboardValue(UBTNode* NodeOwner, const FBlackboardKeySelector& Key);
    static void ClearBlackboardValueAsVector(UBTNode* NodeOwner, const FBlackboardKeySelector& Key);
    static AActor* GetBlackboardValueAsActor(UBTNode* NodeOwner, const FBlackboardKeySelector& Key);
    static bool GetBlackboardValueAsBool(UBTNode* NodeOwner, const FBlackboardKeySelector& Key);
    static UClass* GetBlackboardValueAsClass(UBTNode* NodeOwner, const FBlackboardKeySelector& Key);
    static uint8_t GetBlackboardValueAsEnum(UBTNode* NodeOwner, const FBlackboardKeySelector& Key);
    static float GetBlackboardValueAsFloat(UBTNode* NodeOwner, const FBlackboardKeySelector& Key);
    static int32_t GetBlackboardValueAsInt(UBTNode* NodeOwner, const FBlackboardKeySelector& Key);
    static FName GetBlackboardValueAsName(UBTNode* NodeOwner, const FBlackboardKeySelector& Key);
    static UObject* GetBlackboardValueAsObject(UBTNode* NodeOwner, const FBlackboardKeySelector& Key);
    static FRotator GetBlackboardValueAsRotator(UBTNode* NodeOwner, const FBlackboardKeySelector& Key);
    static FString GetBlackboardValueAsString(UBTNode* NodeOwner, const FBlackboardKeySelector& Key);
    static FVector GetBlackboardValueAsVector(UBTNode* NodeOwner, const FBlackboardKeySelector& Key);
    static UBehaviorTreeComponent* GetOwnerComponent(UBTNode* NodeOwner);
    static UBlackboardComponent* GetOwnersBlackboard(UBTNode* NodeOwner);
    static void SetBlackboardValueAsBool(UBTNode* NodeOwner, const FBlackboardKeySelector& Key, bool Value);
    static void SetBlackboardValueAsClass(UBTNode* NodeOwner, const FBlackboardKeySelector& Key, UClass* Value);
    static void SetBlackboardValueAsEnum(UBTNode* NodeOwner, const FBlackboardKeySelector& Key, uint8_t Value);
    static void SetBlackboardValueAsFloat(UBTNode* NodeOwner, const FBlackboardKeySelector& Key, float Value);
    static void SetBlackboardValueAsInt(UBTNode* NodeOwner, const FBlackboardKeySelector& Key, int32_t Value);
    static void SetBlackboardValueAsName(UBTNode* NodeOwner, const FBlackboardKeySelector& Key, FName Value);
    static void SetBlackboardValueAsObject(UBTNode* NodeOwner, const FBlackboardKeySelector& Key, UObject* Value);
    static void SetBlackboardValueAsRotator(UBTNode* NodeOwner, const FBlackboardKeySelector& Key, FRotator Value);
    static void SetBlackboardValueAsString(UBTNode* NodeOwner, const FBlackboardKeySelector& Key, FString Value);
    static void SetBlackboardValueAsVector(UBTNode* NodeOwner, const FBlackboardKeySelector& Key, FVector Value);
    static void StartUsingExternalEvent(UBTNode* NodeOwner, AActor* OwningActor);
    static void StopUsingExternalEvent(UBTNode* NodeOwner);
};

// Size: 0x58
class UBTNode : public UObject {
    /* 0x0030 */ FString NodeName;
    /* 0x0040 */ UBehaviorTree* TreeAsset;
    /* 0x0048 */ UBTCompositeNode* ParentNode;
};

// Size: 0x70
class UBTService : public UBTAuxiliaryNode {
    /* 0x0060 */ float interval;
    /* 0x0064 */ float RandomDeviation;
    /* 0x0068 */ bool bCallTickOnSearchStart;
    /* 0x0068 */ bool bRestartTimerOnEachActivation;
};

// Size: 0x98
class UBTService_BlackboardBase : public UBTService {
    /* 0x0070 */ FBlackboardKeySelector BlackboardKey;
};

// Size: 0x98
class UBTService_BlueprintBase : public UBTService {
    /* 0x0070 */ AAIController* AIOwner;
    /* 0x0078 */ AActor* ActorOwner;
    /* 0x0090 */ bool bShowPropertyDetails;
    /* 0x0090 */ bool bShowEventDetails;

    bool IsServiceActive() const;
    void ReceiveActivation(AActor* OwnerActor);
    void ReceiveActivationAI(AAIController* OwnerController, APawn* ControlledPawn);
    void ReceiveDeactivation(AActor* OwnerActor);
    void ReceiveDeactivationAI(AAIController* OwnerController, APawn* ControlledPawn);
    void ReceiveSearchStart(AActor* OwnerActor);
    void ReceiveSearchStartAI(AAIController* OwnerController, APawn* ControlledPawn);
    void ReceiveTick(AActor* OwnerActor, float DeltaSeconds);
    void ReceiveTickAI(AAIController* OwnerController, APawn* ControlledPawn, float DeltaSeconds);
};

// Size: 0xa0
class UBTService_DefaultFocus : public UBTService_BlackboardBase {
    /* 0x0098 */ uint8_t FocusPriority;
};

// Size: 0xf8
class UBTService_RunEQS : public UBTService_BlackboardBase {
    /* 0x0098 */ FEQSParametrizedQueryExecutionRequest EQSRequest;
    /* 0x00e0 */ bool bUpdateBBOnFail;
};

// Size: 0x70
class UBTTaskNode : public UBTNode {
    /* 0x0058 */ TArray<UBTService*> Services;
    /* 0x0068 */ bool bIgnoreRestartSelf;
};

// Size: 0x98
class UBTTask_BlackboardBase : public UBTTaskNode {
    /* 0x0070 */ FBlackboardKeySelector BlackboardKey;
};

// Size: 0xa8
class UBTTask_BlueprintBase : public UBTTaskNode {
    /* 0x0070 */ AAIController* AIOwner;
    /* 0x0078 */ AActor* ActorOwner;
    /* 0x0080 */ FIntervalCountdown TickInterval;
    /* 0x00a0 */ bool bShowPropertyDetails;

    void FinishAbort();
    void FinishExecute(bool bSuccess);
    bool IsTaskAborting() const;
    bool IsTaskExecuting() const;
    void ReceiveAbort(AActor* OwnerActor);
    void ReceiveAbortAI(AAIController* OwnerController, APawn* ControlledPawn);
    void ReceiveExecute(AActor* OwnerActor);
    void ReceiveExecuteAI(AAIController* OwnerController, APawn* ControlledPawn);
    void ReceiveTick(AActor* OwnerActor, float DeltaSeconds);
    void ReceiveTickAI(AAIController* OwnerController, APawn* ControlledPawn, float DeltaSeconds);
    void SetFinishOnMessage(FName MessageName);
    void SetFinishOnMessageWithId(FName MessageName, int32_t RequestId);
};

// Size: 0x98
class UBTTask_FinishWithResult : public UBTTaskNode {
    /* 0x0070 */ FValueOrBBKey_Enum Result;
};

// Size: 0x80
class UBTTask_GameplayTaskBase : public UBTTaskNode {
    /* 0x0070 */ FValueOrBBKey_Bool bWaitForGameplayTask;
};

// Size: 0x80
class UBTTask_MakeNoise : public UBTTaskNode {
    /* 0x0070 */ FValueOrBBKey_Float Loudnes;
};

// Size: 0x160
class UBTTask_MoveDirectlyToward : public UBTTask_MoveTo {
};

// Size: 0x160
class UBTTask_MoveTo : public UBTTask_BlackboardBase {
    /* 0x0098 */ FValueOrBBKey_Float AcceptableRadius;
    /* 0x00a8 */ FValueOrBBKey_Class FilterClass;
    /* 0x00c8 */ FValueOrBBKey_Float ObservedBlackboardValueTolerance;
    /* 0x00d8 */ FValueOrBBKey_Bool bAllowStrafe;
    /* 0x00e8 */ FValueOrBBKey_Bool bAllowPartialPath;
    /* 0x00f8 */ FValueOrBBKey_Bool bTrackMovingGoal;
    /* 0x0108 */ FValueOrBBKey_Bool bRequireNavigableEndLocation;
    /* 0x0118 */ FValueOrBBKey_Bool bProjectGoalLocation;
    /* 0x0128 */ FValueOrBBKey_Bool bReachTestIncludesAgentRadius;
    /* 0x0138 */ FValueOrBBKey_Bool bReachTestIncludesGoalRadius;
    /* 0x0148 */ FValueOrBBKey_Bool bStartFromPreviousPath;
    /* 0x0158 */ bool bObserveBlackboardValue;
};

// Size: 0xe0
class UBTTask_PlayAnimation : public UBTTaskNode {
    /* 0x0070 */ FValueOrBBKey_Object animationToPlay;
    /* 0x0090 */ FValueOrBBKey_Bool bLooping;
    /* 0x00a0 */ FValueOrBBKey_Bool bNonBlocking;
    /* 0x00b0 */ UBehaviorTreeComponent* MyOwnerComp;
    /* 0x00b8 */ USkeletalMeshComponent* CachedSkelMesh;
};

// Size: 0x90
class UBTTask_PlaySound : public UBTTaskNode {
    /* 0x0070 */ FValueOrBBKey_Object SoundToPlay;
};

// Size: 0xa8
class UBTTask_RotateToFaceBBEntry : public UBTTask_BlackboardBase {
    /* 0x0098 */ FValueOrBBKey_Float Precision;
};

// Size: 0x78
class UBTTask_RunBehavior : public UBTTaskNode {
    /* 0x0070 */ UBehaviorTree* BehaviorAsset;
};

// Size: 0x88
class UBTTask_RunBehaviorDynamic : public UBTTaskNode {
    /* 0x0070 */ FGameplayTag InjectionTag;
    /* 0x0078 */ UBehaviorTree* DefaultBehaviorAsset;
    /* 0x0080 */ UBehaviorTree* BehaviorAsset;
};

// Size: 0x100
class UBTTask_RunEQSQuery : public UBTTask_BlackboardBase {
    /* 0x0098 */ bool bUseBBKey;
    /* 0x00a0 */ FEQSParametrizedQueryExecutionRequest EQSRequest;
    /* 0x00e8 */ bool bUpdateBBOnFail;
};

// Size: 0xa8
class UBTTask_SetKeyValueBool : public UBTTask_BlackboardBase {
    /* 0x0098 */ FValueOrBBKey_Bool Value;
};

// Size: 0xc0
class UBTTask_SetKeyValueClass : public UBTTask_BlackboardBase {
    /* 0x0098 */ UClass* BaseClass;
    /* 0x00a0 */ FValueOrBBKey_Class Value;
};

// Size: 0xc8
class UBTTask_SetKeyValueEnum : public UBTTask_BlackboardBase {
    /* 0x0098 */ UEnum* EnumType;
    /* 0x00a0 */ FValueOrBBKey_Enum Value;
};

// Size: 0xa8
class UBTTask_SetKeyValueFloat : public UBTTask_BlackboardBase {
    /* 0x0098 */ FValueOrBBKey_Float Value;
};

// Size: 0xa8
class UBTTask_SetKeyValueInt32 : public UBTTask_BlackboardBase {
    /* 0x0098 */ FValueOrBBKey_Int32 Value;
};

// Size: 0xb0
class UBTTask_SetKeyValueName : public UBTTask_BlackboardBase {
    /* 0x0098 */ FValueOrBBKey_Name Value;
};

// Size: 0xc0
class UBTTask_SetKeyValueObject : public UBTTask_BlackboardBase {
    /* 0x0098 */ UClass* BaseClass;
    /* 0x00a0 */ FValueOrBBKey_Object Value;
};

// Size: 0xc0
class UBTTask_SetKeyValueRotator : public UBTTask_BlackboardBase {
    /* 0x0098 */ FValueOrBBKey_Rotator Value;
};

// Size: 0xb8
class UBTTask_SetKeyValueString : public UBTTask_BlackboardBase {
    /* 0x0098 */ FValueOrBBKey_String Value;
};

// Size: 0xc0
class UBTTask_SetKeyValueStruct : public UBTTask_BlackboardBase {
    /* 0x0098 */ UScriptStruct* StructType;
    /* 0x00a0 */ FValueOrBBKey_Struct Value;
};

// Size: 0xc0
class UBTTask_SetKeyValueVector : public UBTTask_BlackboardBase {
    /* 0x0098 */ FValueOrBBKey_Vector Value;
};

// Size: 0x98
class UBTTask_SetTagCooldown : public UBTTaskNode {
    /* 0x0070 */ FGameplayTag CooldownTag;
    /* 0x0078 */ FValueOrBBKey_Bool bAddToExistingDuration;
    /* 0x0088 */ FValueOrBBKey_Float CooldownDuration;
};

// Size: 0x90
class UBTTask_Wait : public UBTTaskNode {
    /* 0x0070 */ FValueOrBBKey_Float WaitTime;
    /* 0x0080 */ FValueOrBBKey_Float RandomDeviation;
};

// Size: 0xb8
class UBTTask_WaitBlackboardTime : public UBTTask_Wait {
    /* 0x0090 */ FBlackboardKeySelector BlackboardKey;
};

// Size: 0x68
class UBehaviorTree : public UObject {
    /* 0x0030 */ UBTCompositeNode* RootNode;
    /* 0x0038 */ UBlackboardData* BlackboardAsset;
    /* 0x0040 */ TArray<UBTDecorator*> RootDecorators;
    /* 0x0050 */ TArray<FBTDecoratorLogic> RootDecoratorOps;
};

// Size: 0x2a8
class UBehaviorTreeComponent : public UBrainComponent {
    /* 0x0130 */ TArray<UBTNode*> NodeInstances;
    /* 0x0288 */ UBehaviorTree* DefaultBehaviorTreeAsset;

    void AddCooldownTagDuration(FGameplayTag CooldownTag, float CooldownDuration, bool bAddToExistingDuration);
    double GetTagCooldownEndTime(FGameplayTag CooldownTag) const;
    void SetDynamicSubtree(FGameplayTag InjectTag, UBehaviorTree* BehaviorAsset);
};

// Size: 0x50
class UBehaviorTreeManager : public UObject {
    /* 0x0028 */ int32_t MaxDebuggerSteps;
    /* 0x0030 */ TArray<FBehaviorTreeTemplateInfo> LoadedTemplates;
    /* 0x0040 */ TArray<UBehaviorTreeComponent*> ActiveComponents;
};

// Size: 0x18
struct FBehaviorTreeTemplateInfo {
    /* 0x0000 */ UBehaviorTree* Asset;
    /* 0x0008 */ UBTCompositeNode* Template;
};

// Size: 0x28
class UBehaviorTreeTypes : public UObject {
};

// Size: 0x28
class IBlackboardAssetProvider : public UInterface {

    UBlackboardData* GetBlackboardAsset() const;
};

// Size: 0x1c0
class UBlackboardComponent : public UActorComponent {
    /* 0x00b8 */ UBrainComponent* BrainComp;
    /* 0x00c0 */ UBlackboardData* DefaultBlackboardAsset;
    /* 0x00c8 */ UBlackboardData* BlackboardAsset;
    /* 0x00f0 */ TArray<UBlackboardKeyType*> KeyInstances;

    void ClearValue(const FName& KeyName);
    bool GetLocationFromEntry(const FName& KeyName, FVector& ResultLocation) const;
    bool GetRotationFromEntry(const FName& KeyName, FRotator& ResultRotation) const;
    bool GetValueAsBool(const FName& KeyName) const;
    UClass* GetValueAsClass(const FName& KeyName) const;
    uint8_t GetValueAsEnum(const FName& KeyName) const;
    float GetValueAsFloat(const FName& KeyName) const;
    int32_t GetValueAsInt(const FName& KeyName) const;
    FName GetValueAsName(const FName& KeyName) const;
    UObject* GetValueAsObject(const FName& KeyName) const;
    FRotator GetValueAsRotator(const FName& KeyName) const;
    FString GetValueAsString(const FName& KeyName) const;
    FVector GetValueAsVector(const FName& KeyName) const;
    bool IsVectorValueSet(const FName& KeyName) const;
    void SetValueAsBool(const FName& KeyName, bool boolValue);
    void SetValueAsClass(const FName& KeyName, UClass* ClassValue);
    void SetValueAsEnum(const FName& KeyName, uint8_t EnumValue);
    void SetValueAsFloat(const FName& KeyName, float FloatValue);
    void SetValueAsInt(const FName& KeyName, int32_t IntValue);
    void SetValueAsName(const FName& KeyName, FName NameValue);
    void SetValueAsObject(const FName& KeyName, UObject* ObjectValue);
    void SetValueAsRotator(const FName& KeyName, FRotator VectorValue);
    void SetValueAsString(const FName& KeyName, FString StringValue);
    void SetValueAsVector(const FName& KeyName, FVector VectorValue);
};

// Size: 0x50
class UBlackboardData : public UDataAsset {
    /* 0x0030 */ UBlackboardData* Parent;
    /* 0x0038 */ TArray<FBlackboardEntry> Keys;
    /* 0x0048 */ bool bHasSynchronizedKeys;
};

// Size: 0x18
struct FBlackboardEntry {
    /* 0x0000 */ FName EntryName;
    /* 0x0008 */ UBlackboardKeyType* KeyType;
    /* 0x0010 */ bool bInstanceSynced;
};

// Size: 0x28
struct FBlackboardKeySelector {
    /* 0x0000 */ TArray<UBlackboardKeyType*> AllowedTypes;
    /* 0x0010 */ FName SelectedKeyName;
    /* 0x0018 */ UClass* SelectedKeyType;
    /* 0x0020 */ int32_t SelectedKeyID;
    /* 0x0024 */ bool bNoneIsAllowedValue;
};

// Size: 0x30
class UBlackboardKeyType : public UObject {
};

// Size: 0x38
class UBlackboardKeyType_Bool : public UBlackboardKeyType {
    /* 0x0030 */ bool bDefaultValue;
};

// Size: 0x40
class UBlackboardKeyType_Class : public UBlackboardKeyType {
    /* 0x0030 */ UClass* BaseClass;
    /* 0x0038 */ UClass* DefaultValue;
};

// Size: 0x50
class UBlackboardKeyType_Enum : public UBlackboardKeyType {
    /* 0x0030 */ UEnum* EnumType;
    /* 0x0038 */ FString EnumName;
    /* 0x0048 */ uint8_t DefaultValue;
    /* 0x004c */ bool bIsEnumNameValid;
};

// Size: 0x38
class UBlackboardKeyType_Float : public UBlackboardKeyType {
    /* 0x0030 */ float DefaultValue;
};

// Size: 0x38
class UBlackboardKeyType_Int : public UBlackboardKeyType {
    /* 0x0030 */ int32_t DefaultValue;
};

// Size: 0x38
class UBlackboardKeyType_Name : public UBlackboardKeyType {
    /* 0x0030 */ FName DefaultValue;
};

// Size: 0x48
class UBlackboardKeyType_NativeEnum : public UBlackboardKeyType {
    /* 0x0030 */ FString EnumName;
    /* 0x0040 */ UEnum* EnumType;
};

// Size: 0x40
class UBlackboardKeyType_Object : public UBlackboardKeyType {
    /* 0x0030 */ UClass* BaseClass;
    /* 0x0038 */ UObject* DefaultValue;
};

// Size: 0x50
class UBlackboardKeyType_Rotator : public UBlackboardKeyType {
    /* 0x0030 */ FRotator DefaultValue;
    /* 0x0048 */ bool bUseDefaultValue;
};

// Size: 0x50
class UBlackboardKeyType_String : public UBlackboardKeyType {
    /* 0x0030 */ FString StringValue;
    /* 0x0040 */ FString DefaultValue;
};

// Size: 0x50
class UBlackboardKeyType_Struct : public UBlackboardKeyType {
    /* 0x0030 */ FInstancedStruct DefaultValue;
    /* 0x0040 */ FInstancedStruct Value;
};

// Size: 0x50
class UBlackboardKeyType_Vector : public UBlackboardKeyType {
    /* 0x0030 */ FVector DefaultValue;
    /* 0x0048 */ bool bUseDefaultValue;
};

// Size: 0x110
class UBrainComponent : public UActorComponent {
    /* 0x00c0 */ UBlackboardComponent* BlackboardComp;
    /* 0x00c8 */ AAIController* AIOwner;

    bool IsPaused() const;
    bool IsRunning() const;
    void RestartLogic();
    void StartLogic();
    void StopLogic(FString Reason);
};

// Size: 0x4
struct FCompactIndexedHandleBase {
};

// Size: 0x28
class ICrowdAgentInterface : public UInterface {
};

// Size: 0x1c
struct FCrowdAvoidanceConfig {
    /* 0x0000 */ float VelocityBias;
    /* 0x0004 */ float DesiredVelocityWeight;
    /* 0x0008 */ float CurrentVelocityWeight;
    /* 0x000c */ float SideBiasWeight;
    /* 0x0010 */ float ImpactTimeWeight;
    /* 0x0014 */ float ImpactTimeRange;
    /* 0x0018 */ uint8_t CustomPatternIdx;
    /* 0x0019 */ uint8_t AdaptiveDivisions;
    /* 0x001a */ uint8_t AdaptiveRings;
    /* 0x001b */ uint8_t AdaptiveDepth;
};

// Size: 0x20
struct FCrowdAvoidanceSamplingPattern {
    /* 0x0000 */ TArray<float> Angles;
    /* 0x0010 */ TArray<float> Radii;
};

// Size: 0x358
class UCrowdFollowingComponent : public UPathFollowingComponent {
    /* 0x0320 */ FVector CrowdAgentMoveDirection;

    void SuspendCrowdSteering(bool bSuspend);
};

// Size: 0xf0
class UCrowdManager : public UCrowdManagerBase {
    /* 0x0028 */ ANavigationData* MyNavData;
    /* 0x0030 */ TArray<FCrowdAvoidanceConfig> AvoidanceConfig;
    /* 0x0040 */ TArray<FCrowdAvoidanceSamplingPattern> SamplingPatterns;
    /* 0x0050 */ int32_t MaxAgents;
    /* 0x0054 */ float MaxAgentRadius;
    /* 0x0058 */ int32_t MaxAvoidedAgents;
    /* 0x005c */ int32_t MaxAvoidedWalls;
    /* 0x0060 */ float NavmeshCheckInterval;
    /* 0x0064 */ float PathOptimizationInterval;
    /* 0x0068 */ float SeparationDirClamp;
    /* 0x006c */ float PathOffsetRadiusMultiplier;
    /* 0x0070 */ bool bResolveCollisions;
};

// Size: 0x3c8
class ADetourCrowdAIController : public AAIController {
};

enum class EAILockSource {
    Animation = 0,
    Logic = 1,
    Script = 2,
    Gameplay = 3,
    MAX = 4,
};

enum class EAIOptionFlag {
    Default = 0,
    Enable = 1,
    Disable = 2,
    MAX = 3,
};

enum class EAIParamType {
    Float = 0,
    Int = 1,
    Bool = 2,
    MAX = 3,
};

enum class EAIRequestPriority {
    SoftScript = 0,
    Logic = 1,
    HardScript = 2,
    Reaction = 3,
    Ultimate = 4,
    MAX = 5,
};

enum class EAISenseNotifyType {
    OnEveryPerception = 0,
    OnPerceptionChange = 1,
    EAISenseNotifyType_MAX = 2,
};

enum class EAITaskPriority {
    Lowest = 0,
    Low = 64,
    AutonomousAI = 127,
    High = 192,
    Ultimate = 254,
    EAITaskPriority_MAX = 255,
};

enum class EArithmeticKeyOperation {
    Equal = 0,
    NotEqual = 1,
    Less = 2,
    LessOrEqual = 3,
    Greater = 4,
    GreaterOrEqual = 5,
    EArithmeticKeyOperation_MAX = 6,
};

enum class EBTBlackboardRestart {
    ValueChange = 0,
    ResultChange = 1,
    EBTBlackboardRestart_MAX = 2,
};

enum class EBTChildIndex {
    FirstNode = 0,
    TaskNode = 1,
    EBTChildIndex_MAX = 2,
};

enum class EBTDecoratorLogic {
    Invalid = 0,
    Test = 1,
    And = 2,
    Or = 3,
    Not = 4,
    EBTDecoratorLogic_MAX = 5,
};

enum class EBTFlowAbortMode {
    None = 0,
    LowerPriority = 1,
    Self = 2,
    Both = 3,
    EBTFlowAbortMode_MAX = 4,
};

enum class EBTNodeResult {
    Succeeded = 0,
    Failed = 1,
    Aborted = 2,
    InProgress = 3,
    EBTNodeResult_MAX = 4,
};

enum class EBTParallelMode {
    AbortBackground = 0,
    WaitForBackground = 1,
    EBTParallelMode_MAX = 2,
};

enum class EBasicKeyOperation {
    Set = 0,
    NotSet = 1,
    EBasicKeyOperation_MAX = 2,
};

enum class EBlackBoardEntryComparison {
    Equal = 0,
    NotEqual = 1,
    EBlackBoardEntryComparison_MAX = 2,
};

enum class EEQSNormalizationType {
    Absolute = 0,
    RelativeToScores = 1,
    EEQSNormalizationType_MAX = 2,
};

enum class EEnvDirection {
    TwoPoints = 0,
    Rotation = 1,
    EEnvDirection_MAX = 2,
};

enum class EEnvOverlapShape {
    Box = 0,
    Sphere = 1,
    Capsule = 2,
    EEnvOverlapShape_MAX = 3,
};

enum class EEnvQueryHightlightMode {
    All = 0,
    Best5Pct = 1,
    Best25Pct = 2,
    EEnvQueryHightlightMode_MAX = 3,
};

enum class EEnvQueryParam {
    Float = 0,
    Int = 1,
    Bool = 2,
    EEnvQueryParam_MAX = 3,
};

enum class EEnvQueryRunMode {
    SingleResult = 0,
    RandomBest5Pct = 1,
    RandomBest25Pct = 2,
    AllMatching = 3,
    EEnvQueryRunMode_MAX = 4,
};

enum class EEnvQueryStatus {
    Processing = 0,
    Success = 1,
    Failed = 2,
    Aborted = 3,
    OwnerLost = 4,
    MissingParam = 5,
    EEnvQueryStatus_MAX = 6,
};

enum class EEnvQueryTestClamping {
    None = 0,
    SpecifiedValue = 1,
    FilterThreshold = 2,
    EEnvQueryTestClamping_MAX = 3,
};

enum class EEnvQueryTrace {
    None = 0,
    Navigation = 1,
    GeometryByChannel = 2,
    GeometryByProfile = 3,
    NavigationOverLedges = 4,
    EEnvQueryTrace_MAX = 5,
};

enum class EEnvTestCost {
    Low = 0,
    Medium = 1,
    High = 2,
    EEnvTestCost_MAX = 3,
};

enum class EEnvTestDistance {
    Distance3D = 0,
    Distance2D = 1,
    DistanceZ = 2,
    DistanceAbsoluteZ = 3,
    EEnvTestDistance_MAX = 4,
};

enum class EEnvTestDot {
    Dot3D = 0,
    Dot2D = 1,
    EEnvTestDot_MAX = 2,
};

enum class EEnvTestFilterOperator {
    AllPass = 0,
    AnyPass = 1,
    EEnvTestFilterOperator_MAX = 2,
};

enum class EEnvTestFilterType {
    Minimum = 0,
    Maximum = 1,
    Range = 2,
    Match = 3,
    EEnvTestFilterType_MAX = 4,
};

enum class EEnvTestPathfinding {
    PathExist = 0,
    PathCost = 1,
    PathLength = 2,
    EEnvTestPathfinding_MAX = 3,
};

enum class EEnvTestPurpose {
    Filter = 0,
    Score = 1,
    FilterAndScore = 2,
    EEnvTestPurpose_MAX = 3,
};

enum class EEnvTestScoreEquation {
    Linear = 0,
    Square = 1,
    InverseLinear = 2,
    SquareRoot = 3,
    Constant = 4,
    EEnvTestScoreEquation_MAX = 5,
};

enum class EEnvTestScoreOperator {
    AverageScore = 0,
    MinScore = 1,
    MaxScore = 2,
    Multiply = 3,
    EEnvTestScoreOperator_MAX = 4,
};

enum class EEnvTestWeight {
    None = 0,
    Square = 1,
    Inverse = 2,
    Unused = 3,
    Constant = 4,
    Skip = 5,
    EEnvTestWeight_MAX = 6,
};

enum class EEnvTraceShape {
    Line = 0,
    Box = 1,
    Sphere = 2,
    Capsule = 3,
    EEnvTraceShape_MAX = 4,
};

enum class EGenericAICheck {
    Less = 0,
    LessOrEqual = 1,
    Equal = 2,
    NotEqual = 3,
    GreaterOrEqual = 4,
    Greater = 5,
    IsTrue = 6,
    MAX = 7,
};

enum class EPathExistanceQueryType {
    NavmeshRaycast2D = 0,
    HierarchicalQuery = 1,
    RegularPathFinding = 2,
    EPathExistanceQueryType_MAX = 3,
};

enum class EPathFollowingAction {
    Error = 0,
    NoMove = 1,
    DirectMove = 2,
    PartialPath = 3,
    PathToGoal = 4,
    EPathFollowingAction_MAX = 5,
};

enum class EPathFollowingRequestResult {
    Failed = 0,
    AlreadyAtGoal = 1,
    RequestSuccessful = 2,
    EPathFollowingRequestResult_MAX = 3,
};

enum class EPathFollowingResult {
    Success = 0,
    Blocked = 1,
    OffPath = 2,
    Aborted = 3,
    Skipped_DEPRECATED = 4,
    Invalid = 5,
    EPathFollowingResult_MAX = 6,
};

enum class EPathFollowingStatus {
    Idle = 0,
    Waiting = 1,
    Paused = 2,
    Moving = 3,
    EPathFollowingStatus_MAX = 4,
};

enum class EPawnActionMoveMode {
    UsePathfinding = 0,
    StraightLine = 1,
    EPawnActionMoveMode_MAX = 2,
};

enum class EPointOnCircleSpacingMethod {
    BySpaceBetween = 0,
    ByNumberOfPoints = 1,
    EPointOnCircleSpacingMethod_MAX = 2,
};

// Size: 0x48
struct FEQSParametrizedQueryExecutionRequest {
    /* 0x0000 */ UEnvQuery* QueryTemplate;
    /* 0x0008 */ TArray<FAIDynamicParam> QueryConfig;
    /* 0x0018 */ FBlackboardKeySelector EQSQueryBlackboardKey;
    /* 0x0040 */ uint8_t RunMode;
    /* 0x0044 */ bool bUseBBKeyForQueryTemplate;
};

// Size: 0x28
class IEQSQueryResultSourceInterface : public UInterface {
};

// Size: 0x5c0
class UEQSRenderingComponent : public UDebugDrawComponent {
};

// Size: 0x6f0
class AEQSTestingPawn : public ACharacter {
    /* 0x0650 */ UEnvQuery* QueryTemplate;
    /* 0x0658 */ TArray<FEnvNamedValue> QueryParams;
    /* 0x0668 */ TArray<FAIDynamicParam> QueryConfig;
    /* 0x0678 */ float TimeLimitPerStep;
    /* 0x067c */ int32_t StepToDebugDraw;
    /* 0x0680 */ EEnvQueryHightlightMode highlightMode;
    /* 0x0684 */ bool bDrawLabels;
    /* 0x0684 */ bool bDrawFailedItems;
    /* 0x0684 */ bool bReRunQueryOnlyOnFinishedMove;
    /* 0x0684 */ bool bShouldBeVisibleInGame;
    /* 0x0684 */ bool bTickDuringGame;
    /* 0x0684 */ bool bRunQueryOnSelectionChanged;
    /* 0x0688 */ uint8_t QueryingMode;
    /* 0x0690 */ FNavAgentProperties NavAgentProperties;
};

enum class ETeamAttitude {
    Friendly = 0,
    Neutral = 1,
    Hostile = 2,
    ETeamAttitude_MAX = 3,
};

enum class ETextKeyOperation {
    Equal = 0,
    NotEqual = 1,
    Contain = 2,
    NotContain = 3,
    ETextKeyOperation_MAX = 4,
};

// Size: 0x20
struct FEnvDirection {
    /* 0x0000 */ UClass* LineFrom;
    /* 0x0008 */ UClass* LineTo;
    /* 0x0010 */ UClass* Rotation;
    /* 0x0018 */ uint8_t DirMode;
};

// Size: 0x10
struct FEnvNamedValue {
    /* 0x0000 */ FName paramName;
    /* 0x0008 */ EAIParamType ParamType;
    /* 0x000c */ float Value;
};

// Size: 0x30
struct FEnvOverlapData {
    /* 0x0000 */ float ExtentX;
    /* 0x0004 */ float ExtentY;
    /* 0x0008 */ float ExtentZ;
    /* 0x0010 */ FVector ShapeOffset;
    /* 0x0028 */ uint8_t OverlapChannel;
    /* 0x0029 */ uint8_t OverlapShape;
    /* 0x002c */ bool bOnlyBlockingHits;
    /* 0x002c */ bool bOverlapComplex;
    /* 0x002c */ bool bSkipOverlapQuerier;
};

// Size: 0x48
class UEnvQuery : public UDataAsset {
    /* 0x0030 */ FName QueryName;
    /* 0x0038 */ TArray<UEnvQueryOption*> Options;
};

// Size: 0x28
class UEnvQueryContext : public UObject {
};

// Size: 0x30
class UEnvQueryContext_BlueprintBase : public UEnvQueryContext {

    void ProvideActorsSet(UObject* QuerierObject, AActor* QuerierActor, TArray<AActor*>& ResultingActorsSet) const;
    void ProvideLocationsSet(UObject* QuerierObject, AActor* QuerierActor, TArray<FVector>& ResultingLocationSet) const;
    void ProvideSingleActor(UObject* QuerierObject, AActor* QuerierActor, AActor*& ResultingActor) const;
    void ProvideSingleLocation(UObject* QuerierObject, AActor* QuerierActor, FVector& ResultingLocation) const;
};

// Size: 0x28
class UEnvQueryContext_Item : public UEnvQueryContext {
};

// Size: 0x60
class UEnvQueryContext_NavigationData : public UEnvQueryContext {
    /* 0x0028 */ FNavAgentProperties NavAgentProperties;
};

// Size: 0x28
class UEnvQueryContext_Querier : public UEnvQueryContext {
};

// Size: 0x28
class UEnvQueryDebugHelpers : public UObject {
};

// Size: 0x50
class UEnvQueryGenerator : public UEnvQueryNode {
    /* 0x0030 */ FString OptionName;
    /* 0x0040 */ UClass* ItemType;
    /* 0x0048 */ bool bAutoSortTests;
    /* 0x0048 */ bool bCanRunAsync;
};

// Size: 0xd0
class UEnvQueryGenerator_ActorsOfClass : public UEnvQueryGenerator {
    /* 0x0050 */ UClass* SearchedActorClass;
    /* 0x0058 */ FAIDataProviderBoolValue GenerateOnlyActorsInRadius;
    /* 0x0090 */ FAIDataProviderFloatValue SearchRadius;
    /* 0x00c8 */ UClass* SearchCenter;
};

// Size: 0x80
class UEnvQueryGenerator_BlueprintBase : public UEnvQueryGenerator {
    /* 0x0050 */ FText GeneratorsActionDescription;
    /* 0x0060 */ UClass* Context;
    /* 0x0068 */ UClass* GeneratedItemType;

    void AddGeneratedActor(AActor* GeneratedActor) const;
    void AddGeneratedVector(FVector GeneratedVector) const;
    void DoItemGeneration(const TArray<FVector>& ContextLocations) const;
    void DoItemGenerationFromActors(const TArray<AActor*>& ContextActors) const;
    UObject* GetQuerier() const;
};

// Size: 0x70
class UEnvQueryGenerator_Composite : public UEnvQueryGenerator {
    /* 0x0050 */ TArray<UEnvQueryGenerator*> Generators;
    /* 0x0060 */ bool bAllowDifferentItemTypes;
    /* 0x0060 */ bool bHasMatchingItemType;
    /* 0x0068 */ UClass* ForcedItemType;
};

// Size: 0x188
class UEnvQueryGenerator_Cone : public UEnvQueryGenerator_ProjectedPoints {
    /* 0x0098 */ FAIDataProviderFloatValue AlignedPointsDistance;
    /* 0x00d0 */ FAIDataProviderFloatValue ConeDegrees;
    /* 0x0108 */ FAIDataProviderFloatValue AngleStep;
    /* 0x0140 */ FAIDataProviderFloatValue Range;
    /* 0x0178 */ UClass* CenterActor;
    /* 0x0180 */ bool bIncludeContextLocation;
};

// Size: 0xa0
class UEnvQueryGenerator_CurrentLocation : public UEnvQueryGenerator_ProjectedPoints {
    /* 0x0098 */ UClass* QueryContext;
};

// Size: 0x1e8
class UEnvQueryGenerator_Donut : public UEnvQueryGenerator_ProjectedPoints {
    /* 0x0098 */ FAIDataProviderFloatValue InnerRadius;
    /* 0x00d0 */ FAIDataProviderFloatValue OuterRadius;
    /* 0x0108 */ FAIDataProviderIntValue NumberOfRings;
    /* 0x0140 */ FAIDataProviderIntValue PointsPerRing;
    /* 0x0178 */ FEnvDirection ArcDirection;
    /* 0x0198 */ FAIDataProviderFloatValue ArcAngle;
    /* 0x01d0 */ bool bUseSpiralPattern;
    /* 0x01d8 */ UClass* Center;
    /* 0x01e0 */ bool bDefineArc;
};

// Size: 0x268
class UEnvQueryGenerator_OnCircle : public UEnvQueryGenerator_ProjectedPoints {
    /* 0x0098 */ FAIDataProviderFloatValue CircleRadius;
    /* 0x00d0 */ EPointOnCircleSpacingMethod PointOnCircleSpacingMethod;
    /* 0x00d8 */ FAIDataProviderFloatValue SpaceBetween;
    /* 0x0110 */ FAIDataProviderIntValue NumberOfPoints;
    /* 0x0148 */ FEnvDirection ArcDirection;
    /* 0x0168 */ FAIDataProviderFloatValue ArcDirectionOffsetDegrees;
    /* 0x01a0 */ FAIDataProviderFloatValue ArcAngle;
    /* 0x01d8 */ UClass* CircleCenter;
    /* 0x01e0 */ bool bIgnoreAnyContextActorsWhenGeneratingCircle;
    /* 0x01e8 */ FAIDataProviderFloatValue CircleCenterZOffset;
    /* 0x0220 */ FEnvTraceData TraceData;
    /* 0x0260 */ bool bDefineArc;
};

// Size: 0x188
class UEnvQueryGenerator_PathingGrid : public UEnvQueryGenerator_SimpleGrid {
    /* 0x0110 */ FAIDataProviderBoolValue PathToItem;
    /* 0x0148 */ UClass* NavigationFilter;
    /* 0x0150 */ FAIDataProviderFloatValue ScanRangeMultiplier;
};

// Size: 0xa8
class UEnvQueryGenerator_PerceivedActors : public UEnvQueryGenerator {
    /* 0x0050 */ UClass* AllowedActorClass;
    /* 0x0058 */ FAIDataProviderFloatValue SearchRadius;
    /* 0x0090 */ UClass* ListenerContext;
    /* 0x0098 */ UClass* SenseToUse;
    /* 0x00a0 */ bool bIncludeKnownActors;
};

// Size: 0x98
class UEnvQueryGenerator_ProjectedPoints : public UEnvQueryGenerator {
    /* 0x0050 */ FEnvTraceData ProjectionData;
    /* 0x0090 */ UClass* NavDataOverrideContext;
};

// Size: 0x110
class UEnvQueryGenerator_SimpleGrid : public UEnvQueryGenerator_ProjectedPoints {
    /* 0x0098 */ FAIDataProviderFloatValue GridSize;
    /* 0x00d0 */ FAIDataProviderFloatValue SpaceBetween;
    /* 0x0108 */ UClass* GenerateAround;
};

// Size: 0x78
class UEnvQueryInstanceBlueprintWrapper : public UObject {
    /* 0x0030 */ int32_t QueryID;
    /* 0x0058 */ UClass* ItemType;
    /* 0x0060 */ int32_t OptionIndex;
    /* 0x0068 */ FMulticastInlineDelegate OnQueryFinishedEvent;

    void EQSQueryDoneSignature__DelegateSignature(UEnvQueryInstanceBlueprintWrapper* QueryInstance, uint8_t QueryStatus);
    float GetItemScore(int32_t ItemIndex) const;
    bool GetQueryResultsAsActors(TArray<AActor*>& ResultActors) const;
    bool GetQueryResultsAsLocations(TArray<FVector>& ResultLocations) const;
    TArray<AActor*> GetResultsAsActors() const;
    TArray<FVector> GetResultsAsLocations() const;
    void SetNamedParam(FName paramName, float Value);
};

// Size: 0x180
struct FEnvQueryInstanceCache {
    /* 0x0000 */ UEnvQuery* Template;
};

// Size: 0x30
class UEnvQueryItemType : public UObject {
};

// Size: 0x30
class UEnvQueryItemType_Actor : public UEnvQueryItemType_ActorBase {
};

// Size: 0x30
class UEnvQueryItemType_ActorBase : public UEnvQueryItemType_VectorBase {
};

// Size: 0x30
class UEnvQueryItemType_Direction : public UEnvQueryItemType_VectorBase {
};

// Size: 0x30
class UEnvQueryItemType_Point : public UEnvQueryItemType_VectorBase {
};

// Size: 0x30
class UEnvQueryItemType_VectorBase : public UEnvQueryItemType {
};

// Size: 0x158
class UEnvQueryManager : public UAISubsystem {
    /* 0x00a8 */ TArray<FEnvQueryInstanceCache> InstanceCache;
    /* 0x00b8 */ TArray<UEnvQueryContext*> LocalContexts;
    /* 0x00c8 */ TArray<UEnvQueryInstanceBlueprintWrapper*> GCShieldedWrappers;
    /* 0x012c */ float MaxAllowedTestingTime;
    /* 0x0130 */ bool bTestQueriesUsingBreadth;
    /* 0x0134 */ int32_t QueryCountWarningThreshold;
    /* 0x0138 */ double QueryCountWarningInterval;
    /* 0x0140 */ double ExecutionTimeWarningSeconds;
    /* 0x0148 */ double HandlingResultTimeWarningSeconds;
    /* 0x0150 */ double GenerationTimeWarningSeconds;

    static UEnvQueryInstanceBlueprintWrapper* RunEQSQuery(UObject* WorldContextObject, UEnvQuery* QueryTemplate, UObject* Querier, uint8_t RunMode, UClass* WrapperClass);
};

// Size: 0x30
struct FEnvQueryManagerConfig {
    /* 0x0000 */ float MaxAllowedTestingTime;
    /* 0x0004 */ bool bTestQueriesUsingBreadth;
    /* 0x0008 */ int32_t QueryCountWarningThreshold;
    /* 0x0010 */ double QueryCountWarningInterval;
    /* 0x0018 */ double ExecutionTimeWarningSeconds;
    /* 0x0020 */ double HandlingResultTimeWarningSeconds;
    /* 0x0028 */ double GenerationTimeWarningSeconds;
};

// Size: 0x30
class UEnvQueryNode : public UObject {
    /* 0x0028 */ int32_t VerNum;
};

// Size: 0x40
class UEnvQueryOption : public UObject {
    /* 0x0028 */ UEnvQueryGenerator* Generator;
    /* 0x0030 */ TArray<UEnvQueryTest*> Tests;
};

// Size: 0x68
struct FEnvQueryRequest {
    /* 0x0000 */ UEnvQuery* QueryTemplate;
    /* 0x0008 */ UObject* Owner;
    /* 0x0010 */ UWorld* World;
};

// Size: 0x40
struct FEnvQueryResult {
    /* 0x0010 */ UClass* ItemType;
    /* 0x002c */ int32_t OptionIndex;
    /* 0x0030 */ int32_t QueryID;
};

// Size: 0x1f8
class UEnvQueryTest : public UEnvQueryNode {
    /* 0x0030 */ int32_t TestOrder;
    /* 0x0034 */ uint8_t TestPurpose;
    /* 0x0038 */ FString TestComment;
    /* 0x0048 */ uint8_t MultipleContextFilterOp;
    /* 0x0049 */ uint8_t MultipleContextScoreOp;
    /* 0x004a */ uint8_t FilterType;
    /* 0x0050 */ FAIDataProviderBoolValue boolValue;
    /* 0x0088 */ FAIDataProviderFloatValue FloatValueMin;
    /* 0x00c0 */ FAIDataProviderFloatValue FloatValueMax;
    /* 0x00f9 */ uint8_t ScoringEquation;
    /* 0x00fa */ uint8_t ClampMinType;
    /* 0x00fb */ uint8_t ClampMaxType;
    /* 0x00fc */ EEQSNormalizationType NormalizationType;
    /* 0x0100 */ FAIDataProviderFloatValue ScoreClampMin;
    /* 0x0138 */ FAIDataProviderFloatValue ScoreClampMax;
    /* 0x0170 */ FAIDataProviderFloatValue ScoringFactor;
    /* 0x01a8 */ FAIDataProviderFloatValue ReferenceValue;
    /* 0x01e0 */ bool bDefineReferenceValue;
    /* 0x01f0 */ bool bWorkOnFloatValues;
};

// Size: 0x208
class UEnvQueryTest_Distance : public UEnvQueryTest {
    /* 0x01f8 */ uint8_t TestMode;
    /* 0x0200 */ UClass* DistanceTo;
};

// Size: 0x240
class UEnvQueryTest_Dot : public UEnvQueryTest {
    /* 0x01f8 */ FEnvDirection LineA;
    /* 0x0218 */ FEnvDirection LineB;
    /* 0x0238 */ EEnvTestDot TestMode;
    /* 0x0239 */ bool bAbsoluteValue;
};

// Size: 0x268
class UEnvQueryTest_GameplayTags : public UEnvQueryTest {
    /* 0x01f8 */ FGameplayTagQuery TagQueryToMatch;
    /* 0x0240 */ bool bRejectIncompatibleItems;
    /* 0x0241 */ bool bUpdatedToUseQuery;
    /* 0x0242 */ EGameplayContainerMatchType TagsToMatch;
    /* 0x0248 */ FGameplayTagContainer GameplayTags;
};

// Size: 0x228
class UEnvQueryTest_Overlap : public UEnvQueryTest {
    /* 0x01f8 */ FEnvOverlapData OverlapData;
};

// Size: 0x280
class UEnvQueryTest_Pathfinding : public UEnvQueryTest {
    /* 0x01f8 */ uint8_t TestMode;
    /* 0x0200 */ UClass* Context;
    /* 0x0208 */ FAIDataProviderBoolValue PathFromContext;
    /* 0x0240 */ FAIDataProviderBoolValue SkipUnreachable;
    /* 0x0278 */ UClass* FilterClass;
};

// Size: 0x2b8
class UEnvQueryTest_PathfindingBatch : public UEnvQueryTest_Pathfinding {
    /* 0x0280 */ FAIDataProviderFloatValue ScanRangeMultiplier;
};

// Size: 0x238
class UEnvQueryTest_Project : public UEnvQueryTest {
    /* 0x01f8 */ FEnvTraceData ProjectionData;
};

// Size: 0x1f8
class UEnvQueryTest_Random : public UEnvQueryTest {
};

// Size: 0x2e8
class UEnvQueryTest_Trace : public UEnvQueryTest {
    /* 0x01f8 */ FEnvTraceData TraceData;
    /* 0x0238 */ FAIDataProviderBoolValue TraceFromContext;
    /* 0x0270 */ FAIDataProviderFloatValue ItemHeightOffset;
    /* 0x02a8 */ FAIDataProviderFloatValue ContextHeightOffset;
    /* 0x02e0 */ UClass* Context;
};

// Size: 0x210
class UEnvQueryTest_Volume : public UEnvQueryTest {
    /* 0x01f8 */ UClass* VolumeContext;
    /* 0x0200 */ UClass* VolumeClass;
    /* 0x0208 */ bool bDoComplexVolumeTest;
    /* 0x0208 */ bool bSkipTestIfNoVolumes;
};

// Size: 0x28
class UEnvQueryTypes : public UObject {
};

// Size: 0x40
struct FEnvTraceData {
    /* 0x0000 */ int32_t VersionNum;
    /* 0x0008 */ UClass* NavigationFilter;
    /* 0x0010 */ float ProjectDown;
    /* 0x0014 */ float ProjectUp;
    /* 0x0018 */ float ExtentX;
    /* 0x001c */ float ExtentY;
    /* 0x0020 */ float ExtentZ;
    /* 0x0024 */ float PostProjectionVerticalOffset;
    /* 0x0028 */ uint8_t TraceChannel;
    /* 0x0029 */ uint8_t SerializedChannel;
    /* 0x002c */ FName TraceProfileName;
    /* 0x0034 */ uint8_t TraceShape;
    /* 0x0035 */ uint8_t TraceMode;
    /* 0x0038 */ bool bTraceComplex;
    /* 0x0038 */ bool bOnlyBlockingHits;
    /* 0x0038 */ bool bCanTraceOnNavMesh;
    /* 0x0038 */ bool bCanTraceOnGeometry;
    /* 0x0038 */ bool bCanDisableTrace;
    /* 0x0038 */ bool bCanProjectDown;
};

enum class FAIDistanceType {
    Distance3D = 0,
    Distance2D = 1,
    DistanceZ = 2,
    MAX = 3,
};

// Size: 0x50
class UGeneratedNavLinksProxy : public UBaseGeneratedNavLinksProxy {
    /* 0x0040 */ FMulticastInlineDelegate OnSmartLinkReached;

    void ReceiveSmartLinkReached(AActor* Agent, const FVector destination);
};

// Size: 0x28
class IGenericTeamAgentInterface : public UInterface {
};

// Size: 0x1
struct FGenericTeamId {
    /* 0x0000 */ uint8_t TeamID;
};

// Size: 0x3c8
class AGridPathAIController : public AAIController {
};

// Size: 0x338
class UGridPathFollowingComponent : public UPathFollowingComponent {
    /* 0x0308 */ UNavLocalGridManager* GridManager;
};

// Size: 0x8
struct FIndexedHandleBase : public FSimpleIndexedHandleBase {
};

// Size: 0x8
struct FIntervalCountdown {
    /* 0x0000 */ float interval;
};

// Size: 0x48
class UNavFilter_AIControllerDefault : public UNavigationQueryFilter {
};

// Size: 0x2f8
class ANavLinkProxy : public AActor {
    /* 0x02b8 */ TArray<FNavigationLink> PointLinks;
    /* 0x02c8 */ TArray<FNavigationSegmentLink> SegmentLinks;
    /* 0x02d8 */ UNavLinkCustomComponent* SmartLinkComp;
    /* 0x02e0 */ bool bSmartLinkIsRelevant;
    /* 0x02e8 */ FMulticastInlineDelegate OnSmartLinkReached;

    bool HasMovingAgents() const;
    bool IsSmartLinkEnabled() const;
    void ReceiveSmartLinkReached(AActor* Agent, const FVector& destination);
    void ResumePathFollowing(AActor* Agent);
    void SetSmartLinkEnabled(bool bEnabled);
};

// Size: 0x58
class UNavLocalGridManager : public UObject {

    static int32_t AddLocalNavigationGridForBox(UObject* WorldContextObject, const FVector& Location, FVector Extent, FRotator Rotation, const int32_t Radius2D, const float Height, bool bRebuildGrids);
    static int32_t AddLocalNavigationGridForCapsule(UObject* WorldContextObject, const FVector& Location, float CapsuleRadius, float CapsuleHalfHeight, const int32_t Radius2D, const float Height, bool bRebuildGrids);
    static int32_t AddLocalNavigationGridForPoint(UObject* WorldContextObject, const FVector& Location, const int32_t Radius2D, const float Height, bool bRebuildGrids);
    static int32_t AddLocalNavigationGridForPoints(UObject* WorldContextObject, const TArray<FVector>& Locations, const int32_t Radius2D, const float Height, bool bRebuildGrids);
    static bool FindLocalNavigationGridPath(UObject* WorldContextObject, const FVector& Start, const FVector& End, TArray<FVector>& PathPoints);
    static void RemoveLocalNavigationGrid(UObject* WorldContextObject, int32_t GridId, bool bRebuildGrids);
    static bool SetLocalNavigationGridDensity(UObject* WorldContextObject, float CellSize);
};

// Size: 0x308
class UPathFollowingComponent : public UActorComponent {
    /* 0x00f0 */ UNavMovementComponent* MovementComp;
    /* 0x0118 */ ANavigationData* MyNavData;

    uint8_t GetPathActionType() const;
    FVector GetPathDestination() const;
    void OnActorBump(AActor* SelfActor, AActor* OtherActor, FVector NormalImpulse, const FHitResult& Hit);
    void OnNavDataRegistered(ANavigationData* NavData);
};

// Size: 0x28
class UPathFollowingManager : public UObject {
};

// Size: 0x100
class UPawnSensingComponent : public UActorComponent {
    /* 0x00b8 */ float HearingThreshold;
    /* 0x00bc */ float LOSHearingThreshold;
    /* 0x00c0 */ float SightRadius;
    /* 0x00c4 */ float SensingInterval;
    /* 0x00c8 */ float HearingMaxSoundAge;
    /* 0x00cc */ bool bEnableSensingUpdates;
    /* 0x00cc */ bool bOnlySensePlayers;
    /* 0x00cc */ bool bSeePawns;
    /* 0x00cc */ bool bHearNoises;
    /* 0x00d8 */ FMulticastInlineDelegate OnSeePawn;
    /* 0x00e8 */ FMulticastInlineDelegate OnHearNoise;
    /* 0x00f8 */ float PeripheralVisionAngle;
    /* 0x00fc */ float PeripheralVisionCosine;

    float GetPeripheralVisionAngle() const;
    float GetPeripheralVisionCosine() const;
    void HearNoiseDelegate__DelegateSignature(APawn* Instigator, const FVector& Location, float Volume);
    void SeePawnDelegate__DelegateSignature(APawn* Pawn);
    void SetPeripheralVisionAngle(const float NewPeripheralVisionAngle);
    void SetSensingInterval(const float NewSensingInterval);
    void SetSensingUpdatesEnabled(const bool bEnabled);
};

// Size: 0xb8
struct FRecastGraphWrapper {
    /* 0x0000 */ ARecastNavMesh* RecastNavMeshActor;
};

// Size: 0x4
struct FSequentialIDBase {
    /* 0x0000 */ uint32_t Value;
};

// Size: 0x4
struct FSimpleIndexedHandleBase {
};

// Size: 0x28
class UValueOrBBKeyBlueprintUtility : public UBlueprintFunctionLibrary {

    static bool GetBool(const FValueOrBBKey_Bool& Value, const UBehaviorTreeComponent* BehaviorTreeComp);
    static UClass* GetClass(const FValueOrBBKey_Class& Value, const UBehaviorTreeComponent* BehaviorTreeComp);
    static uint8_t GetEnum(const FValueOrBBKey_Enum& Value, const UBehaviorTreeComponent* BehaviorTreeComp);
    static float GetFloat(const FValueOrBBKey_Float& Value, const UBehaviorTreeComponent* BehaviorTreeComp);
    static int32_t GetInt32(const FValueOrBBKey_Int32& Value, const UBehaviorTreeComponent* BehaviorTreeComp);
    static FName GetName(const FValueOrBBKey_Name& Value, const UBehaviorTreeComponent* BehaviorTreeComp);
    static UObject* GetObject(const FValueOrBBKey_Object& Value, const UBehaviorTreeComponent* BehaviorTreeComp);
    static FRotator GetRotator(const FValueOrBBKey_Rotator& Value, const UBehaviorTreeComponent* BehaviorTreeComp);
    static FString GetString(const FValueOrBBKey_String& Value, const UBehaviorTreeComponent* BehaviorTreeComp);
    static FInstancedStruct GetStruct(const FValueOrBBKey_Struct& Value, const UBehaviorTreeComponent* BehaviorTreeComp);
    static FVector GetVector(const FValueOrBBKey_Vector& Value, const UBehaviorTreeComponent* BehaviorTreeComp);
};

// Size: 0x10
struct FValueOrBBKey_Bool : public FValueOrBlackboardKeyBase {
    /* 0x000c */ bool DefaultValue;
};

// Size: 0x20
struct FValueOrBBKey_Class : public FValueOrBlackboardKeyBase {
    /* 0x0010 */ UClass* DefaultValue;
    /* 0x0018 */ UClass* BaseClass;
};

// Size: 0x28
struct FValueOrBBKey_Enum : public FValueOrBlackboardKeyBase {
    /* 0x000c */ uint8_t DefaultValue;
    /* 0x0010 */ UEnum* EnumType;
    /* 0x0018 */ FString NativeEnumTypeName;
};

// Size: 0x10
struct FValueOrBBKey_Float : public FValueOrBlackboardKeyBase {
    /* 0x000c */ float DefaultValue;
};

// Size: 0x10
struct FValueOrBBKey_Int32 : public FValueOrBlackboardKeyBase {
    /* 0x000c */ int32_t DefaultValue;
};

// Size: 0x14
struct FValueOrBBKey_Name : public FValueOrBlackboardKeyBase {
    /* 0x000c */ FName DefaultValue;
};

// Size: 0x20
struct FValueOrBBKey_Object : public FValueOrBlackboardKeyBase {
    /* 0x0010 */ UObject* DefaultValue;
    /* 0x0018 */ UClass* BaseClass;
};

// Size: 0x28
struct FValueOrBBKey_Rotator : public FValueOrBlackboardKeyBase {
    /* 0x0010 */ FRotator DefaultValue;
};

// Size: 0x20
struct FValueOrBBKey_String : public FValueOrBlackboardKeyBase {
    /* 0x0010 */ FString DefaultValue;
};

// Size: 0x20
struct FValueOrBBKey_Struct : public FValueOrBlackboardKeyBase {
    /* 0x0010 */ FInstancedStruct DefaultValue;
};

// Size: 0x28
struct FValueOrBBKey_Vector : public FValueOrBlackboardKeyBase {
    /* 0x0010 */ FVector DefaultValue;
};

// Size: 0xc
struct FValueOrBlackboardKeyBase {
    /* 0x0000 */ FName Key;
};

// Size: 0x28
class UVisualLoggerExtension : public UObject {
};

// Size: 0x8
struct FActorLayer {
    /* 0x0000 */ FName Name;
};

// Size: 0x28
class ULayersBlueprintLibrary : public UBlueprintFunctionLibrary {

    static void AddActorToLayer(AActor* InActor, const FActorLayer& Layer);
    static TArray<AActor*> GetActors(UObject* WorldContextObject, const FActorLayer& ActorLayer);
    static void RemoveActorFromLayer(AActor* InActor, const FActorLayer& Layer);
};

// Size: 0x2e0
struct FColorGradingSpinBoxStyle : public FSlateWidgetStyle {
    /* 0x0010 */ FSlateBrush BorderBrush;
    /* 0x00c0 */ FSlateBrush ActiveBorderBrush;
    /* 0x0170 */ FSlateBrush HoveredBorderBrush;
    /* 0x0220 */ FSlateBrush SelectorBrush;
    /* 0x02d0 */ float SelectorWidth;
};

// Size: 0x730
class URadialSlider : public UWidget {
    /* 0x0168 */ float Value;
    /* 0x016c */ FDelegate ValueDelegate;
    /* 0x017c */ bool bUseCustomDefaultValue;
    /* 0x0180 */ float CustomDefaultValue;
    /* 0x0188 */ FRuntimeFloatCurve SliderRange;
    /* 0x0210 */ TArray<float> ValueTags;
    /* 0x0220 */ float SliderHandleStartAngle;
    /* 0x0224 */ float SliderHandleEndAngle;
    /* 0x0228 */ float AngularOffset;
    /* 0x0230 */ FVector2D HandStartEndRatio;
    /* 0x0240 */ FSliderStyle WidgetStyle;
    /* 0x0680 */ FLinearColor SliderBarColor;
    /* 0x0690 */ FLinearColor SliderProgressColor;
    /* 0x06a0 */ FLinearColor SliderHandleColor;
    /* 0x06b0 */ FLinearColor CenterBackgroundColor;
    /* 0x06c0 */ bool Locked;
    /* 0x06c1 */ bool MouseUsesStep;
    /* 0x06c2 */ bool RequiresControllerLock;
    /* 0x06c4 */ float StepSize;
    /* 0x06c8 */ bool IsFocusable;
    /* 0x06c9 */ bool UseVerticalDrag;
    /* 0x06ca */ bool ShowSliderHandle;
    /* 0x06cb */ bool ShowSliderHand;
    /* 0x06d0 */ FMulticastInlineDelegate OnMouseCaptureBegin;
    /* 0x06e0 */ FMulticastInlineDelegate OnMouseCaptureEnd;
    /* 0x06f0 */ FMulticastInlineDelegate OnControllerCaptureBegin;
    /* 0x0700 */ FMulticastInlineDelegate OnControllerCaptureEnd;
    /* 0x0710 */ FMulticastInlineDelegate OnValueChanged;

    float GetCustomDefaultValue() const;
    float GetNormalizedSliderHandlePosition() const;
    float GetValue() const;
    void SetAngularOffset(float InValue);
    void SetCenterBackgroundColor(FLinearColor InValue);
    void SetCustomDefaultValue(float InValue);
    void SetHandStartEndRatio(FVector2D InValue);
    void SetLocked(bool InValue);
    void SetShowSliderHand(bool InShowSliderHand);
    void SetShowSliderHandle(bool InShowSliderHandle);
    void SetSliderBarColor(FLinearColor InValue);
    void SetSliderHandleColor(FLinearColor InValue);
    void SetSliderHandleEndAngle(float InValue);
    void SetSliderHandleStartAngle(float InValue);
    void SetSliderProgressColor(FLinearColor InValue);
    void SetSliderRange(const FRuntimeFloatCurve& InSliderRange);
    void SetStepSize(float InValue);
    void SetUseVerticalDrag(bool InUseVerticalDrag);
    void SetValue(float InValue);
    void SetValueTags(const TArray<float>& InValueTags);
};

// Size: 0x40
struct FAngularRangeLimit {
    /* 0x0000 */ FVector LimitMin;
    /* 0x0018 */ FVector LimitMax;
    /* 0x0030 */ FBoneReference bone;
};

// Size: 0x28
class UAnimExecutionContextLibrary : public UBlueprintFunctionLibrary {

    static FAnimComponentSpacePoseContext ConvertToComponentSpacePoseContext(const FAnimExecutionContext& Context, EAnimExecutionContextConversionResult& Result);
    static FAnimInitializationContext ConvertToInitializationContext(const FAnimExecutionContext& Context, EAnimExecutionContextConversionResult& Result);
    static FAnimPoseContext ConvertToPoseContext(const FAnimExecutionContext& Context, EAnimExecutionContextConversionResult& Result);
    static FAnimUpdateContext ConvertToUpdateContext(const FAnimExecutionContext& Context, EAnimExecutionContextConversionResult& Result);
    static UAnimInstance* GetAnimInstance(const FAnimExecutionContext& Context);
    static FAnimNodeReference GetAnimNodeReference(UAnimInstance* Instance, int32_t Index);
    static float GetCurrentWeight(const FAnimUpdateContext& Context);
    static float GetDeltaTime(const FAnimUpdateContext& Context);
    static bool IsActive(const FAnimExecutionContext& Context);
};

// Size: 0xf0
struct FAnimLegIKData {
};

// Size: 0x34
struct FAnimLegIKDefinition {
    /* 0x0000 */ FBoneReference IKFootBone;
    /* 0x0010 */ FBoneReference FKFootBone;
    /* 0x0020 */ int32_t NumBonesInLimb;
    /* 0x0024 */ float MinRotationAngle;
    /* 0x0028 */ uint8_t FootBoneForwardAxis;
    /* 0x0029 */ uint8_t HingeRotationAxis;
    /* 0x002a */ bool bEnableRotationLimit;
    /* 0x002b */ bool bEnableKneeTwistCorrection;
    /* 0x002c */ FName TwistOffsetCurveName;
};

// Size: 0x28
class UAnimNodeRigidBodyLibrary : public UBlueprintFunctionLibrary {

    static FRigidBodyAnimNodeReference ConvertToRigidBodyAnimNode(const FAnimNodeReference& Node, EAnimNodeReferenceConversionResult& Result);
    static void ConvertToRigidBodyAnimNodePure(const FAnimNodeReference& Node, FRigidBodyAnimNodeReference& RigidBodyAnimNode, bool& Result);
    static FRigidBodyAnimNodeReference SetOverridePhysicsAsset(const FRigidBodyAnimNodeReference& Node, UPhysicsAsset* PhysicsAsset);
};

// Size: 0x1d0
struct FAnimNode_AimOffsetLookAt : public FAnimNode_BlendSpacePlayer {
    /* 0x0130 */ FPoseLink BasePose;
    /* 0x0140 */ int32_t LODThreshold;
    /* 0x0144 */ FName SourceSocketName;
    /* 0x014c */ FName PivotSocketName;
    /* 0x0158 */ FVector LookAtLocation;
    /* 0x0170 */ FVector SocketAxis;
    /* 0x0188 */ float Alpha;
};

// Size: 0x520
struct FAnimNode_AnimDynamics : public FAnimNode_SkeletalControlBase {
    /* 0x00c8 */ float LinearDampingOverride;
    /* 0x00cc */ float AngularDampingOverride;
    /* 0x0190 */ FBoneReference RelativeSpaceBone;
    /* 0x01a0 */ FBoneReference BoundBone;
    /* 0x01b0 */ FBoneReference ChainEnd;
    /* 0x01c0 */ TArray<FAnimPhysBodyDefinition> PhysicsBodyDefinitions;
    /* 0x01d0 */ float GravityScale;
    /* 0x01d8 */ FVector GravityOverride;
    /* 0x01f0 */ float LinearSpringConstant;
    /* 0x01f4 */ float AngularSpringConstant;
    /* 0x01f8 */ float WindScale;
    /* 0x0200 */ FVector ComponentLinearAccScale;
    /* 0x0218 */ FVector ComponentLinearVelScale;
    /* 0x0230 */ FVector ComponentAppliedLinearAccClamp;
    /* 0x0248 */ float AngularBiasOverride;
    /* 0x024c */ int32_t NumSolverIterationsPreUpdate;
    /* 0x0250 */ int32_t NumSolverIterationsPostUpdate;
    /* 0x0258 */ TArray<FAnimPhysSphericalLimit> SphericalLimits;
    /* 0x0268 */ FVector ExternalForce;
    /* 0x0280 */ TArray<FAnimPhysPlanarLimit> PlanarLimits;
    /* 0x0290 */ AnimPhysSimSpaceType SimulationSpace;
    /* 0x0293 */ bool bUseSphericalLimits;
    /* 0x0293 */ bool bUsePlanarLimit;
    /* 0x0293 */ bool bDoUpdate;
    /* 0x0293 */ bool bDoEval;
    /* 0x0293 */ bool bOverrideLinearDamping;
    /* 0x0293 */ bool bOverrideAngularBias;
    /* 0x0293 */ bool bOverrideAngularDamping;
    /* 0x0293 */ bool bEnableWind;
    /* 0x0294 */ bool bUseGravityOverride;
    /* 0x0294 */ bool bGravityOverrideInSimSpace;
    /* 0x0294 */ bool bLinearSpring;
    /* 0x0294 */ bool bAngularSpring;
    /* 0x0294 */ bool bChain;
    /* 0x02a0 */ FRotationRetargetingInfo RetargetingSettings;
};

// Size: 0xc8
struct FAnimNode_ApplyAdditive : public FAnimNode_Base {
    /* 0x0010 */ FPoseLink base;
    /* 0x0020 */ FPoseLink Additive;
    /* 0x0030 */ float Alpha;
    /* 0x0034 */ FInputScaleBias AlphaScaleBias;
    /* 0x003c */ int32_t LODThreshold;
    /* 0x0040 */ FInputAlphaBoolBlend AlphaBoolBlend;
    /* 0x0088 */ FName AlphaCurveName;
    /* 0x0090 */ FInputScaleBiasClamp AlphaScaleBiasClamp;
    /* 0x00c4 */ EAnimAlphaInputType AlphaInputType;
    /* 0x00c5 */ bool bAlphaBoolEnabled;
};

// Size: 0xe8
struct FAnimNode_ApplyLimits : public FAnimNode_SkeletalControlBase {
    /* 0x00c8 */ TArray<FAngularRangeLimit> AngularRangeLimits;
    /* 0x00d8 */ TArray<FVector> AngularOffsets;
};

// Size: 0x68
struct FAnimNode_BlendBoneByChannel : public FAnimNode_Base {
    /* 0x0010 */ FPoseLink A;
    /* 0x0020 */ FPoseLink B;
    /* 0x0030 */ TArray<FBlendBoneByChannelEntry> BoneDefinitions;
    /* 0x0050 */ float Alpha;
    /* 0x0058 */ FInputScaleBias AlphaScaleBias;
    /* 0x0060 */ uint8_t TransformsSpace;
};

// Size: 0x50
struct FAnimNode_BlendListBase : public FAnimNode_Base {
    /* 0x0010 */ TArray<FPoseLink> BlendPose;
};

// Size: 0x50
struct FAnimNode_BlendListByBool : public FAnimNode_BlendListBase {
};

// Size: 0x50
struct FAnimNode_BlendListByEnum : public FAnimNode_BlendListBase {
};

// Size: 0x50
struct FAnimNode_BlendListByInt : public FAnimNode_BlendListBase {
};

// Size: 0x78
struct FAnimNode_BlendSpaceEvaluator : public FAnimNode_BlendSpacePlayer {
    /* 0x0070 */ float NormalizedTime;
    /* 0x0074 */ bool bTeleportToNormalizedTime;
};

// Size: 0x68
struct FAnimNode_BlendSpaceGraph : public FAnimNode_BlendSpaceGraphBase {
};

// Size: 0x68
struct FAnimNode_BlendSpaceGraphBase : public FAnimNode_Base {
    /* 0x0010 */ float X;
    /* 0x0014 */ float Y;
    /* 0x0018 */ FName GroupName;
    /* 0x0020 */ uint8_t GroupRole;
    /* 0x0028 */ UBlendSpace* BlendSpace;
    /* 0x0030 */ TArray<FPoseLink> SamplePoseLinks;
};

// Size: 0x70
struct FAnimNode_BlendSpacePlayer : public FAnimNode_BlendSpacePlayerBase {
    /* 0x0068 */ UBlendSpace* BlendSpace;
};

// Size: 0x68
struct FAnimNode_BlendSpacePlayerBase : public FAnimNode_AssetPlayerBase {
    /* 0x0060 */ UBlendSpace* PreviousBlendSpace;
};

// Size: 0x90
struct FAnimNode_BlendSpacePlayer_Standalone : public FAnimNode_BlendSpacePlayerBase {
    /* 0x0068 */ FName GroupName;
    /* 0x0070 */ uint8_t GroupRole;
    /* 0x0071 */ bool bOverridePositionWhenJoiningSyncGroupAsLeader;
    /* 0x0072 */ EAnimSyncMethod Method;
    /* 0x0073 */ bool bIgnoreForRelevancyTest;
    /* 0x0074 */ float X;
    /* 0x0078 */ float Y;
    /* 0x007c */ float PlayRate;
    /* 0x0080 */ bool bLoop;
    /* 0x0081 */ bool bResetPlayTimeWhenBlendSpaceChanges;
    /* 0x0084 */ float StartPosition;
    /* 0x0088 */ UBlendSpace* BlendSpace;
};

// Size: 0x20
struct FAnimNode_BlendSpaceSampleResult : public FAnimNode_Root {
};

// Size: 0x128
struct FAnimNode_BoneDrivenController : public FAnimNode_SkeletalControlBase {
    /* 0x00c8 */ FBoneReference SourceBone;
    /* 0x00d8 */ UCurveFloat* DrivingCurve;
    /* 0x00e0 */ float Multiplier;
    /* 0x00e8 */ double RangeMin;
    /* 0x00f0 */ double RangeMax;
    /* 0x00f8 */ double RemappedMin;
    /* 0x0100 */ double RemappedMax;
    /* 0x0108 */ FName ParameterName;
    /* 0x0110 */ FBoneReference TargetBone;
    /* 0x0120 */ EDrivenDestinationMode DestinationMode;
    /* 0x0121 */ EDrivenBoneModificationMode ModificationMode;
    /* 0x0122 */ uint8_t SourceComponent;
    /* 0x0123 */ bool bUseRange;
    /* 0x0123 */ bool bAffectTargetTranslationX;
    /* 0x0123 */ bool bAffectTargetTranslationY;
    /* 0x0123 */ bool bAffectTargetTranslationZ;
    /* 0x0123 */ bool bAffectTargetRotationX;
    /* 0x0123 */ bool bAffectTargetRotationY;
    /* 0x0123 */ bool bAffectTargetRotationZ;
    /* 0x0123 */ bool bAffectTargetScaleX;
    /* 0x0124 */ bool bAffectTargetScaleY;
    /* 0x0124 */ bool bAffectTargetScaleZ;
};

// Size: 0x1c0
struct FAnimNode_CCDIK : public FAnimNode_SkeletalControlBase {
    /* 0x00c8 */ FVector EffectorLocation;
    /* 0x00e0 */ uint8_t EffectorLocationSpace;
    /* 0x00f0 */ FBoneSocketTarget EffectorTarget;
    /* 0x0180 */ FBoneReference TipBone;
    /* 0x0190 */ FBoneReference RootBone;
    /* 0x01a0 */ float Precision;
    /* 0x01a4 */ int32_t MaxIterations;
    /* 0x01a8 */ bool bStartFromTail;
    /* 0x01a9 */ bool bEnableRotationLimit;
    /* 0x01b0 */ TArray<float> RotationLimitPerJoints;
};

// Size: 0x38
struct FAnimNode_CallFunction : public FAnimNode_Base {
    /* 0x0010 */ FPoseLink Source;
    /* 0x0034 */ EAnimFunctionCallSite CallSite;
};

// Size: 0x108
struct FAnimNode_Constraint : public FAnimNode_SkeletalControlBase {
    /* 0x00c8 */ FBoneReference BoneToModify;
    /* 0x00d8 */ TArray<FConstraint> ConstraintSetup;
    /* 0x00e8 */ TArray<float> ConstraintWeights;
};

// Size: 0xf0
struct FAnimNode_CopyBone : public FAnimNode_SkeletalControlBase {
    /* 0x00c8 */ FBoneReference SourceBone;
    /* 0x00d8 */ FBoneReference TargetBone;
    /* 0x00e8 */ bool bCopyTranslation;
    /* 0x00e9 */ bool bCopyRotation;
    /* 0x00ea */ bool bCopyScale;
    /* 0x00eb */ uint8_t ControlSpace;
};

// Size: 0xf8
struct FAnimNode_CopyBoneDelta : public FAnimNode_SkeletalControlBase {
    /* 0x00c8 */ FBoneReference SourceBone;
    /* 0x00d8 */ FBoneReference TargetBone;
    /* 0x00e8 */ bool bCopyTranslation;
    /* 0x00e9 */ bool bCopyRotation;
    /* 0x00ea */ bool bCopyScale;
    /* 0x00eb */ CopyBoneDeltaMode CopyMode;
    /* 0x00ec */ float TranslationMultiplier;
    /* 0x00f0 */ float RotationMultiplier;
    /* 0x00f4 */ float ScaleMultiplier;
};

// Size: 0x158
struct FAnimNode_CopyPoseFromMesh : public FAnimNode_Base {
    /* 0x0010 */ TWeakObjectPtr<USkeletalMeshComponent> SourceMeshComponent;
    /* 0x0018 */ bool bUseAttachedParent;
    /* 0x0018 */ bool bCopyCurves;
    /* 0x0019 */ bool bCopyCustomAttributes;
    /* 0x001a */ bool bUseMeshPose;
    /* 0x001c */ FName RootBoneToCopy;
};

// Size: 0x40
struct FAnimNode_CurveSource : public FAnimNode_Base {
    /* 0x0010 */ FPoseLink SourcePose;
    /* 0x0020 */ FName SourceBinding;
    /* 0x0028 */ float Alpha;
    /* 0x0030 */ TScriptInterface<ICurveSourceInterface> CurveSource;
};

// Size: 0x1f0
struct FAnimNode_Fabrik : public FAnimNode_SkeletalControlBase {
    /* 0x00d0 */ FTransform EffectorTransform;
    /* 0x0130 */ FBoneSocketTarget EffectorTarget;
    /* 0x01c0 */ FBoneReference TipBone;
    /* 0x01d0 */ FBoneReference RootBone;
    /* 0x01e0 */ float Precision;
    /* 0x01e4 */ int32_t MaxIterations;
    /* 0x01e8 */ uint8_t EffectorTransformSpace;
    /* 0x01e9 */ uint8_t EffectorRotationSource;
};

// Size: 0x138
struct FAnimNode_HandIKRetargeting : public FAnimNode_SkeletalControlBase {
    /* 0x00c8 */ FBoneReference RightHandFK;
    /* 0x00d8 */ FBoneReference LeftHandFK;
    /* 0x00e8 */ FBoneReference RightHandIK;
    /* 0x00f8 */ FBoneReference LeftHandIK;
    /* 0x0108 */ TArray<FBoneReference> IKBonesToMove;
    /* 0x0118 */ FVector PerAxisAlpha;
    /* 0x0130 */ float HandFKWeight;
};

// Size: 0xe8
struct FAnimNode_LayeredBoneBlend : public FAnimNode_Base {
    /* 0x0010 */ FPoseLink BasePose;
    /* 0x0020 */ TArray<FPoseLink> BlendPoses;
    /* 0x0030 */ ELayeredBoneBlendMode BlendMode;
    /* 0x0038 */ TArray<UBlendProfile*> BlendMasks;
    /* 0x0048 */ TArray<FInputBlendPose> LayerSetup;
    /* 0x0058 */ TArray<float> BlendWeights;
    /* 0x0088 */ TArray<FPerBoneBlendWeight> PerBoneBlendWeights;
    /* 0x00b8 */ FGuid SkeletonGuid;
    /* 0x00c8 */ FGuid VirtualBoneGuid;
    /* 0x00dc */ int32_t LODThreshold;
    /* 0x00e0 */ bool bMeshSpaceRotationBlend;
    /* 0x00e1 */ bool bRootSpaceRotationBlend;
    /* 0x00e2 */ bool bMeshSpaceScaleBlend;
    /* 0x00e3 */ uint8_t CurveBlendOption;
    /* 0x00e4 */ bool bBlendRootMotionBasedOnRootBone;
};

// Size: 0x100
struct FAnimNode_LegIK : public FAnimNode_SkeletalControlBase {
    /* 0x00c8 */ float ReachPrecision;
    /* 0x00cc */ int32_t MaxIterations;
    /* 0x00d0 */ float SoftPercentLength;
    /* 0x00d4 */ float SoftAlpha;
    /* 0x00d8 */ TArray<FAnimLegIKDefinition> LegsDefinition;
};

// Size: 0x250
struct FAnimNode_LookAt : public FAnimNode_SkeletalControlBase {
    /* 0x00c8 */ FBoneReference BoneToModify;
    /* 0x00e0 */ FBoneSocketTarget LookAtTarget;
    /* 0x0170 */ FVector LookAtLocation;
    /* 0x0188 */ FAxis LookAt_Axis;
    /* 0x01a8 */ bool bUseLookUpAxis;
    /* 0x01a9 */ uint8_t InterpolationType;
    /* 0x01b0 */ FAxis LookUp_Axis;
    /* 0x01d0 */ float LookAtClamp;
    /* 0x01d4 */ float InterpolationTime;
    /* 0x01d8 */ float InterpolationTriggerThreashold;
};

// Size: 0x38
struct FAnimNode_MakeDynamicAdditive : public FAnimNode_Base {
    /* 0x0010 */ FPoseLink base;
    /* 0x0020 */ FPoseLink Additive;
    /* 0x0030 */ bool bMeshSpaceAdditive;
};

// Size: 0x10
struct FAnimNode_MeshSpaceRefPose : public FAnimNode_Base {
};

// Size: 0x48
struct FAnimNode_Mirror : public FAnimNode_MirrorBase {
};

// Size: 0x48
struct FAnimNode_MirrorBase : public FAnimNode_Base {
    /* 0x0010 */ FPoseLink Source;
};

// Size: 0x60
struct FAnimNode_Mirror_Standalone : public FAnimNode_MirrorBase {
    /* 0x0048 */ bool bMirror;
    /* 0x0050 */ UMirrorDataTable* MirrorDataTable;
    /* 0x0058 */ float BlendTime;
    /* 0x005c */ bool bResetChild;
    /* 0x005d */ bool bBoneMirroring;
    /* 0x005e */ bool bCurveMirroring;
    /* 0x005f */ bool bAttributeMirroring;
};

// Size: 0x128
struct FAnimNode_ModifyBone : public FAnimNode_SkeletalControlBase {
    /* 0x00c8 */ FBoneReference BoneToModify;
    /* 0x00d8 */ FVector Translation;
    /* 0x00f0 */ FRotator Rotation;
    /* 0x0108 */ FVector Scale;
    /* 0x0120 */ uint8_t TranslationMode;
    /* 0x0121 */ uint8_t RotationMode;
    /* 0x0122 */ uint8_t ScaleMode;
    /* 0x0123 */ uint8_t TranslationSpace;
    /* 0x0124 */ uint8_t RotationSpace;
    /* 0x0125 */ uint8_t ScaleSpace;
};

// Size: 0x120
struct FAnimNode_ModifyCurve : public FAnimNode_Base {
    /* 0x0010 */ FPoseLink SourcePose;
    /* 0x0020 */ TMap<FName, float> CurveMap;
    /* 0x0070 */ TArray<float> CurveValues;
    /* 0x0080 */ TArray<FName> CurveNames;
    /* 0x0118 */ float Alpha;
    /* 0x011c */ EModifyCurveApplyMode ApplyMode;
};

// Size: 0x50
struct FAnimNode_MultiWayBlend : public FAnimNode_Base {
    /* 0x0010 */ TArray<FPoseLink> Poses;
    /* 0x0020 */ TArray<float> DesiredAlphas;
    /* 0x0040 */ FInputScaleBias AlphaScaleBias;
    /* 0x0048 */ bool bAdditiveNode;
    /* 0x0049 */ bool bNormalizeAlpha;
};

// Size: 0x128
struct FAnimNode_ObserveBone : public FAnimNode_SkeletalControlBase {
    /* 0x00c8 */ FBoneReference BoneToObserve;
    /* 0x00d8 */ uint8_t DisplaySpace;
    /* 0x00d9 */ bool bRelativeToRefPose;
    /* 0x00e0 */ FVector Translation;
    /* 0x00f8 */ FRotator Rotation;
    /* 0x0110 */ FVector Scale;
};

// Size: 0xd8
struct FAnimNode_PoseBlendNode : public FAnimNode_PoseHandler {
    /* 0x00a0 */ FPoseLink SourcePose;
    /* 0x00b0 */ EAlphaBlendOption BlendOption;
    /* 0x00b8 */ UCurveFloat* CustomCurve;
};

// Size: 0xb8
struct FAnimNode_PoseByName : public FAnimNode_PoseHandler {
    /* 0x00a0 */ FName PoseName;
    /* 0x00a8 */ float PoseWeight;
};

// Size: 0x1a8
struct FAnimNode_PoseDriver : public FAnimNode_PoseHandler {
    /* 0x00a0 */ FPoseLink SourcePose;
    /* 0x00b0 */ TArray<FBoneReference> SourceBones;
    /* 0x00c0 */ FBoneReference EvalSpaceBone;
    /* 0x00d0 */ bool bEvalFromRefPose;
    /* 0x00d8 */ TArray<FBoneReference> OnlyDriveBones;
    /* 0x00e8 */ TArray<FPoseDriverTarget> PoseTargets;
    /* 0x00f8 */ FRBFParams RBFParams;
    /* 0x0130 */ EPoseDriverSource DriveSource;
    /* 0x0131 */ EPoseDriverOutput DriveOutput;
    /* 0x0174 */ int32_t LODThreshold;
};

// Size: 0xa0
struct FAnimNode_PoseHandler : public FAnimNode_AssetPlayerBase {
    /* 0x0038 */ UPoseAsset* PoseAsset;
};

// Size: 0x90
struct FAnimNode_PoseSnapshot : public FAnimNode_Base {
    /* 0x0010 */ FName SnapshotName;
    /* 0x0018 */ FPoseSnapshot Snapshot;
    /* 0x0050 */ ESnapshotSourceMode Mode;
};

// Size: 0x78
struct FAnimNode_RandomPlayer : public FAnimNode_AssetPlayerRelevancyBase {
    /* 0x0010 */ TArray<FRandomPlayerSequenceEntry> Entries;
    /* 0x0070 */ float BlendWeight;
    /* 0x0074 */ bool bShuffleMode;
};

// Size: 0x10
struct FAnimNode_RefPose : public FAnimNode_Base {
};

// Size: 0xd8
struct FAnimNode_ResetRoot : public FAnimNode_SkeletalControlBase {
};

// Size: 0x930
struct FAnimNode_RigidBody : public FAnimNode_SkeletalControlBase {
    /* 0x00c8 */ UPhysicsAsset* OverridePhysicsAsset;
    /* 0x00d0 */ bool bDefaultToSkeletalMeshPhysicsAsset;
    /* 0x0208 */ bool bUseLocalLODThresholdOnly;
    /* 0x0210 */ FVector OverrideWorldGravity;
    /* 0x0228 */ FVector ExternalForce;
    /* 0x0240 */ FVector ComponentLinearAccScale;
    /* 0x0258 */ FVector ComponentLinearVelScale;
    /* 0x0270 */ FVector ComponentAppliedLinearAccClamp;
    /* 0x0288 */ FSimSpaceSettings SimSpaceSettings;
    /* 0x02f0 */ float CachedBoundsScale;
    /* 0x02f4 */ FBoneReference BaseBoneRef;
    /* 0x0304 */ uint8_t OverlapChannel;
    /* 0x0305 */ ESimulationSpace SimulationSpace;
    /* 0x0306 */ bool bForceDisableCollisionBetweenConstraintBodies;
    /* 0x0307 */ bool bUseExternalClothCollision;
    /* 0x0309 */ bool bEnableWorldGeometry;
    /* 0x0309 */ bool bOverrideWorldGravity;
    /* 0x0309 */ bool bTransferBoneVelocities;
    /* 0x0309 */ bool bFreezeIncomingPoseOnStart;
    /* 0x0309 */ bool bClampLinearTranslationLimitToRefPose;
    /* 0x030c */ float WorldSpaceMinimumScale;
    /* 0x0310 */ float EvaluationResetTime;
    /* 0x0315 */ ESimulationTiming SimulationTiming;
};

// Size: 0xb0
struct FAnimNode_RotateRootBone : public FAnimNode_Base {
    /* 0x0010 */ FPoseLink BasePose;
    /* 0x0020 */ float Pitch;
    /* 0x0024 */ float Yaw;
    /* 0x0028 */ FInputScaleBiasClamp PitchScaleBiasClamp;
    /* 0x0058 */ FInputScaleBiasClamp YawScaleBiasClamp;
    /* 0x0088 */ FRotator MeshToComponent;
    /* 0x00a0 */ bool bRotateRootMotionAttribute;
};

// Size: 0xf0
struct FAnimNode_RotationMultiplier : public FAnimNode_SkeletalControlBase {
    /* 0x00c8 */ FBoneReference TargetBone;
    /* 0x00d8 */ FBoneReference SourceBone;
    /* 0x00e8 */ float Multiplier;
    /* 0x00ec */ uint8_t RotationAxisToRefer;
    /* 0x00ed */ bool bIsAdditive;
};

// Size: 0x118
struct FAnimNode_RotationOffsetBlendSpace : public FAnimNode_BlendSpacePlayer {
    /* 0x0070 */ FPoseLink BasePose;
    /* 0x0080 */ int32_t LODThreshold;
    /* 0x0084 */ float Alpha;
    /* 0x0088 */ FInputScaleBias AlphaScaleBias;
    /* 0x0090 */ FInputAlphaBoolBlend AlphaBoolBlend;
    /* 0x00d8 */ FName AlphaCurveName;
    /* 0x00e0 */ FInputScaleBiasClamp AlphaScaleBiasClamp;
    /* 0x0114 */ EAnimAlphaInputType AlphaInputType;
    /* 0x0115 */ bool bAlphaBoolEnabled;
};

// Size: 0x110
struct FAnimNode_RotationOffsetBlendSpaceGraph : public FAnimNode_BlendSpaceGraphBase {
    /* 0x0068 */ FPoseLink BasePose;
    /* 0x0078 */ int32_t LODThreshold;
    /* 0x007c */ float Alpha;
    /* 0x0080 */ FInputScaleBias AlphaScaleBias;
    /* 0x0088 */ FInputAlphaBoolBlend AlphaBoolBlend;
    /* 0x00d0 */ FName AlphaCurveName;
    /* 0x00d8 */ FInputScaleBiasClamp AlphaScaleBiasClamp;
    /* 0x010c */ EAnimAlphaInputType AlphaInputType;
    /* 0x010d */ bool bAlphaBoolEnabled;
};

// Size: 0x88
struct FAnimNode_ScaleChainLength : public FAnimNode_Base {
    /* 0x0010 */ FPoseLink InputPose;
    /* 0x0020 */ float DefaultChainLength;
    /* 0x0024 */ FBoneReference ChainStartBone;
    /* 0x0034 */ FBoneReference ChainEndBone;
    /* 0x0048 */ FVector TargetLocation;
    /* 0x0060 */ float Alpha;
    /* 0x0068 */ FInputScaleBias AlphaScaleBias;
    /* 0x0070 */ EScaleChainInitialLength ChainInitialLength;
};

// Size: 0x40
struct FAnimNode_SequenceEvaluator : public FAnimNode_SequenceEvaluatorBase {
};

// Size: 0x40
struct FAnimNode_SequenceEvaluatorBase : public FAnimNode_AssetPlayerBase {
};

// Size: 0x70
struct FAnimNode_SequenceEvaluator_Standalone : public FAnimNode_SequenceEvaluatorBase {
    /* 0x0040 */ FName GroupName;
    /* 0x0048 */ uint8_t GroupRole;
    /* 0x0049 */ EAnimSyncMethod Method;
    /* 0x004a */ bool bIgnoreForRelevancyTest;
    /* 0x0050 */ UAnimSequenceBase* Sequence;
    /* 0x0058 */ float ExplicitTime;
    /* 0x005c */ bool bUseExplicitFrame;
    /* 0x0060 */ int32_t ExplicitFrame;
    /* 0x0064 */ bool bShouldLoop;
    /* 0x0065 */ bool bTeleportToExplicitTime;
    /* 0x0066 */ uint8_t ReinitializationBehavior;
    /* 0x0068 */ float StartPosition;
};

// Size: 0xc8
struct FAnimNode_SkeletalControlBase : public FAnimNode_Base {
    /* 0x0010 */ FComponentSpacePoseLink ComponentPose;
    /* 0x0020 */ int32_t LODThreshold;
    /* 0x0024 */ float ActualAlpha;
    /* 0x0028 */ EAnimAlphaInputType AlphaInputType;
    /* 0x0029 */ bool bAlphaBoolEnabled;
    /* 0x002c */ float Alpha;
    /* 0x0030 */ FInputScaleBias AlphaScaleBias;
    /* 0x0038 */ FInputAlphaBoolBlend AlphaBoolBlend;
    /* 0x0080 */ FName AlphaCurveName;
    /* 0x0088 */ FInputScaleBiasClamp AlphaScaleBiasClamp;
};

// Size: 0x48
struct FAnimNode_Slot : public FAnimNode_Base {
    /* 0x0010 */ FPoseLink Source;
    /* 0x0020 */ FName SlotName;
    /* 0x0028 */ bool bAlwaysUpdateSourcePose;
};

// Size: 0x260
struct FAnimNode_SplineIK : public FAnimNode_SkeletalControlBase {
    /* 0x00c8 */ FBoneReference StartBone;
    /* 0x00d8 */ FBoneReference EndBone;
    /* 0x00e8 */ ESplineBoneAxis BoneAxis;
    /* 0x00e9 */ bool bAutoCalculateSpline;
    /* 0x00ec */ int32_t PointCount;
    /* 0x00f0 */ TArray<FTransform> ControlPoints;
    /* 0x0100 */ float Roll;
    /* 0x0104 */ float TwistStart;
    /* 0x0108 */ float TwistEnd;
    /* 0x0110 */ FAlphaBlend TwistBlend;
    /* 0x0140 */ float Stretch;
    /* 0x0144 */ float Offset;
};

// Size: 0x168
struct FAnimNode_SpringBone : public FAnimNode_SkeletalControlBase {
    /* 0x00c8 */ FBoneReference SpringBone;
    /* 0x00d8 */ double MaxDisplacement;
    /* 0x00e0 */ double SpringStiffness;
    /* 0x00e8 */ double SpringDamping;
    /* 0x00f0 */ double ErrorResetThresh;
    /* 0x0164 */ bool bLimitDisplacement;
    /* 0x0164 */ bool bTranslateX;
    /* 0x0164 */ bool bTranslateY;
    /* 0x0164 */ bool bTranslateZ;
    /* 0x0164 */ bool bRotateX;
    /* 0x0164 */ bool bRotateY;
    /* 0x0164 */ bool bRotateZ;
};

// Size: 0x30
struct FAnimNode_Sync : public FAnimNode_Base {
    /* 0x0010 */ FPoseLink Source;
    /* 0x0020 */ FName GroupName;
    /* 0x0028 */ uint8_t GroupRole;
};

// Size: 0x2a0
struct FAnimNode_Trail : public FAnimNode_SkeletalControlBase {
    /* 0x0130 */ FBoneReference TrailBone;
    /* 0x0140 */ int32_t ChainLength;
    /* 0x0144 */ uint8_t ChainBoneAxis;
    /* 0x0145 */ bool bInvertChainBoneAxis;
    /* 0x0145 */ bool bLimitStretch;
    /* 0x0145 */ bool bLimitRotation;
    /* 0x0145 */ bool bUsePlanarLimit;
    /* 0x0145 */ bool bActorSpaceFakeVel;
    /* 0x0145 */ bool bReorientParentToChild;
    /* 0x0148 */ float MaxDeltaTime;
    /* 0x014c */ float RelaxationSpeedScale;
    /* 0x0150 */ FRuntimeFloatCurve TrailRelaxationSpeed;
    /* 0x01d8 */ FInputScaleBiasClamp RelaxationSpeedScaleInputProcessor;
    /* 0x0208 */ TArray<FRotationLimit> RotationLimits;
    /* 0x0218 */ TArray<FVector> RotationOffsets;
    /* 0x0228 */ TArray<FAnimPhysPlanarLimit> PlanarLimits;
    /* 0x0238 */ float StretchLimit;
    /* 0x0240 */ FVector FakeVelocity;
    /* 0x0258 */ FBoneReference BaseJoint;
    /* 0x0268 */ float LastBoneRotationAnimAlphaBlend;
};

// Size: 0x168
struct FAnimNode_TwistCorrectiveNode : public FAnimNode_SkeletalControlBase {
    /* 0x00c8 */ FReferenceBoneFrame BaseFrame;
    /* 0x00f8 */ FReferenceBoneFrame TwistFrame;
    /* 0x0128 */ FAxis TwistPlaneNormalAxis;
    /* 0x0148 */ float RangeMax;
    /* 0x014c */ float RemappedMin;
    /* 0x0150 */ float RemappedMax;
    /* 0x0154 */ FName CurveName;
};

// Size: 0x280
struct FAnimNode_TwoBoneIK : public FAnimNode_SkeletalControlBase {
    /* 0x00c8 */ FBoneReference IKBone;
    /* 0x00d8 */ double StartStretchRatio;
    /* 0x00e0 */ double MaxStretchScale;
    /* 0x00e8 */ FVector EffectorLocation;
    /* 0x0110 */ FBoneSocketTarget EffectorTarget;
    /* 0x01a0 */ FVector JointTargetLocation;
    /* 0x01c0 */ FBoneSocketTarget JointTarget;
    /* 0x0250 */ FAxis TwistAxis;
    /* 0x0270 */ uint8_t EffectorLocationSpace;
    /* 0x0271 */ uint8_t JointTargetLocationSpace;
    /* 0x0272 */ bool bAllowStretching;
    /* 0x0272 */ bool bTakeRotationFromEffectorSpace;
    /* 0x0272 */ bool bMaintainEffectorRelRot;
    /* 0x0272 */ bool bAllowTwist;
};

// Size: 0xc8
struct FAnimNode_TwoWayBlend : public FAnimNode_Base {
    /* 0x0010 */ FPoseLink A;
    /* 0x0020 */ FPoseLink B;
    /* 0x0030 */ EAnimAlphaInputType AlphaInputType;
    /* 0x0031 */ bool bAlphaBoolEnabled;
    /* 0x0031 */ bool bResetChildOnActivation;
    /* 0x0031 */ bool bAlwaysUpdateChildren;
    /* 0x0034 */ float Alpha;
    /* 0x0038 */ FInputScaleBias AlphaScaleBias;
    /* 0x0040 */ FInputAlphaBoolBlend AlphaBoolBlend;
    /* 0x0088 */ FName AlphaCurveName;
    /* 0x0090 */ FInputScaleBiasClamp AlphaScaleBiasClamp;
};

// Size: 0x40
class UAnimNotify_PlayMontageNotify : public UAnimNotify {
    /* 0x0038 */ FName NotifyName;
};

// Size: 0x38
class UAnimNotify_PlayMontageNotifyWindow : public UAnimNotifyState {
    /* 0x0030 */ FName NotifyName;
};

enum class AnimPhysAngularConstraintType {
    Angular = 0,
    Cone = 1,
    AnimPhysAngularConstraintType_MAX = 2,
};

// Size: 0xd0
struct FAnimPhysBodyDefinition {
    /* 0x0000 */ FBoneReference BoundBone;
    /* 0x0010 */ FVector BoxExtents;
    /* 0x0028 */ FVector LocalJointOffset;
    /* 0x0040 */ FAnimPhysConstraintSetup ConstraintSetup;
    /* 0x00c8 */ AnimPhysCollisionType CollisionType;
    /* 0x00cc */ float SphereCollisionRadius;
};

// Size: 0x88
struct FAnimPhysConstraintSetup {
    /* 0x0000 */ AnimPhysLinearConstraintType LinearXLimitType;
    /* 0x0001 */ AnimPhysLinearConstraintType LinearYLimitType;
    /* 0x0002 */ AnimPhysLinearConstraintType LinearZLimitType;
    /* 0x0008 */ FVector LinearAxesMin;
    /* 0x0020 */ FVector LinearAxesMax;
    /* 0x0038 */ AnimPhysAngularConstraintType AngularConstraintType;
    /* 0x0039 */ AnimPhysTwistAxis TwistAxis;
    /* 0x003a */ AnimPhysTwistAxis AngularTargetAxis;
    /* 0x003c */ float ConeAngle;
    /* 0x0040 */ FVector AngularLimitsMin;
    /* 0x0058 */ FVector AngularLimitsMax;
    /* 0x0070 */ FVector AngularTarget;
};

enum class AnimPhysLinearConstraintType {
    Free = 0,
    Limited = 1,
    AnimPhysLinearConstraintType_MAX = 2,
};

// Size: 0x70
struct FAnimPhysPlanarLimit {
    /* 0x0000 */ FBoneReference DrivingBone;
    /* 0x0010 */ FTransform PlaneTransform;
};

enum class AnimPhysSimSpaceType {
    Component = 0,
    Actor = 1,
    World = 2,
    RootRelative = 3,
    BoneRelative = 4,
    AnimPhysSimSpaceType_MAX = 5,
};

// Size: 0x30
struct FAnimPhysSphericalLimit {
    /* 0x0000 */ FBoneReference DrivingBone;
    /* 0x0010 */ FVector SphereLocalOffset;
    /* 0x0028 */ float LimitRadius;
    /* 0x002c */ ESphericalLimitType LimitType;
};

// Size: 0x3e0
class UAnimSequencerInstance : public UAnimInstance {
};

// Size: 0xc00
struct FAnimSequencerInstanceProxy : public FAnimInstanceProxy {
};

// Size: 0x28
class UAnimationStateMachineLibrary : public UBlueprintFunctionLibrary {

    static void ConvertToAnimationStateMachine(const FAnimNodeReference& Node, FAnimationStateMachineReference& AnimationState, EAnimNodeReferenceConversionResult& Result);
    static void ConvertToAnimationStateMachinePure(const FAnimNodeReference& Node, FAnimationStateMachineReference& AnimationState, bool& Result);
    static void ConvertToAnimationStateResult(const FAnimNodeReference& Node, FAnimationStateResultReference& AnimationState, EAnimNodeReferenceConversionResult& Result);
    static void ConvertToAnimationStateResultPure(const FAnimNodeReference& Node, FAnimationStateResultReference& AnimationState, bool& Result);
    static float GetRelevantAnimTimeRemaining(const FAnimUpdateContext& UpdateContext, const FAnimationStateResultReference& Node);
    static float GetRelevantAnimTimeRemainingFraction(const FAnimUpdateContext& UpdateContext, const FAnimationStateResultReference& Node);
    static FName GetState(const FAnimUpdateContext& UpdateContext, const FAnimationStateMachineReference& Node);
    static bool IsStateBlendingIn(const FAnimUpdateContext& UpdateContext, const FAnimationStateResultReference& Node);
    static bool IsStateBlendingOut(const FAnimUpdateContext& UpdateContext, const FAnimationStateResultReference& Node);
    static void SetState(const FAnimUpdateContext& UpdateContext, const FAnimationStateMachineReference& Node, FName TargetState, float Duration, uint8_t BlendType, UBlendProfile* BlendProfile, EAlphaBlendOption AlphaBlendOption, UCurveFloat* CustomBlendCurve);
};

// Size: 0x10
struct FAnimationStateMachineReference : public FAnimNodeReference {
};

// Size: 0x10
struct FAnimationStateResultReference : public FAnimNodeReference {
};

// Size: 0x24
struct FBlendBoneByChannelEntry {
    /* 0x0000 */ FBoneReference SourceBone;
    /* 0x0010 */ FBoneReference TargetBone;
    /* 0x0020 */ bool bBlendTranslation;
    /* 0x0021 */ bool bBlendRotation;
    /* 0x0022 */ bool bBlendScale;
};

// Size: 0x28
class UBlendListBaseLibrary : public UBlueprintFunctionLibrary {

    static FBlendListBaseReference ConvertToBlendListBase(const FAnimNodeReference& Node, EAnimNodeReferenceConversionResult& Result);
    static void ResetNode(const FBlendListBaseReference& BlendListBase);
};

// Size: 0x10
struct FBlendListBaseReference : public FAnimNodeReference {
};

// Size: 0x28
class UBlendSpaceLibrary : public UBlueprintFunctionLibrary {

    static FBlendSpaceReference ConvertToBlendSpace(const FAnimNodeReference& Node, EAnimNodeReferenceConversionResult& Result);
    static void ConvertToBlendSpacePure(const FAnimNodeReference& Node, FBlendSpaceReference& BlendSpace, bool& Result);
    static FVector GetFilteredPosition(const FBlendSpaceReference& BlendSpace);
    static FVector GetPosition(const FBlendSpaceReference& BlendSpace);
    static void SnapToPosition(const FBlendSpaceReference& BlendSpace, FVector NewPosition);
};

// Size: 0x28
class UBlendSpacePlayerLibrary : public UBlueprintFunctionLibrary {

    static FBlendSpacePlayerReference ConvertToBlendSpacePlayer(const FAnimNodeReference& Node, EAnimNodeReferenceConversionResult& Result);
    static void ConvertToBlendSpacePlayerPure(const FAnimNodeReference& Node, FBlendSpacePlayerReference& BlendSpacePlayer, bool& Result);
    static UBlendSpace* GetBlendSpace(const FBlendSpacePlayerReference& BlendSpacePlayer);
    static bool GetLoop(const FBlendSpacePlayerReference& BlendSpacePlayer);
    static float GetPlayRate(const FBlendSpacePlayerReference& BlendSpacePlayer);
    static FVector GetPosition(const FBlendSpacePlayerReference& BlendSpacePlayer);
    static float GetStartPosition(const FBlendSpacePlayerReference& BlendSpacePlayer);
    static FBlendSpacePlayerReference SetBlendSpace(const FBlendSpacePlayerReference& BlendSpacePlayer, UBlendSpace* BlendSpace);
    static FBlendSpacePlayerReference SetBlendSpaceWithInertialBlending(const FAnimUpdateContext& UpdateContext, const FBlendSpacePlayerReference& BlendSpacePlayer, UBlendSpace* BlendSpace, float BlendTime);
    static FBlendSpacePlayerReference SetLoop(const FBlendSpacePlayerReference& BlendSpacePlayer, bool bLoop);
    static FBlendSpacePlayerReference SetPlayRate(const FBlendSpacePlayerReference& BlendSpacePlayer, float PlayRate);
    static FBlendSpacePlayerReference SetResetPlayTimeWhenBlendSpaceChanges(const FBlendSpacePlayerReference& BlendSpacePlayer, bool bReset);
    static bool ShouldResetPlayTimeWhenBlendSpaceChanges(const FBlendSpacePlayerReference& BlendSpacePlayer);
    static void SnapToPosition(const FBlendSpacePlayerReference& BlendSpacePlayer, FVector NewPosition);
};

// Size: 0x10
struct FBlendSpacePlayerReference : public FAnimNodeReference {
};

// Size: 0x10
struct FBlendSpaceReference : public FAnimNodeReference {
};

// Size: 0x1c
struct FConstraint {
    /* 0x0000 */ FBoneReference TargetBone;
    /* 0x0010 */ EConstraintOffsetOption OffsetOption;
    /* 0x0011 */ ETransformConstraintType TransformType;
    /* 0x0012 */ FFilterOptionPerAxis PerAxis;
};

enum class CopyBoneDeltaMode {
    Accumulate = 0,
    Copy = 1,
    CopyBoneDeltaMode_MAX = 2,
};

enum class EAnimFunctionCallSite {
    OnInitialize = 0,
    OnUpdate = 1,
    OnBecomeRelevant = 2,
    OnEvaluate = 3,
    OnInitializePostRecursion = 4,
    OnUpdatePostRecursion = 5,
    OnBecomeRelevantPostRecursion = 6,
    OnEvaluatePostRecursion = 7,
    OnStartedBlendingOut = 8,
    OnStartedBlendingIn = 9,
    OnFinishedBlendingOut = 10,
    OnFinishedBlendingIn = 11,
    EAnimFunctionCallSite_MAX = 12,
};

enum class EBlendListChildUpdateMode {
    Default = 0,
    ResetChildOnActivate = 1,
    AlwaysTickChildren = 2,
    EBlendListChildUpdateMode_MAX = 3,
};

enum class EBlendListTransitionType {
    StandardBlend = 0,
    Inertialization = 1,
    EBlendListTransitionType_MAX = 2,
};

enum class EBoneModificationMode {
    BMM_Ignore = 0,
    BMM_Replace = 1,
    BMM_Additive = 2,
    BMM_MAX = 3,
};

enum class EConstraintOffsetOption {
    None = 0,
    Offset_RefPose = 1,
    EConstraintOffsetOption_MAX = 2,
};

enum class EDrivenBoneModificationMode {
    AddToInput = 0,
    ReplaceComponent = 1,
    AddToRefPose = 2,
    EDrivenBoneModificationMode_MAX = 3,
};

enum class EDrivenDestinationMode {
    Bone = 0,
    MorphTarget = 1,
    MaterialParameter = 2,
    EDrivenDestinationMode_MAX = 3,
};

enum class EEasingFuncType {
    Linear = 0,
    Sinusoidal = 1,
    Cubic = 2,
    QuadraticInOut = 3,
    CubicInOut = 4,
    HermiteCubic = 5,
    QuarticInOut = 6,
    QuinticInOut = 7,
    CircularIn = 8,
    CircularOut = 9,
    CircularInOut = 10,
    ExpIn = 11,
    ExpOut = 12,
    ExpInOut = 13,
    CustomCurve = 14,
    EEasingFuncType_MAX = 15,
};

enum class EInterpolationBlend {
    Linear = 0,
    Cubic = 1,
    Sinusoidal = 2,
    EaseInOutExponent2 = 3,
    EaseInOutExponent3 = 4,
    EaseInOutExponent4 = 5,
    EaseInOutExponent5 = 6,
    MAX = 7,
};

enum class ELayeredBoneBlendMode {
    BranchFilter = 0,
    BlendMask = 1,
    ELayeredBoneBlendMode_MAX = 2,
};

enum class EModifyCurveApplyMode {
    Add = 0,
    Scale = 1,
    Blend = 2,
    WeightedMovingAverage = 3,
    RemapCurve = 4,
    EModifyCurveApplyMode_MAX = 5,
};

enum class EPoseDriverOutput {
    DrivePoses = 0,
    DriveCurves = 1,
    EPoseDriverOutput_MAX = 2,
};

enum class EPoseDriverSource {
    Rotation = 0,
    Translation = 1,
    EPoseDriverSource_MAX = 2,
};

enum class EPoseDriverType {
    SwingAndTwist = 0,
    SwingOnly = 1,
    Translation = 2,
    EPoseDriverType_MAX = 3,
};

enum class ERBFDistanceMethod {
    Euclidean = 0,
    Quaternion = 1,
    SwingAngle = 2,
    TwistAngle = 3,
    DefaultMethod = 4,
    ERBFDistanceMethod_MAX = 5,
};

enum class ERBFFunctionType {
    Gaussian = 0,
    Exponential = 1,
    Linear = 2,
    Cubic = 3,
    Quintic = 4,
    DefaultFunction = 5,
    ERBFFunctionType_MAX = 6,
};

enum class ERBFNormalizeMethod {
    OnlyNormalizeAboveOne = 0,
    AlwaysNormalize = 1,
    NormalizeWithinMedian = 2,
    NoNormalization = 3,
    ERBFNormalizeMethod_MAX = 4,
};

enum class ERBFSolverType {
    Additive = 0,
    Interpolative = 1,
    ERBFSolverType_MAX = 2,
};

enum class ERefPoseType {
    EIT_LocalSpace = 0,
    EIT_Additive = 1,
    EIT_MAX = 2,
};

enum class ERotationComponent {
    EulerX = 0,
    EulerY = 1,
    EulerZ = 2,
    QuaternionAngle = 3,
    SwingAngle = 4,
    TwistAngle = 5,
    ERotationComponent_MAX = 6,
};

enum class EScaleChainInitialLength {
    FixedDefaultLengthValue = 0,
    Distance = 1,
    ChainLength = 2,
    EScaleChainInitialLength_MAX = 3,
};

enum class ESequenceEvalReinit {
    NoReset = 0,
    StartPosition = 1,
    ExplicitTime = 2,
    ESequenceEvalReinit_MAX = 3,
};

enum class ESimulationSpace {
    ComponentSpace = 0,
    WorldSpace = 1,
    BaseBoneSpace = 2,
    ESimulationSpace_MAX = 3,
};

enum class ESimulationTiming {
    Default = 0,
    Synchronous = 1,
    Deferred = 2,
    ESimulationTiming_MAX = 3,
};

enum class ESnapshotSourceMode {
    NamedSnapshot = 0,
    SnapshotPin = 1,
    ESnapshotSourceMode_MAX = 2,
};

enum class ESphericalLimitType {
    Inner = 0,
    Outer = 1,
    ESphericalLimitType_MAX = 2,
};

enum class ESplineBoneAxis {
    None = 0,
    X = 1,
    Y = 2,
    Z = 3,
    ESplineBoneAxis_MAX = 4,
};

enum class ESwapRootBone {
    SwapRootBone_Component = 0,
    SwapRootBone_Actor = 1,
    SwapRootBone_None = 2,
    SwapRootBone_MAX = 3,
};

enum class EWarpingEvaluationMode {
    Manual = 0,
    Graph = 1,
    EWarpingEvaluationMode_MAX = 2,
};

enum class EWarpingVectorMode {
    ComponentSpaceVector = 0,
    ActorSpaceVector = 1,
    WorldSpaceVector = 2,
    IKFootRootLocalSpaceVector = 3,
    EWarpingVectorMode_MAX = 4,
};

// Size: 0x50
struct FIKChain {
};

// Size: 0x70
struct FIKChainLink {
};

// Size: 0x80
struct FIKFootPelvisPullDownSolver {
    /* 0x0000 */ FVectorRK4SpringInterpolator PelvisAdjustmentInterp;
    /* 0x0060 */ double PelvisAdjustmentInterpAlpha;
    /* 0x0068 */ double PelvisAdjustmentMaxDistance;
    /* 0x0070 */ double PelvisAdjustmentErrorTolerance;
    /* 0x0078 */ int32_t PelvisAdjustmentMaxIter;
};

// Size: 0x28
class UKismetAnimationLibrary : public UBlueprintFunctionLibrary {

    static float CalculateDirection(const FVector& Velocity, const FRotator& BaseRotation);
    static float K2_CalculateVelocityFromPositionHistory(float DeltaSeconds, FVector position, FPositionHistory& History, int32_t NumberOfSamples, float VelocityMin, float VelocityMax);
    static float K2_CalculateVelocityFromSockets(float DeltaSeconds, USkeletalMeshComponent* Component, const FName SocketOrBoneName, const FName ReferenceSocketOrBone, uint8_t SocketSpace, FVector OffsetInBoneSpace, FPositionHistory& History, int32_t NumberOfSamples, float VelocityMin, float VelocityMax, EEasingFuncType EasingType, const FRuntimeFloatCurve& CustomCurve);
    static FVector K2_DirectionBetweenSockets(const USkeletalMeshComponent* Component, const FName SocketOrBoneNameFrom, const FName SocketOrBoneNameTo);
    static float K2_DistanceBetweenTwoSocketsAndMapRange(const USkeletalMeshComponent* Component, const FName SocketOrBoneNameA, uint8_t SocketSpaceA, const FName SocketOrBoneNameB, uint8_t SocketSpaceB, bool bRemapRange, float InRangeMin, float InRangeMax, float OutRangeMin, float OutRangeMax);
    static float K2_EndProfilingTimer(bool bLog, FString LogPrefix);
    static FTransform K2_LookAt(const FTransform& CurrentTransform, const FVector& TargetPosition, FVector LookAtVector, bool bUseUpVector, FVector UpVector, float ClampConeInDegree);
    static float K2_MakePerlinNoiseAndRemap(float Value, float RangeOutMin, float RangeOutMax);
    static FVector K2_MakePerlinNoiseVectorAndRemap(float X, float Y, float Z, float RangeOutMinX, float RangeOutMaxX, float RangeOutMinY, float RangeOutMaxY, float RangeOutMinZ, float RangeOutMaxZ);
    static void K2_StartProfilingTimer();
    static void K2_TwoBoneIK(const FVector& RootPos, const FVector& JointPos, const FVector& EndPos, const FVector& JointTarget, const FVector& Effector, FVector& OutJointPos, FVector& OutEndPos, bool bAllowStretching, float StartStretchRatio, float MaxStretchScale);
};

// Size: 0x28
class ULayeredBoneBlendLibrary : public UBlueprintFunctionLibrary {

    static void ConvertToLayeredBlendPerBonePure(const FAnimNodeReference& Node, FLayeredBoneBlendReference& LayeredBoneBlend, bool& Result);
    static FLayeredBoneBlendReference ConvertToLayeredBoneBlend(const FAnimNodeReference& Node, EAnimNodeReferenceConversionResult& Result);
    static int32_t GetNumPoses(const FLayeredBoneBlendReference& LayeredBoneBlend);
    static FLayeredBoneBlendReference SetBlendMask(const FAnimUpdateContext& UpdateContext, const FLayeredBoneBlendReference& LayeredBoneBlend, int32_t PoseIndex, FName BlendMaskName);
};

// Size: 0x10
struct FLayeredBoneBlendReference : public FAnimNodeReference {
};

// Size: 0x28
class ULinkedAnimGraphLibrary : public UBlueprintFunctionLibrary {

    static FLinkedAnimGraphReference ConvertToLinkedAnimGraph(const FAnimNodeReference& Node, EAnimNodeReferenceConversionResult& Result);
    static void ConvertToLinkedAnimGraphPure(const FAnimNodeReference& Node, FLinkedAnimGraphReference& LinkedAnimGraph, bool& Result);
    static UAnimInstance* GetLinkedAnimInstance(const FLinkedAnimGraphReference& Node);
    static bool HasLinkedAnimInstance(const FLinkedAnimGraphReference& Node);
};

// Size: 0x10
struct FLinkedAnimGraphReference : public FAnimNodeReference {
};

// Size: 0x28
class UMirrorAnimLibrary : public UBlueprintFunctionLibrary {

    static FMirrorAnimNodeReference ConvertToMirrorNode(const FAnimNodeReference& Node, EAnimNodeReferenceConversionResult& Result);
    static void ConvertToMirrorNodePure(const FAnimNodeReference& Node, FMirrorAnimNodeReference& MirrorNode, bool& Result);
    static bool GetMirror(const FMirrorAnimNodeReference& MirrorNode);
    static UMirrorDataTable* GetMirrorDataTable(const FMirrorAnimNodeReference& MirrorNode);
    static float GetMirrorTransitionBlendTime(const FMirrorAnimNodeReference& MirrorNode);
    static FMirrorAnimNodeReference SetMirror(const FMirrorAnimNodeReference& MirrorNode, bool bInMirror);
    static FMirrorAnimNodeReference SetMirrorTransitionBlendTime(const FMirrorAnimNodeReference& MirrorNode, float InBlendTime);
};

// Size: 0x10
struct FMirrorAnimNodeReference : public FAnimNodeReference {
};

// Size: 0x28
class UModifyCurveAnimLibrary : public UBlueprintFunctionLibrary {

    static FModifyCurveAnimNodeReference ConvertToModifyCurveNode(const FAnimNodeReference& Node, EAnimNodeReferenceConversionResult& Result);
    static void ConvertToModifyCurveNodePure(const FAnimNodeReference& Node, FModifyCurveAnimNodeReference& ModifyCurveNode, bool& Result);
    static float GetAlpha(const FModifyCurveAnimNodeReference& ModifyCurveNode);
    static EModifyCurveApplyMode GetApplyMode(const FModifyCurveAnimNodeReference& ModifyCurveNode);
    static FModifyCurveAnimNodeReference SetAlpha(const FModifyCurveAnimNodeReference& ModifyCurveNode, float InAlpha);
    static FModifyCurveAnimNodeReference SetApplyMode(const FModifyCurveAnimNodeReference& ModifyCurveNode, EModifyCurveApplyMode InMode);
    static FModifyCurveAnimNodeReference SetCurveMap(const FModifyCurveAnimNodeReference& ModifyCurveNode, const TMap<FName, float>& InCurveMap);
};

// Size: 0x10
struct FModifyCurveAnimNodeReference : public FAnimNodeReference {
};

// Size: 0xa8
class UPlayMontageCallbackProxy : public UObject {
    /* 0x0028 */ FMulticastInlineDelegate OnCompleted;
    /* 0x0038 */ FMulticastInlineDelegate OnBlendOut;
    /* 0x0048 */ FMulticastInlineDelegate OnInterrupted;
    /* 0x0058 */ FMulticastInlineDelegate OnNotifyBegin;
    /* 0x0068 */ FMulticastInlineDelegate OnNotifyEnd;

    static UPlayMontageCallbackProxy* CreateProxyObjectForPlayMontage(USkeletalMeshComponent* InSkeletalMeshComponent, UAnimMontage* MontageToPlay, float PlayRate, float StartingPosition, FName StartingSection, bool bShouldStopAllMontages);
    void OnMontageBlendingOut(UAnimMontage* Montage, bool bInterrupted);
    void OnMontageEnded(UAnimMontage* Montage, bool bInterrupted);
    void OnNotifyBeginReceived(FName NotifyName, const FBranchingPointNotifyPayload& BranchingPointNotifyPayload);
    void OnNotifyEndReceived(FName NotifyName, const FBranchingPointNotifyPayload& BranchingPointNotifyPayload);
};

// Size: 0xc8
struct FPoseDriverTarget {
    /* 0x0000 */ TArray<FPoseDriverTransform> BoneTransforms;
    /* 0x0010 */ FRotator TargetRotation;
    /* 0x0028 */ float TargetScale;
    /* 0x002c */ ERBFDistanceMethod DistanceMethod;
    /* 0x002d */ ERBFFunctionType FunctionType;
    /* 0x002e */ bool bApplyCustomCurve;
    /* 0x0030 */ FRichCurve CustomCurve;
    /* 0x00b0 */ FName DrivenName;
    /* 0x00c0 */ bool bIsHidden;
};

// Size: 0x30
struct FPoseDriverTransform {
    /* 0x0000 */ FVector TargetTranslation;
    /* 0x0018 */ FRotator TargetRotation;
};

// Size: 0x30
struct FPositionHistory {
    /* 0x0000 */ TArray<FVector> Positions;
    /* 0x0010 */ float Range;
};

// Size: 0x10
struct FRBFEntry {
    /* 0x0000 */ TArray<float> Values;
};

// Size: 0x38
struct FRBFParams {
    /* 0x0000 */ int32_t TargetDimensions;
    /* 0x0004 */ ERBFSolverType SolverType;
    /* 0x0008 */ float Radius;
    /* 0x000c */ bool bAutomaticRadius;
    /* 0x000d */ ERBFFunctionType Function;
    /* 0x000e */ ERBFDistanceMethod DistanceMethod;
    /* 0x000f */ uint8_t TwistAxis;
    /* 0x0010 */ float WeightThreshold;
    /* 0x0014 */ ERBFNormalizeMethod NormalizeMethod;
    /* 0x0018 */ FVector MedianReference;
    /* 0x0030 */ float MedianMin;
    /* 0x0034 */ float MedianMax;
};

// Size: 0xa0
struct FRBFTarget : public FRBFEntry {
    /* 0x0010 */ float ScaleFactor;
    /* 0x0014 */ bool bApplyCustomCurve;
    /* 0x0018 */ FRichCurve CustomCurve;
    /* 0x0098 */ ERBFDistanceMethod DistanceMethod;
    /* 0x0099 */ ERBFFunctionType FunctionType;
};

// Size: 0x50
struct FRandomPlayerSequenceEntry {
    /* 0x0000 */ UAnimSequenceBase* Sequence;
    /* 0x0008 */ float ChanceToPlay;
    /* 0x000c */ int32_t MinLoopCount;
    /* 0x0010 */ int32_t MaxLoopCount;
    /* 0x0014 */ float MinPlayRate;
    /* 0x0018 */ float MaxPlayRate;
    /* 0x0020 */ FAlphaBlend BlendIn;
};

// Size: 0x30
struct FReferenceBoneFrame {
    /* 0x0000 */ FBoneReference bone;
    /* 0x0010 */ FAxis Axis;
};

// Size: 0x10
struct FRigidBodyAnimNodeReference : public FAnimNodeReference {
};

// Size: 0x30
struct FRotationLimit {
    /* 0x0000 */ FVector LimitMin;
    /* 0x0018 */ FVector LimitMax;
};

// Size: 0x1a0
struct FRotationRetargetingInfo {
    /* 0x0000 */ bool bEnabled;
    /* 0x0010 */ FTransform Source;
    /* 0x0070 */ FTransform Target;
    /* 0x00d0 */ ERotationComponent RotationComponent;
    /* 0x00d8 */ FVector TwistAxis;
    /* 0x00f0 */ bool bUseAbsoluteAngle;
    /* 0x00f4 */ float SourceMinimum;
    /* 0x00f8 */ float SourceMaximum;
    /* 0x00fc */ float TargetMinimum;
    /* 0x0100 */ float TargetMaximum;
    /* 0x0104 */ EEasingFuncType EasingType;
    /* 0x0108 */ FRuntimeFloatCurve CustomCurve;
    /* 0x0190 */ bool bFlipEasing;
    /* 0x0194 */ float EasingWeight;
    /* 0x0198 */ bool bClamp;
};

// Size: 0x28
class USequenceEvaluatorLibrary : public UBlueprintFunctionLibrary {

    static FSequenceEvaluatorReference AdvanceTime(const FAnimUpdateContext& UpdateContext, const FSequenceEvaluatorReference& SequenceEvaluator, float PlayRate);
    static FSequenceEvaluatorReference ConvertToSequenceEvaluator(const FAnimNodeReference& Node, EAnimNodeReferenceConversionResult& Result);
    static void ConvertToSequenceEvaluatorPure(const FAnimNodeReference& Node, FSequenceEvaluatorReference& SequenceEvaluator, bool& Result);
    static float GetAccumulatedTime(const FSequenceEvaluatorReference& SequenceEvaluator);
    static UAnimSequenceBase* GetSequence(const FSequenceEvaluatorReference& SequenceEvaluator);
    static FSequenceEvaluatorReference SetExplicitFrame(const FSequenceEvaluatorReference& SequenceEvaluator, int32_t Frame);
    static FSequenceEvaluatorReference SetExplicitTime(const FSequenceEvaluatorReference& SequenceEvaluator, float Time);
    static FSequenceEvaluatorReference SetSequence(const FSequenceEvaluatorReference& SequenceEvaluator, UAnimSequenceBase* Sequence);
    static FSequenceEvaluatorReference SetSequenceWithInertialBlending(const FAnimUpdateContext& UpdateContext, const FSequenceEvaluatorReference& SequenceEvaluator, UAnimSequenceBase* Sequence, float BlendTime);
};

// Size: 0x10
struct FSequenceEvaluatorReference : public FAnimNodeReference {
};

// Size: 0x28
class USequencePlayerLibrary : public UBlueprintFunctionLibrary {

    static float ComputePlayRateFromDuration(const FSequencePlayerReference& SequencePlayer, float Duration);
    static FSequencePlayerReference ConvertToSequencePlayer(const FAnimNodeReference& Node, EAnimNodeReferenceConversionResult& Result);
    static void ConvertToSequencePlayerPure(const FAnimNodeReference& Node, FSequencePlayerReference& SequencePlayer, bool& Result);
    static float GetAccumulatedTime(const FSequencePlayerReference& SequencePlayer);
    static bool GetLoopAnimation(const FSequencePlayerReference& SequencePlayer);
    static float GetPlayRate(const FSequencePlayerReference& SequencePlayer);
    static FSequencePlayerReference GetSequence(const FSequencePlayerReference& SequencePlayer, UAnimSequenceBase*& SequenceBase);
    static UAnimSequenceBase* GetSequencePure(const FSequencePlayerReference& SequencePlayer);
    static float GetStartPosition(const FSequencePlayerReference& SequencePlayer);
    static FSequencePlayerReference SetAccumulatedTime(const FSequencePlayerReference& SequencePlayer, float Time);
    static FSequencePlayerReference SetPlayRate(const FSequencePlayerReference& SequencePlayer, float PlayRate);
    static FSequencePlayerReference SetSequence(const FSequencePlayerReference& SequencePlayer, UAnimSequenceBase* Sequence);
    static FSequencePlayerReference SetSequenceWithInertialBlending(const FAnimUpdateContext& UpdateContext, const FSequencePlayerReference& SequencePlayer, UAnimSequenceBase* Sequence, float BlendTime);
    static FSequencePlayerReference SetStartPosition(const FSequencePlayerReference& SequencePlayer, float StartPosition);
};

// Size: 0x10
struct FSequencePlayerReference : public FAnimNodeReference {
};

// Size: 0x28
class ISequencerAnimationOverride : public UInterface {

    bool AllowsCinematicOverride() const;
    TArray<FName> GetSequencerAnimSlotNames() const;
};

// Size: 0x28
class ISequencerAnimationSupport : public UInterface {
};

// Size: 0x68
struct FSimSpaceSettings {
    /* 0x0000 */ float WorldAlpha;
    /* 0x0004 */ float VelocityScaleZ;
    /* 0x0008 */ float DampingAlpha;
    /* 0x000c */ float MaxLinearVelocity;
    /* 0x0010 */ float MaxAngularVelocity;
    /* 0x0014 */ float MaxLinearAcceleration;
    /* 0x0018 */ float MaxAngularAcceleration;
    /* 0x0020 */ FVector ExternalLinearDragV;
    /* 0x0038 */ FVector ExternalLinearVelocity;
    /* 0x0050 */ FVector ExternalAngularVelocity;
};

// Size: 0x28
class USkeletalControlLibrary : public UBlueprintFunctionLibrary {

    static FSkeletalControlReference ConvertToSkeletalControl(const FAnimNodeReference& Node, EAnimNodeReferenceConversionResult& Result);
    static void ConvertToSkeletalControlPure(const FAnimNodeReference& Node, FSkeletalControlReference& SkeletalControl, bool& Result);
    static float GetAlpha(const FSkeletalControlReference& SkeletalControl);
    static FSkeletalControlReference SetAlpha(const FSkeletalControlReference& SkeletalControl, float Alpha);
};

// Size: 0x10
struct FSkeletalControlReference : public FAnimNodeReference {
};

// Size: 0x14
struct FSplineIKCachedBoneData {
    /* 0x0000 */ FBoneReference bone;
    /* 0x0010 */ int32_t RefSkeletonIndex;
};

// Size: 0x20
struct FWarpingVectorValue {
    /* 0x0000 */ EWarpingVectorMode Mode;
    /* 0x0008 */ FVector Value;
};

// Size: 0x70
struct FAimConstraintDescription : public FConstraintDescriptionEx {
    /* 0x0010 */ FAxis LookAt_Axis;
    /* 0x0030 */ FAxis LookUp_Axis;
    /* 0x0050 */ bool bUseLookUp;
    /* 0x0058 */ FVector LookUpTarget;
};

// Size: 0x78
class UAnimationDataSourceRegistry : public UObject {
    /* 0x0028 */ TMap<FName, TWeakObjectPtr<UObject>> DataSources;
};

// Size: 0x20
struct FAxis {
    /* 0x0000 */ FVector Axis;
    /* 0x0018 */ bool bInLocalSpace;
};

// Size: 0xe0
struct FCCDIKChainLink {
};

// Size: 0xe0
struct FConstraintData {
    /* 0x0000 */ FConstraintDescriptor Constraint;
    /* 0x0010 */ float Weight;
    /* 0x0014 */ bool bMaintainOffset;
    /* 0x0020 */ FTransform Offset;
    /* 0x0080 */ FTransform CurrentTransform;
};

// Size: 0xd
struct FConstraintDescription {
    /* 0x0000 */ bool bTranslation;
    /* 0x0001 */ bool bRotation;
    /* 0x0002 */ bool bScale;
    /* 0x0003 */ bool bParent;
    /* 0x0004 */ FFilterOptionPerAxis TranslationAxes;
    /* 0x0007 */ FFilterOptionPerAxis RotationAxes;
    /* 0x000a */ FFilterOptionPerAxis ScaleAxes;
};

// Size: 0x10
struct FConstraintDescriptionEx {
    /* 0x0008 */ FFilterOptionPerAxis AxesFilterOption;
};

// Size: 0x10
struct FConstraintDescriptor {
    /* 0x0000 */ EConstraintType Type;
};

// Size: 0xc0
struct FConstraintOffset {
    /* 0x0000 */ FVector Translation;
    /* 0x0020 */ FQuat Rotation;
    /* 0x0040 */ FVector Scale;
    /* 0x0060 */ FTransform Parent;
};

enum class EConstraintType {
    Transform = 0,
    Aim = 1,
    MAX = 2,
};

enum class EEulerRotationOrder {
    XYZ = 0,
    XZY = 1,
    YXZ = 2,
    YZX = 3,
    ZXY = 4,
    ZYX = 5,
    EEulerRotationOrder_MAX = 6,
};

enum class ETransformConstraintType {
    Translation = 0,
    Rotation = 1,
    Scale = 2,
    Parent = 3,
    LookAt = 4,
    ETransformConstraintType_MAX = 5,
};

// Size: 0x48
struct FEulerTransform {
    /* 0x0000 */ FVector Location;
    /* 0x0018 */ FRotator Rotation;
    /* 0x0030 */ FVector Scale;
};

// Size: 0x50
struct FFABRIKChainLink {
};

// Size: 0x3
struct FFilterOptionPerAxis {
    /* 0x0000 */ bool bX;
    /* 0x0001 */ bool bY;
    /* 0x0002 */ bool bZ;
};

// Size: 0x10
struct FNodeChain {
    /* 0x0000 */ TArray<FName> Nodes;
};

// Size: 0x70
struct FNodeHierarchyData {
    /* 0x0000 */ TArray<FNodeObject> Nodes;
    /* 0x0010 */ TArray<FTransform> Transforms;
    /* 0x0020 */ TMap<FName, int32_t> NodeNameToIndexMapping;
};

// Size: 0x78
struct FNodeHierarchyWithUserData {
    /* 0x0008 */ FNodeHierarchyData Hierarchy;
};

// Size: 0x10
struct FNodeObject {
    /* 0x0000 */ FName Name;
    /* 0x0008 */ FName ParentName;
};

// Size: 0x28
struct FTransformConstraint {
    /* 0x0000 */ FConstraintDescription Operator;
    /* 0x0010 */ FName SourceNode;
    /* 0x0018 */ FName TargetNode;
    /* 0x0020 */ float Weight;
    /* 0x0024 */ bool bMaintainOffset;
};

// Size: 0x18
struct FTransformConstraintDescription : public FConstraintDescriptionEx {
    /* 0x0010 */ ETransformConstraintType TransformType;
};

// Size: 0x9
struct FTransformFilter {
    /* 0x0000 */ FFilterOptionPerAxis TranslationFilter;
    /* 0x0003 */ FFilterOptionPerAxis RotationFilter;
    /* 0x0006 */ FFilterOptionPerAxis ScaleFilter;
};

// Size: 0x40
struct FTransformNoScale {
    /* 0x0000 */ FVector Location;
    /* 0x0020 */ FQuat Rotation;
};

// Size: 0x28
class IAssetRegistry : public UInterface {

    bool GetAllAssets(TArray<FAssetData>& OutAssetData, bool bIncludeOnlyOnDiskAssets) const;
    void GetAllCachedPaths(TArray<FString>& OutPathList) const;
    bool GetAncestorClassNames(FTopLevelAssetPath ClassPathName, TArray<FTopLevelAssetPath>& OutAncestorClassNames) const;
    FAssetData GetAssetByObjectPath(const FName ObjectPath, bool bIncludeOnlyOnDiskAssets) const;
    bool GetAssets(const FARFilter& Filter, TArray<FAssetData>& OutAssetData, bool bSkipARFilteredAssets) const;
    bool GetAssetsByClass(FTopLevelAssetPath ClassPathName, TArray<FAssetData>& OutAssetData, bool bSearchSubClasses) const;
    bool GetAssetsByPackageName(FName PackageName, TArray<FAssetData>& OutAssetData, bool bIncludeOnlyOnDiskAssets, bool bSkipARFilteredAssets) const;
    bool GetAssetsByPath(FName PackagePath, TArray<FAssetData>& OutAssetData, bool bRecursive, bool bIncludeOnlyOnDiskAssets) const;
    bool GetAssetsByPaths(TArray<FName> PackagePaths, TArray<FAssetData>& OutAssetData, bool bRecursive, bool bIncludeOnlyOnDiskAssets) const;
    void GetDerivedClassNames(const TArray<FTopLevelAssetPath>& ClassNames, const TSet<FTopLevelAssetPath>& ExcludedClassNames, TSet<FTopLevelAssetPath>& OutDerivedClassNames) const;
    bool GetInMemoryAssets(const FARFilter& Filter, TArray<FAssetData>& OutAssetData, bool bSkipARFilteredAssets) const;
    void GetSubPaths(FString InBasePath, TArray<FString>& OutPathList, bool bInRecurse) const;
    bool HasAssets(const FName PackagePath, const bool bRecursive) const;
    bool IsLoadingAssets() const;
    bool IsSearchAllAssets() const;
    bool IsSearchAsync() const;
    FAssetData K2_GetAssetByObjectPath(const FSoftObjectPath& ObjectPath, bool bIncludeOnlyOnDiskAssets, bool bSkipARFilteredAssets) const;
    bool K2_GetDependencies(FName PackageName, const FAssetRegistryDependencyOptions& DependencyOptions, TArray<FName>& OutDependencies) const;
    bool K2_GetReferencers(FName PackageName, const FAssetRegistryDependencyOptions& ReferenceOptions, TArray<FName>& OutReferencers) const;
    void PrioritizeSearchPath(FString PathToPrioritize);
    void RunAssetsThroughFilter(TArray<FAssetData>& AssetDataList, const FARFilter& Filter) const;
    void ScanFilesSynchronous(const TArray<FString>& InFilePaths, bool bForceRescan);
    void ScanModifiedAssetFiles(const TArray<FString>& InFilePaths);
    void ScanPathsSynchronous(const TArray<FString>& InPaths, bool bForceRescan, bool bIgnoreDenyListScanFilters);
    void SearchAllAssets(bool bSynchronousSearch);
    void UseFilterToExcludeAssets(TArray<FAssetData>& AssetDataList, const FARFilter& Filter) const;
    void WaitForCompletion();
    void WaitForPackage(FString PackageName);
};

// Size: 0x5
struct FAssetRegistryDependencyOptions {
    /* 0x0000 */ bool bIncludeSoftPackageReferences;
    /* 0x0001 */ bool bIncludeHardPackageReferences;
    /* 0x0002 */ bool bIncludeSearchableNames;
    /* 0x0003 */ bool bIncludeSoftManagementReferences;
    /* 0x0004 */ bool bIncludeHardManagementReferences;
};

// Size: 0x28
class UAssetRegistryHelpers : public UObject {

    static FAssetData CreateAssetData(const UObject* InAsset, bool bAllowBlueprintClass);
    static UClass* FindAssetNativeClass(const FAssetData& AssetData);
    static UObject* GetAsset(const FAssetData& InAssetData);
    static TScriptInterface<IAssetRegistry> GetAssetRegistry();
    static void GetBlueprintAssets(const FARFilter& InFilter, TArray<FAssetData>& OutAssetData);
    static UClass* GetClass(const FAssetData& InAssetData);
    static FString GetExportTextName(const FAssetData& InAssetData);
    static FString GetFullName(const FAssetData& InAssetData);
    static bool GetTagValue(const FAssetData& InAssetData, const FName& InTagName, FString& OutTagValue);
    static bool IsAssetLoaded(const FAssetData& InAssetData);
    static bool IsRedirector(const FAssetData& InAssetData);
    static bool IsUAsset(const FAssetData& InAssetData);
    static bool IsValid(const FAssetData& InAssetData);
    static FARFilter SetFilterTagsAndValues(const FARFilter& InFilter, const TArray<FTagAndValue>& InTagsAndValues);
    static void SortByAssetName(TArray<FAssetData>& Assets, EAssetRegistrySortOrder SortOrder);
    static void SortByPredicate(TArray<FAssetData>& Assets, FDelegate SortingPredicate, EAssetRegistrySortOrder SortOrder);
    bool SortingPredicate__DelegateSignature(const FAssetData& Left, const FAssetData& Right);
    static FSoftObjectPath ToSoftObjectPath(const FAssetData& InAssetData);
};

// Size: 0x11a0
class UAssetRegistryImpl : public UObject {
};

enum class EAssetRegistrySortOrder {
    Ascending = 0,
    Descending = 1,
    EAssetRegistrySortOrder_MAX = 2,
};

// Size: 0x18
struct FTagAndValue {
    /* 0x0000 */ FName Tag;
    /* 0x0008 */ FString Value;
};

// Size: 0x4b0
struct FALoadingScreenSettings {
    /* 0x0000 */ float MinimumLoadingScreenDisplayTime;
    /* 0x0004 */ bool bAutoCompleteWhenLoadingCompletes;
    /* 0x0005 */ bool bMoviesAreSkippable;
    /* 0x0006 */ bool bWaitForManualStop;
    /* 0x0007 */ bool bAllowInEarlyStartup;
    /* 0x0008 */ bool bAllowEngineTick;
    /* 0x0009 */ uint8_t PlaybackType;
    /* 0x0010 */ TArray<FString> MoviePaths;
    /* 0x0020 */ bool bShuffle;
    /* 0x0021 */ bool bSetDisplayMovieIndexManually;
    /* 0x0022 */ bool bShowWidgetOverlay;
    /* 0x0023 */ bool bShowLoadingCompleteText;
    /* 0x0028 */ FLoadingCompleteTextSettings LoadingCompleteTextSettings;
    /* 0x00f8 */ FBackgroundSettings Background;
    /* 0x0130 */ FTipSettings TipWidget;
    /* 0x01f0 */ FLoadingWidgetSettings LoadingWidget;
    /* 0x04a0 */ EAsyncLoadingScreenLayout Layout;
};

// Size: 0x28
class UAsyncLoadingScreenLibrary : public UBlueprintFunctionLibrary {

    static bool GetIsEnableLoadingScreen();
    static void PreloadBackgroundImages();
    static void RemovePreloadedBackgroundImages();
    static void SetDisplayBackgroundIndex(int32_t BackgroundIndex);
    static void SetDisplayMovieIndex(int32_t MovieIndex);
    static void SetDisplayTipTextIndex(int32_t TipTextIndex);
    static void SetEnableLoadingScreen(bool bIsEnableLoadingScreen);
    static void StopLoadingScreen();
};

// Size: 0x38
struct FBackgroundSettings {
    /* 0x0000 */ TArray<FSoftObjectPath> Images;
    /* 0x0010 */ uint8_t ImageStretch;
    /* 0x0014 */ FMargin Padding;
    /* 0x0024 */ FLinearColor BackgroundColor;
    /* 0x0034 */ bool bSetDisplayBackgroundManually;
};

// Size: 0xd0
struct FCenterLayoutSettings {
    /* 0x0000 */ bool bIsTipAtBottom;
    /* 0x0001 */ FWidgetAlignment TipAlignment;
    /* 0x0003 */ uint8_t BorderHorizontalAlignment;
    /* 0x0004 */ float BorderVerticalOffset;
    /* 0x0008 */ FMargin BorderPadding;
    /* 0x0020 */ FSlateBrush BorderBackground;
};

// Size: 0xc0
struct FCircularThrobberSettings {
    /* 0x0000 */ int32_t NumberOfPieces;
    /* 0x0004 */ float Period;
    /* 0x0008 */ float Radius;
    /* 0x0010 */ FSlateBrush Image;
};

// Size: 0xd0
struct FClassicLayoutSettings {
    /* 0x0000 */ bool bIsWidgetAtBottom;
    /* 0x0001 */ bool bIsLoadingWidgetAtLeft;
    /* 0x0004 */ float Space;
    /* 0x0008 */ FWidgetAlignment TipAlignment;
    /* 0x000a */ uint8_t BorderHorizontalAlignment;
    /* 0x000c */ FMargin BorderPadding;
    /* 0x0020 */ FSlateBrush BorderBackground;
};

// Size: 0x190
struct FDualSidebarLayoutSettings {
    /* 0x0000 */ bool bIsLoadingWidgetAtRight;
    /* 0x0001 */ uint8_t LeftVerticalAlignment;
    /* 0x0002 */ uint8_t RightVerticalAlignment;
    /* 0x0003 */ uint8_t LeftBorderVerticalAlignment;
    /* 0x0004 */ uint8_t RightBorderVerticalAlignment;
    /* 0x0008 */ FMargin LeftBorderPadding;
    /* 0x0018 */ FMargin RightBorderPadding;
    /* 0x0030 */ FSlateBrush LeftBorderBackground;
    /* 0x00e0 */ FSlateBrush RightBorderBackground;
};

enum class EAsyncLoadingScreenLayout {
    ALSL_Classic = 0,
    ALSL_Center = 1,
    ALSL_Letterbox = 2,
    ALSL_Sidebar = 3,
    ALSL_DualSidebar = 4,
    ALSL_MAX = 5,
};

enum class ELoadingIconType {
    LIT_Throbber = 0,
    LIT_CircularThrobber = 1,
    LIT_ImageSequence = 2,
    LIT_MAX = 3,
};

enum class ELoadingWidgetType {
    LWT_Horizontal = 0,
    LWT_Vertical = 1,
    LWT_MAX = 2,
};

// Size: 0x28
struct FImageSequenceSettings {
    /* 0x0000 */ TArray<UTexture2D*> Images;
    /* 0x0010 */ FVector2D Scale;
    /* 0x0020 */ float interval;
    /* 0x0024 */ bool bPlayReverse;
};

// Size: 0x190
struct FLetterboxLayoutSettings {
    /* 0x0000 */ bool bIsLoadingWidgetAtTop;
    /* 0x0001 */ FWidgetAlignment TipAlignment;
    /* 0x0003 */ FWidgetAlignment LoadingWidgetAlignment;
    /* 0x0005 */ uint8_t TopBorderHorizontalAlignment;
    /* 0x0006 */ uint8_t BottomBorderHorizontalAlignment;
    /* 0x0008 */ FMargin TopBorderPadding;
    /* 0x0018 */ FMargin BottomBorderPadding;
    /* 0x0030 */ FSlateBrush TopBorderBackground;
    /* 0x00e0 */ FSlateBrush BottomBorderBackground;
};

// Size: 0xd0
struct FLoadingCompleteTextSettings {
    /* 0x0000 */ FText LoadingCompleteText;
    /* 0x0010 */ FTextAppearance Appearance;
    /* 0x00b0 */ FWidgetAlignment Alignment;
    /* 0x00b4 */ FMargin Padding;
    /* 0x00c4 */ bool bFadeInOutAnim;
    /* 0x00c8 */ float AnimationSpeed;
};

// Size: 0xf40
class ULoadingScreenSettings : public UDeveloperSettings {
    /* 0x0038 */ bool bPreloadBackgroundImages;
    /* 0x0040 */ FALoadingScreenSettings StartupLoadingScreen;
    /* 0x04f0 */ FALoadingScreenSettings DefaultLoadingScreen;
    /* 0x09a0 */ FClassicLayoutSettings Classic;
    /* 0x0a70 */ FCenterLayoutSettings Center;
    /* 0x0b40 */ FLetterboxLayoutSettings Letterbox;
    /* 0x0cd0 */ FSidebarLayoutSettings Sidebar;
    /* 0x0db0 */ FDualSidebarLayoutSettings DualSidebar;
};

// Size: 0x2b0
struct FLoadingWidgetSettings {
    /* 0x0000 */ ELoadingIconType LoadingIconType;
    /* 0x0001 */ ELoadingWidgetType LoadingWidgetType;
    /* 0x0008 */ FVector2D TransformTranslation;
    /* 0x0018 */ FVector2D TransformScale;
    /* 0x0028 */ FVector2D TransformPivot;
    /* 0x0038 */ FText LoadingText;
    /* 0x0048 */ bool bLoadingTextRightPosition;
    /* 0x0049 */ bool bLoadingTextTopPosition;
    /* 0x0050 */ FTextAppearance Appearance;
    /* 0x00f0 */ FThrobberSettings ThrobberSettings;
    /* 0x01b0 */ FCircularThrobberSettings CircularThrobberSettings;
    /* 0x0270 */ FImageSequenceSettings ImageSequenceSettings;
    /* 0x0298 */ FWidgetAlignment TextAlignment;
    /* 0x029a */ FWidgetAlignment LoadingIconAlignment;
    /* 0x029c */ float Space;
    /* 0x02a0 */ bool bHideLoadingWidgetWhenCompletes;
};

// Size: 0xe0
struct FSidebarLayoutSettings {
    /* 0x0000 */ bool bIsWidgetAtRight;
    /* 0x0001 */ bool bIsLoadingWidgetAtTop;
    /* 0x0004 */ float Space;
    /* 0x0008 */ uint8_t VerticalAlignment;
    /* 0x0009 */ FWidgetAlignment LoadingWidgetAlignment;
    /* 0x000b */ FWidgetAlignment TipAlignment;
    /* 0x000d */ uint8_t BorderVerticalAlignment;
    /* 0x0010 */ float BorderHorizontalOffset;
    /* 0x0014 */ FMargin BorderPadding;
    /* 0x0030 */ FSlateBrush BorderBackground;
};

// Size: 0xa0
struct FTextAppearance {
    /* 0x0000 */ FSlateColor ColorAndOpacity;
    /* 0x0018 */ FSlateFontInfo Font;
    /* 0x0078 */ FVector2D ShadowOffset;
    /* 0x0088 */ FLinearColor ShadowColorAndOpacity;
    /* 0x0098 */ uint8_t Justification;
};

// Size: 0xc0
struct FThrobberSettings {
    /* 0x0000 */ int32_t NumberOfPieces;
    /* 0x0004 */ bool bAnimateHorizontally;
    /* 0x0005 */ bool bAnimateVertically;
    /* 0x0006 */ bool bAnimateOpacity;
    /* 0x0010 */ FSlateBrush Image;
};

// Size: 0xb8
struct FTipSettings {
    /* 0x0000 */ TArray<FText> TipText;
    /* 0x0010 */ FTextAppearance Appearance;
    /* 0x00b0 */ float TipWrapAt;
    /* 0x00b4 */ bool bSetDisplayTipTextManually;
};

// Size: 0x2
struct FWidgetAlignment {
    /* 0x0000 */ uint8_t HorizontalAlignment;
    /* 0x0001 */ uint8_t VerticalAlignment;
};

// Size: 0xa0
class UAudioAnalyzer : public UObject {
    /* 0x0028 */ UAudioBus* AudioBus;
    /* 0x0038 */ UAudioAnalyzerSubsystem* AudioAnalyzerSubsystem;

    void StartAnalyzing(const UObject* WorldContextObject, UAudioBus* AudioBusToAnalyze);
    void StopAnalyzing(const UObject* WorldContextObject);
};

// Size: 0x28
class UAudioAnalyzerAssetBase : public UObject {
};

// Size: 0x78
class UAudioAnalyzerNRT : public UAudioAnalyzerAssetBase {
    /* 0x0028 */ USoundWave* Sound;
    /* 0x0030 */ float DurationInSeconds;
};

// Size: 0x28
class UAudioAnalyzerNRTSettings : public UAudioAnalyzerAssetBase {
};

// Size: 0x28
class UAudioAnalyzerSettings : public UAudioAnalyzerAssetBase {
};

// Size: 0x50
class UAudioAnalyzerSubsystem : public UEngineSubsystem {
    /* 0x0030 */ TArray<UAudioAnalyzer*> AudioAnalyzers;
};

// Size: 0xb0
class UAudioCapture : public UAudioGenerator {

    bool GetAudioCaptureDeviceInfo(FAudioCaptureDeviceInfo& OutInfo);
    bool IsCapturingAudio();
    void StartCapturingAudio();
    void StopCapturingAudio();
};

// Size: 0x28
class UAudioCaptureBlueprintLibrary : public UBlueprintFunctionLibrary {

    static FString Conv_AudioInputDeviceInfoToString(const FAudioInputDeviceInfo& Info);
    static void GetAvailableAudioInputDevices(const UObject* WorldContextObject, const FDelegate& OnObtainDevicesEvent);
};

// Size: 0x960
class UAudioCaptureComponent : public USynthComponent {
    /* 0x08a0 */ int32_t JitterLatencyFrames;
};

// Size: 0x10
struct FAudioCaptureDeviceInfo {
    /* 0x0000 */ FName DeviceName;
    /* 0x0008 */ int32_t NumInputChannels;
    /* 0x000c */ int32_t SampleRate;
};

// Size: 0x28
class UAudioCaptureFunctionLibrary : public UBlueprintFunctionLibrary {

    static UAudioCapture* CreateAudioCapture();
};

// Size: 0x30
struct FAudioInputDeviceInfo {
    /* 0x0000 */ FString DeviceName;
    /* 0x0010 */ FString DeviceID;
    /* 0x0020 */ int32_t InputChannels;
    /* 0x0024 */ int32_t PreferredSampleRate;
    /* 0x0028 */ bool bSupportsHardwareAEC;
};

// Size: 0x28
class UAudioEndpointSettingsBase : public UObject {
};

// Size: 0xa0
struct FAudioParameter {
    /* 0x0000 */ FName paramName;
    /* 0x0008 */ float FloatParam;
    /* 0x000c */ bool BoolParam;
    /* 0x0010 */ int32_t IntParam;
    /* 0x0018 */ UObject* ObjectParam;
    /* 0x0020 */ FString StringParam;
    /* 0x0030 */ TArray<float> ArrayFloatParam;
    /* 0x0040 */ TArray<bool> ArrayBoolParam;
    /* 0x0050 */ TArray<int32_t> ArrayIntParam;
    /* 0x0060 */ TArray<UObject*> ArrayObjectParam;
    /* 0x0070 */ TArray<FString> ArrayStringParam;
    /* 0x0080 */ EAudioParameterType ParamType;
    /* 0x0084 */ FName TypeName;
};

// Size: 0x28
class IAudioParameterControllerInterface : public UInterface {

    void ResetParameters();
    void SetBoolArrayParameter(FName InName, const TArray<bool>& InValue);
    void SetBoolParameter(FName InName, bool InBool);
    void SetFloatArrayParameter(FName InName, const TArray<float>& InValue);
    void SetFloatParameter(FName InName, float InFloat);
    void SetIntArrayParameter(FName InName, const TArray<int32_t>& InValue);
    void SetIntParameter(FName InName, int32_t inInt);
    void SetObjectArrayParameter(FName InName, const TArray<UObject*>& InValue);
    void SetObjectParameter(FName InName, UObject* InValue);
    void SetParameters_Blueprint(const TArray<FAudioParameter>& InParameters);
    void SetStringArrayParameter(FName InName, const TArray<FString>& InValue);
    void SetStringParameter(FName InName, FString InValue);
    void SetTriggerParameter(FName InName);
};

// Size: 0x28
class UAudioPropertiesSheetAssetBase : public UObject {
};

// Size: 0x28
class IAudioPropertiesSheetAssetUserInterface : public UInterface {
};

// Size: 0x28
class UDummyEndpointSettings : public UAudioEndpointSettingsBase {
};

enum class EAudioParameterType {
    None = 0,
    Boolean = 1,
    Integer = 2,
    Float = 3,
    String = 4,
    Object = 5,
    NoneArray = 6,
    BooleanArray = 7,
    IntegerArray = 8,
    FloatArray = 9,
    StringArray = 10,
    ObjectArray = 11,
    Trigger = 12,
    COUNT = 13,
    EAudioParameterType_MAX = 14,
};

enum class ESoundWaveCloudStreamingPlatformEnableType {
    Inherited = 0,
    Disabled = 1,
    SWC_MultipleValues = 2,
    ESoundWaveCloudStreamingPlatformEnableType_MAX = 3,
};

enum class ESoundWaveCloudStreamingPlatformProjectEnableType {
    Enabled = 0,
    Disabled = 1,
    ESoundWaveCloudStreamingPlatformProjectEnableType_MAX = 2,
};

// Size: 0x28
class UOcclusionPluginSourceSettingsBase : public UObject {
};

// Size: 0x28
class UReverbPluginSourceSettingsBase : public UObject {
};

// Size: 0x8
struct FSoundGeneratorOutput {
    /* 0x0000 */ FName Name;
};

// Size: 0x30
class USoundModulatorBase : public UObject {
};

// Size: 0x1
struct FSoundWaveCloudStreamingPlatformProjectSettings {
    /* 0x0000 */ ESoundWaveCloudStreamingPlatformProjectEnableType EnablementSetting;
};

// Size: 0x1
struct FSoundWaveCloudStreamingPlatformSettings {
    /* 0x0000 */ ESoundWaveCloudStreamingPlatformEnableType EnablementSetting;
};

// Size: 0x30
struct FSoundWaveCuePoint {
    /* 0x0000 */ int32_t CuePointID;
    /* 0x0008 */ FString Label;
    /* 0x0018 */ int64_t FramePosition;
    /* 0x0020 */ int64_t FrameLength;
    /* 0x0028 */ bool bIsLoopRegion;
};

// Size: 0x30
class USoundfieldEffectBase : public UObject {
    /* 0x0028 */ USoundfieldEffectSettingsBase* Settings;
};

// Size: 0x28
class USoundfieldEffectSettingsBase : public UObject {
};

// Size: 0x28
class USoundfieldEncodingSettingsBase : public UObject {
};

// Size: 0x28
class USoundfieldEndpointSettingsBase : public UObject {
};

// Size: 0x28
class USourceDataOverridePluginSourceSettingsBase : public UObject {
};

// Size: 0x28
class USpatializationPluginSourceSettingsBase : public UObject {
};

// Size: 0x28
class UWaveformTransformationBase : public UObject {
};

// Size: 0x38
class UWaveformTransformationChain : public UObject {
    /* 0x0028 */ TArray<UWaveformTransformationBase*> Transformations;
};

// Size: 0x38
class UAudioLinkSettingsAbstract : public UObject {
};

// Size: 0x28
class IAudioLinkBlueprintInterface : public UInterface {

    bool IsLinkPlaying() const;
    void PlayLink(float StartTime);
    void SetLinkSound(USoundBase* NewSound);
    void StopLink();
};

// Size: 0x108
class UAudioBusSubsystem : public UAudioEngineSubsystem {
};

// Size: 0x128
class UAudioDeviceNotificationSubsystem : public UEngineSubsystem {
    /* 0x0038 */ FMulticastInlineDelegate DefaultCaptureDeviceChanged;
    /* 0x0060 */ FMulticastInlineDelegate DefaultRenderDeviceChanged;
    /* 0x0088 */ FMulticastInlineDelegate DeviceAdded;
    /* 0x00b0 */ FMulticastInlineDelegate DeviceRemoved;
    /* 0x00d8 */ FMulticastInlineDelegate DeviceStateChanged;
    /* 0x0100 */ FMulticastInlineDelegate DeviceSwitched;
};

// Size: 0xa8
class UAudioGenerator : public UObject {
};

// Size: 0x28
class UAudioMixerBlueprintLibrary : public UBlueprintFunctionLibrary {

    static void AddMasterSubmixEffect(const UObject* WorldContextObject, USoundEffectSubmixPreset* SubmixEffectPreset);
    static void AddSourceEffectToPresetChain(const UObject* WorldContextObject, USoundEffectSourcePresetChain* PresetChain, FSourceEffectChainEntry Entry);
    static int32_t AddSubmixEffect(const UObject* WorldContextObject, USoundSubmix* SoundSubmix, USoundEffectSubmixPreset* SubmixEffectPreset);
    static void ClearMasterSubmixEffects(const UObject* WorldContextObject);
    static void ClearSubmixEffectChainOverride(const UObject* WorldContextObject, USoundSubmix* SoundSubmix, float FadeTimeSec);
    static void ClearSubmixEffects(const UObject* WorldContextObject, USoundSubmix* SoundSubmix);
    static FString Conv_AudioOutputDeviceInfoToString(const FAudioOutputDeviceInfo& Info);
    static void GetAvailableAudioOutputDevices(const UObject* WorldContextObject, const FDelegate& OnObtainDevicesEvent);
    static void GetCurrentAudioOutputDeviceName(const UObject* WorldContextObject, const FDelegate& OnObtainCurrentDeviceEvent);
    static void GetMagnitudeForFrequencies(const UObject* WorldContextObject, const TArray<float>& Frequencies, TArray<float>& Magnitudes, USoundSubmix* SubmixToAnalyze);
    static int32_t GetNumberOfEntriesInSourceEffectChain(const UObject* WorldContextObject, USoundEffectSourcePresetChain* PresetChain);
    static void GetPhaseForFrequencies(const UObject* WorldContextObject, const TArray<float>& Frequencies, TArray<float>& Phases, USoundSubmix* SubmixToAnalyze);
    static bool IsAudioBusActive(const UObject* WorldContextObject, UAudioBus* AudioBus);
    static TArray<FSoundSubmixSpectralAnalysisBandSettings> MakeFullSpectrumSpectralAnalysisBandSettings(int32_t InNumBands, float InMinimumFrequency, float InMaximumFrequency, int32_t InAttackTimeMsec, int32_t InReleaseTimeMsec);
    static TArray<FSoundSubmixSpectralAnalysisBandSettings> MakeMusicalSpectralAnalysisBandSettings(int32_t InNumSemitones, EMusicalNoteName InStartingMusicalNote, int32_t InStartingOctave, int32_t InAttackTimeMsec, int32_t InReleaseTimeMsec);
    static TArray<FSoundSubmixSpectralAnalysisBandSettings> MakePresetSpectralAnalysisBandSettings(EAudioSpectrumBandPresetType InBandPresetType, int32_t InNumBands, int32_t InAttackTimeMsec, int32_t InReleaseTimeMsec);
    static void PauseRecordingOutput(const UObject* WorldContextObject, USoundSubmix* SubmixToPause);
    static void PrimeSoundCueForPlayback(USoundCue* SoundCue);
    static void PrimeSoundForPlayback(USoundWave* SoundWave, const FDelegate OnLoadCompletion);
    static void RegisterAudioBusToSubmix(const UObject* WorldContextObject, USoundSubmix* SoundSubmix, UAudioBus* AudioBus);
    static void RemoveMasterSubmixEffect(const UObject* WorldContextObject, USoundEffectSubmixPreset* SubmixEffectPreset);
    static void RemoveSourceEffectFromPresetChain(const UObject* WorldContextObject, USoundEffectSourcePresetChain* PresetChain, int32_t EntryIndex);
    static void RemoveSubmixEffect(const UObject* WorldContextObject, USoundSubmix* SoundSubmix, USoundEffectSubmixPreset* SubmixEffectPreset);
    static void RemoveSubmixEffectAtIndex(const UObject* WorldContextObject, USoundSubmix* SoundSubmix, int32_t SubmixChainIndex);
    static void RemoveSubmixEffectPreset(const UObject* WorldContextObject, USoundSubmix* SoundSubmix, USoundEffectSubmixPreset* SubmixEffectPreset);
    static void RemoveSubmixEffectPresetAtIndex(const UObject* WorldContextObject, USoundSubmix* SoundSubmix, int32_t SubmixChainIndex);
    static void ReplaceSoundEffectSubmix(const UObject* WorldContextObject, USoundSubmix* InSoundSubmix, int32_t SubmixChainIndex, USoundEffectSubmixPreset* SubmixEffectPreset);
    static void ReplaceSubmixEffect(const UObject* WorldContextObject, USoundSubmix* InSoundSubmix, int32_t SubmixChainIndex, USoundEffectSubmixPreset* SubmixEffectPreset);
    static void ResumeRecordingOutput(const UObject* WorldContextObject, USoundSubmix* SubmixToPause);
    static void SetBypassSourceEffectChainEntry(const UObject* WorldContextObject, USoundEffectSourcePresetChain* PresetChain, int32_t EntryIndex, bool bBypassed);
    static void SetSubmixEffectChainOverride(const UObject* WorldContextObject, USoundSubmix* SoundSubmix, TArray<USoundEffectSubmixPreset*> SubmixEffectPresetChain, float FadeTimeSec);
    static void StartAnalyzingOutput(const UObject* WorldContextObject, USoundSubmix* SubmixToAnalyze, EFFTSize FFTSize, EFFTPeakInterpolationMethod InterpolationMethod, EFFTWindowType WindowType, float HopSize, EAudioSpectrumType SpectrumType);
    static void StartAudioBus(const UObject* WorldContextObject, UAudioBus* AudioBus);
    static void StartRecordingOutput(const UObject* WorldContextObject, float ExpectedDuration, USoundSubmix* SubmixToRecord);
    static void StopAnalyzingOutput(const UObject* WorldContextObject, USoundSubmix* SubmixToStopAnalyzing);
    static void StopAudioBus(const UObject* WorldContextObject, UAudioBus* AudioBus);
    static USoundWave* StopRecordingOutput(const UObject* WorldContextObject, EAudioRecordingExportType ExportType, FString Name, FString Path, USoundSubmix* SubmixToRecord, USoundWave* ExistingSoundWaveToOverwrite);
    static void SwapAudioOutputDevice(const UObject* WorldContextObject, FString NewDeviceId, const FDelegate& OnCompletedDeviceSwap);
    static float TrimAudioCache(float InMegabytesToFree);
    static void UnregisterAudioBusFromSubmix(const UObject* WorldContextObject, USoundSubmix* SoundSubmix, UAudioBus* AudioBus);
};

// Size: 0x48
struct FAudioOutputDeviceInfo {
    /* 0x0000 */ FString Name;
    /* 0x0010 */ FString DeviceID;
    /* 0x0020 */ int32_t NumChannels;
    /* 0x0024 */ int32_t SampleRate;
    /* 0x0028 */ EAudioMixerStreamDataFormatType Format;
    /* 0x0030 */ TArray<EAudioMixerChannelType> OutputChannelArray;
    /* 0x0040 */ bool bIsSystemDefault;
    /* 0x0040 */ bool bIsCurrentDevice;
};

enum class EAudioDeviceChangedRole {
    Invalid = 0,
    Console = 1,
    Multimedia = 2,
    Communications = 3,
    Count = 4,
    EAudioDeviceChangedRole_MAX = 5,
};

enum class EAudioDeviceChangedState {
    Invalid = 0,
    Active = 1,
    Disabled = 2,
    NotPresent = 3,
    Unplugged = 4,
    Count = 5,
    EAudioDeviceChangedState_MAX = 6,
};

enum class EAudioMixerChannelType {
    FrontLeft = 0,
    FrontRight = 1,
    FrontCenter = 2,
    LowFrequency = 3,
    BackLeft = 4,
    BackRight = 5,
    FrontLeftOfCenter = 6,
    FrontRightOfCenter = 7,
    BackCenter = 8,
    SideLeft = 9,
    SideRight = 10,
    TopCenter = 11,
    TopFrontLeft = 12,
    TopFrontCenter = 13,
    TopFrontRight = 14,
    TopBackLeft = 15,
    TopBackCenter = 16,
    TopBackRight = 17,
    Unknown = 18,
    ChannelTypeCount = 19,
    DefaultChannel = 0,
    EAudioMixerChannelType_MAX = 20,
};

enum class EAudioMixerStreamDataFormatType {
    Unknown = 0,
    Float = 1,
    Int16 = 2,
    Unsupported = 3,
    EAudioMixerStreamDataFormatType_MAX = 4,
};

enum class EMusicalNoteName {
    C = 0,
    Db = 1,
    D = 2,
    Eb = 3,
    E = 4,
    F = 5,
    Gb = 6,
    G = 7,
    Ab = 8,
    A = 9,
    Bb = 10,
    B = 11,
    EMusicalNoteName_MAX = 12,
};

enum class ERequiredSubmixes {
    Main = 0,
    BaseDefault = 1,
    Reverb = 2,
    EQ = 3,
    Count = 4,
    ERequiredSubmixes_MAX = 5,
};

enum class ESourceManagerRenderThreadPhase {
    Begin = 0,
    PumpMpscCmds = 1,
    PumpCmds = 2,
    ProcessModulators = 3,
    UpdatePendingReleaseData = 4,
    GenerateSrcAudio_WithBusses = 5,
    ComputeBusses = 6,
    GenerateSrcAudio_WithoutBusses = 7,
    UpdateBusses = 8,
    SpatialInterface_OnAllSourcesProcessed = 9,
    SourceDataOverride_OnAllSourcesProcessed = 10,
    UpdateGameThreadCopies = 11,
    Finished = 12,
    ESourceManagerRenderThreadPhase_MAX = 13,
};

enum class ESubmixEffectDynamicsChannelLinkMode {
    Disabled = 0,
    Average = 1,
    Peak = 2,
    Count = 3,
    ESubmixEffectDynamicsChannelLinkMode_MAX = 4,
};

enum class ESubmixEffectDynamicsKeySource {
    Default = 0,
    AudioBus = 1,
    Submix = 2,
    Count = 3,
    ESubmixEffectDynamicsKeySource_MAX = 4,
};

enum class ESubmixEffectDynamicsPeakMode {
    MeanSquared = 0,
    RootMeanSquared = 1,
    Peak = 2,
    Count = 3,
    ESubmixEffectDynamicsPeakMode_MAX = 4,
};

enum class ESubmixEffectDynamicsProcessorType {
    Compressor = 0,
    Limiter = 1,
    Expander = 2,
    Gate = 3,
    UpwardsCompressor = 4,
    Count = 5,
    ESubmixEffectDynamicsProcessorType_MAX = 6,
};

enum class ESwapAudioOutputDeviceResultState {
    Failure = 0,
    Success = 1,
    None = 2,
    ESwapAudioOutputDeviceResultState_MAX = 3,
};

// Size: 0x208
class UQuartzClockHandle : public UObject {

    float GetBeatProgressPercent(EQuartzCommandQuantization QuantizationBoundary, float PhaseOffset, float MsOffset);
    float GetBeatsPerMinute(const UObject* WorldContextObject) const;
    FQuartzTransportTimeStamp GetCurrentTimestamp(const UObject* WorldContextObject);
    float GetDurationOfQuantizationTypeInSeconds(const UObject* WorldContextObject, const EQuartzCommandQuantization& QuantizationType, float Multiplier);
    float GetEstimatedRunTime(const UObject* WorldContextObject);
    float GetMillisecondsPerTick(const UObject* WorldContextObject) const;
    float GetSecondsPerTick(const UObject* WorldContextObject) const;
    float GetThirtySecondNotesPerMinute(const UObject* WorldContextObject) const;
    float GetTicksPerSecond(const UObject* WorldContextObject) const;
    bool IsClockRunning(const UObject* WorldContextObject);
    void NotifyOnQuantizationBoundary(const UObject* WorldContextObject, FQuartzQuantizationBoundary InQuantizationBoundary, const FDelegate& InDelegate, float InMsOffset);
    void PauseClock(const UObject* WorldContextObject, UQuartzClockHandle*& ClockHandle);
    void ResetTransport(const UObject* WorldContextObject, const FDelegate& InDelegate);
    void ResetTransportQuantized(const UObject* WorldContextObject, FQuartzQuantizationBoundary InQuantizationBoundary, const FDelegate& InDelegate, UQuartzClockHandle*& ClockHandle);
    void ResumeClock(const UObject* WorldContextObject, UQuartzClockHandle*& ClockHandle);
    void SetBeatsPerMinute(const UObject* WorldContextObject, const FQuartzQuantizationBoundary& QuantizationBoundary, const FDelegate& Delegate, UQuartzClockHandle*& ClockHandle, float beatsPerMinute);
    void SetMillisecondsPerTick(const UObject* WorldContextObject, const FQuartzQuantizationBoundary& QuantizationBoundary, const FDelegate& Delegate, UQuartzClockHandle*& ClockHandle, float MillisecondsPerTick);
    void SetSecondsPerTick(const UObject* WorldContextObject, const FQuartzQuantizationBoundary& QuantizationBoundary, const FDelegate& Delegate, UQuartzClockHandle*& ClockHandle, float SecondsPerTick);
    void SetThirtySecondNotesPerMinute(const UObject* WorldContextObject, const FQuartzQuantizationBoundary& QuantizationBoundary, const FDelegate& Delegate, UQuartzClockHandle*& ClockHandle, float ThirtySecondsNotesPerMinute);
    void SetTicksPerSecond(const UObject* WorldContextObject, const FQuartzQuantizationBoundary& QuantizationBoundary, const FDelegate& Delegate, UQuartzClockHandle*& ClockHandle, float TicksPerSecond);
    void StartClock(const UObject* WorldContextObject, UQuartzClockHandle*& ClockHandle);
    void StartOtherClock(const UObject* WorldContextObject, FName OtherClockName, FQuartzQuantizationBoundary InQuantizationBoundary, const FDelegate& InDelegate);
    void StopClock(const UObject* WorldContextObject, bool CancelPendingEvents, UQuartzClockHandle*& ClockHandle);
    void SubscribeToAllQuantizationEvents(const UObject* WorldContextObject, const FDelegate& OnQuantizationEvent, UQuartzClockHandle*& ClockHandle);
    void SubscribeToQuantizationEvent(const UObject* WorldContextObject, EQuartzCommandQuantization InQuantizationBoundary, const FDelegate& OnQuantizationEvent, UQuartzClockHandle*& ClockHandle);
    void UnsubscribeFromAllTimeDivisions(const UObject* WorldContextObject, UQuartzClockHandle*& ClockHandle);
    void UnsubscribeFromTimeDivision(const UObject* WorldContextObject, EQuartzCommandQuantization InQuantizationBoundary, UQuartzClockHandle*& ClockHandle);
};

// Size: 0x68
class UQuartzSubsystem : public UTickableWorldSubsystem {

    UQuartzClockHandle* CreateNewClock(const UObject* WorldContextObject, FName ClockName, FQuartzClockSettings InSettings, bool bOverrideSettingsIfClockExists, bool bUseAudioEngineClockManager);
    void DeleteClockByHandle(const UObject* WorldContextObject, UQuartzClockHandle*& InClockHandle);
    void DeleteClockByName(const UObject* WorldContextObject, FName ClockName);
    bool DoesClockExist(const UObject* WorldContextObject, FName ClockName);
    float GetAudioRenderThreadToGameThreadAverageLatency();
    float GetAudioRenderThreadToGameThreadMaxLatency();
    float GetAudioRenderThreadToGameThreadMinLatency();
    FQuartzTransportTimeStamp GetCurrentClockTimestamp(const UObject* WorldContextObject, const FName& InClockName);
    float GetDurationOfQuantizationTypeInSeconds(const UObject* WorldContextObject, FName ClockName, const EQuartzCommandQuantization& QuantizationType, float Multiplier);
    float GetEstimatedClockRunTime(const UObject* WorldContextObject, const FName& InClockName);
    float GetGameThreadToAudioRenderThreadAverageLatency(const UObject* WorldContextObject);
    float GetGameThreadToAudioRenderThreadMaxLatency(const UObject* WorldContextObject);
    float GetGameThreadToAudioRenderThreadMinLatency(const UObject* WorldContextObject);
    UQuartzClockHandle* GetHandleForClock(const UObject* WorldContextObject, FName ClockName);
    float GetRoundTripAverageLatency(const UObject* WorldContextObject);
    float GetRoundTripMaxLatency(const UObject* WorldContextObject);
    float GetRoundTripMinLatency(const UObject* WorldContextObject);
    bool IsClockRunning(const UObject* WorldContextObject, FName ClockName);
    bool IsQuartzEnabled();
    void SetQuartzSubsystemTickableWhenPaused(const bool bInTickableWhenPaused);
};

// Size: 0x438
class UScrubbedSound : public USoundWave {
    /* 0x0430 */ USoundWave* SoundWaveToScrub;

    float GetPlayheadTime() const;
    void SetGrainDurationRange(const FVector2D& InGrainDurationRangeSeconds);
    void SetIsScrubbing(bool bInIsScrubbing);
    void SetIsScrubbingWhileStationary(bool bInScrubWhileStationary);
    void SetPlayheadTime(float InPlayheadTimeSeconds);
    void SetSoundWave(USoundWave* InSoundWave);
};

// Size: 0xc
struct FSubmixEffectDynamicProcessorFilterSettings {
    /* 0x0000 */ bool bEnabled;
    /* 0x0004 */ float Cutoff;
    /* 0x0008 */ float GainDb;
};

// Size: 0x150
class USubmixEffectDynamicsProcessorPreset : public USoundEffectSubmixPreset {
    /* 0x00f0 */ FSubmixEffectDynamicsProcessorSettings Settings;

    void ResetKey();
    void SetAudioBus(UAudioBus* AudioBus);
    void SetExternalSubmix(USoundSubmix* Submix);
    void SetSettings(const FSubmixEffectDynamicsProcessorSettings& Settings);
};

// Size: 0x60
struct FSubmixEffectDynamicsProcessorSettings {
    /* 0x0000 */ ESubmixEffectDynamicsProcessorType DynamicsProcessorType;
    /* 0x0001 */ ESubmixEffectDynamicsPeakMode PeakMode;
    /* 0x0002 */ ESubmixEffectDynamicsChannelLinkMode LinkMode;
    /* 0x0004 */ float InputGainDb;
    /* 0x0008 */ float ThresholdDb;
    /* 0x000c */ float Ratio;
    /* 0x0010 */ float KneeBandwidthDb;
    /* 0x0014 */ float LookAheadMsec;
    /* 0x0018 */ float AttackTimeMsec;
    /* 0x001c */ float ReleaseTimeMsec;
    /* 0x0020 */ ESubmixEffectDynamicsKeySource KeySource;
    /* 0x0028 */ UAudioBus* ExternalAudioBus;
    /* 0x0030 */ USoundSubmix* ExternalSubmix;
    /* 0x0038 */ bool bChannelLinked;
    /* 0x0038 */ bool bAnalogMode;
    /* 0x0038 */ bool bBypass;
    /* 0x0038 */ bool bKeyAudition;
    /* 0x003c */ float KeyGainDb;
    /* 0x0040 */ float OutputGainDb;
    /* 0x0044 */ FSubmixEffectDynamicProcessorFilterSettings KeyHighshelf;
    /* 0x0050 */ FSubmixEffectDynamicProcessorFilterSettings KeyLowshelf;
};

// Size: 0x10
struct FSubmixEffectEQBand {
    /* 0x0000 */ float Frequency;
    /* 0x0004 */ float Bandwidth;
    /* 0x0008 */ float GainDb;
    /* 0x000c */ bool bEnabled;
};

// Size: 0x110
class USubmixEffectReverbPreset : public USoundEffectSubmixPreset {
    /* 0x00d0 */ FSubmixEffectReverbSettings Settings;

    void SetSettings(const FSubmixEffectReverbSettings& InSettings);
    void SetSettingsWithReverbEffect(const UReverbEffect* InReverbEffect, const float WetLevel, const float DryLevel);
};

// Size: 0x40
struct FSubmixEffectReverbSettings {
    /* 0x0000 */ bool bBypassEarlyReflections;
    /* 0x0004 */ float ReflectionsDelay;
    /* 0x0008 */ float GainHF;
    /* 0x000c */ float ReflectionsGain;
    /* 0x0010 */ bool bBypassLateReflections;
    /* 0x0014 */ float LateDelay;
    /* 0x0018 */ float DecayTime;
    /* 0x001c */ float Density;
    /* 0x0020 */ float Diffusion;
    /* 0x0024 */ float AirAbsorptionGainHF;
    /* 0x0028 */ float DecayHFRatio;
    /* 0x002c */ float LateGain;
    /* 0x0030 */ float Gain;
    /* 0x0034 */ float WetLevel;
    /* 0x0038 */ float DryLevel;
    /* 0x003c */ bool bBypass;
};

// Size: 0xb0
class USubmixEffectSubmixEQPreset : public USoundEffectSubmixPreset {
    /* 0x00a0 */ FSubmixEffectSubmixEQSettings Settings;

    void SetSettings(const FSubmixEffectSubmixEQSettings& InSettings);
};

// Size: 0x10
struct FSubmixEffectSubmixEQSettings {
    /* 0x0000 */ TArray<FSubmixEffectEQBand> EQBands;
};

// Size: 0x28
struct FSwapAudioOutputResult {
    /* 0x0000 */ FString CurrentDeviceId;
    /* 0x0010 */ FString RequestedDeviceId;
    /* 0x0020 */ ESwapAudioOutputDeviceResultState Result;
};

// Size: 0x8a0
class USynthComponent : public USceneComponent {
    /* 0x0240 */ bool bAutoDestroy;
    /* 0x0240 */ bool bStopWhenOwnerDestroyed;
    /* 0x0240 */ bool bAllowSpatialization;
    /* 0x0240 */ bool bOverrideAttenuation;
    /* 0x0244 */ bool bEnableBusSends;
    /* 0x0244 */ bool bEnableBaseSubmix;
    /* 0x0244 */ bool bEnableSubmixSends;
    /* 0x0248 */ USoundAttenuation* AttenuationSettings;
    /* 0x0250 */ FSoundAttenuationSettings AttenuationOverrides;
    /* 0x0620 */ USoundConcurrency* ConcurrencySettings;
    /* 0x0628 */ TSet<USoundConcurrency*> ConcurrencySet;
    /* 0x0678 */ FSoundModulationDefaultRoutingSettings ModulationRouting;
    /* 0x07e0 */ USoundClass* SoundClass;
    /* 0x07e8 */ USoundEffectSourcePresetChain* SourceEffectChain;
    /* 0x07f0 */ USoundSubmixBase* SoundSubmix;
    /* 0x07f8 */ TArray<FSoundSubmixSendInfo> SoundSubmixSends;
    /* 0x0808 */ TArray<FSoundSourceBusSendInfo> BusSends;
    /* 0x0818 */ TArray<FSoundSourceBusSendInfo> PreEffectBusSends;
    /* 0x0828 */ bool bIsUISound;
    /* 0x0828 */ bool bIsPreviewSound;
    /* 0x082c */ int32_t EnvelopeFollowerAttackTime;
    /* 0x0830 */ int32_t EnvelopeFollowerReleaseTime;
    /* 0x0838 */ FMulticastInlineDelegate OnAudioEnvelopeValue;
    /* 0x0868 */ USynthSound* Synth;
    /* 0x0870 */ UAudioComponent* AudioComponent;

    void AdjustVolume(float AdjustVolumeDuration, float AdjustVolumeLevel, const EAudioFaderCurve FadeCurve) const;
    void FadeIn(float FadeInDuration, float FadeVolumeLevel, float StartTime, const EAudioFaderCurve FadeCurve) const;
    void FadeOut(float FadeOutDuration, float FadeVolumeLevel, const EAudioFaderCurve FadeCurve) const;
    TSet<USoundModulatorBase*> GetModulators(const EModulationDestination destination);
    bool IsPlaying() const;
    void SetAudioBusSendPostEffect(UAudioBus* AudioBus, float AudioBusSendLevel);
    void SetAudioBusSendPreEffect(UAudioBus* AudioBus, float AudioBusSendLevel);
    void SetLowPassFilterEnabled(bool InLowPassFilterEnabled);
    void SetLowPassFilterFrequency(float InLowPassFilterFrequency);
    void SetModulationRouting(const TSet<USoundModulatorBase*>& Modulators, const EModulationDestination destination, const EModulationRouting RoutingMethod);
    void SetOutputToBusOnly(bool bInOutputToBusOnly);
    void SetSourceBusSendPostEffect(USoundSourceBus* SoundSourceBus, float SourceBusSendLevel);
    void SetSourceBusSendPreEffect(USoundSourceBus* SoundSourceBus, float SourceBusSendLevel);
    void SetSubmixSend(USoundSubmixBase* Submix, float SendLevel);
    void SetVolumeMultiplier(float VolumeMultiplier);
    void Start();
    void Stop();
};

// Size: 0x470
class USynthSound : public USoundWaveProcedural {
    /* 0x0450 */ TWeakObjectPtr<USynthComponent> OwningSynthComponent;
};

enum class ESoundwaveSampleRateSettings {
    Max = 0,
    High = 1,
    Medium = 2,
    Low = 3,
    Min = 4,
};

// Size: 0x10
struct FPlatformRuntimeAudioCompressionOverrides {
    /* 0x0000 */ bool bOverrideCompressionTimes;
    /* 0x0004 */ float DurationThreshold;
    /* 0x0008 */ int32_t MaxNumRandomBranches;
    /* 0x000c */ int32_t SoundCueQualityIndex;
};

// Size: 0x78
class UAudioSynesthesiaNRT : public UAudioAnalyzerNRT {
};

// Size: 0x28
class UAudioSynesthesiaNRTSettings : public UAudioAnalyzerNRTSettings {
};

// Size: 0x28
class UAudioSynesthesiaSettings : public UAudioAnalyzerSettings {
};

// Size: 0xf8
class UConstantQAnalyzer : public UAudioAnalyzer {
    /* 0x00a0 */ UConstantQSettings* Settings;
    /* 0x00a8 */ FMulticastInlineDelegate OnConstantQResults;
    /* 0x00d0 */ FMulticastInlineDelegate OnLatestConstantQResults;

    void GetCenterFrequencies(TArray<float>& OutCenterFrequencies);
    int32_t GetNumCenterFrequencies() const;
};

// Size: 0x80
class UConstantQNRT : public UAudioSynesthesiaNRT {
    /* 0x0078 */ UConstantQNRTSettings* Settings;

    void GetChannelConstantQAtTime(const float InSeconds, const int32_t InChannel, TArray<float>& OutConstantQ) const;
    void GetNormalizedChannelConstantQAtTime(const float InSeconds, const int32_t InChannel, TArray<float>& OutConstantQ) const;
};

// Size: 0x48
class UConstantQNRTSettings : public UAudioSynesthesiaNRTSettings {
    /* 0x0028 */ float StartingFrequency;
    /* 0x002c */ int32_t NumBands;
    /* 0x0030 */ float NumBandsPerOctave;
    /* 0x0034 */ float AnalysisPeriod;
    /* 0x0038 */ bool bDownmixToMono;
    /* 0x0039 */ EConstantQFFTSizeEnum FFTSize;
    /* 0x003a */ EFFTWindowType WindowType;
    /* 0x003b */ EAudioSpectrumType SpectrumType;
    /* 0x003c */ float BandWidthStretch;
    /* 0x0040 */ EConstantQNormalizationEnum CQTNormalization;
    /* 0x0044 */ float NoiseFloorDb;
};

// Size: 0x18
struct FConstantQResults {
    /* 0x0000 */ float TimeSeconds;
    /* 0x0008 */ TArray<float> SpectrumValues;
};

// Size: 0x48
class UConstantQSettings : public UAudioSynesthesiaSettings {
    /* 0x0028 */ float StartingFrequencyHz;
    /* 0x002c */ int32_t NumBands;
    /* 0x0030 */ float NumBandsPerOctave;
    /* 0x0034 */ float AnalysisPeriodInSeconds;
    /* 0x0038 */ bool bDownmixToMono;
    /* 0x0039 */ EConstantQFFTSizeEnum FFTSize;
    /* 0x003a */ EFFTWindowType WindowType;
    /* 0x003b */ EAudioSpectrumType SpectrumType;
    /* 0x003c */ float BandWidthStretch;
    /* 0x0040 */ EConstantQNormalizationEnum CQTNormalization;
    /* 0x0044 */ float NoiseFloorDb;
};

enum class EConstantQFFTSizeEnum {
    Min = 0,
    XXSmall = 1,
    XSmall = 2,
    Small = 3,
    Medium = 4,
    Large = 5,
    XLarge = 6,
    XXLarge = 7,
    Max = 8,
};

enum class EConstantQNormalizationEnum {
    EqualEuclideanNorm = 0,
    EqualEnergy = 1,
    EqualAmplitude = 2,
    EConstantQNormalizationEnum_MAX = 3,
};

enum class ELoudnessCurveTypeEnum {
    A = 0,
    B = 1,
    C = 2,
    D = 3,
    K = 4,
    None = 5,
    ELoudnessCurveTypeEnum_MAX = 6,
};

enum class ELoudnessNRTCurveTypeEnum {
    A = 0,
    B = 1,
    C = 2,
    D = 3,
    K = 4,
    None = 5,
    ELoudnessNRTCurveTypeEnum_MAX = 6,
};

enum class EMeterPeakType {
    MeanSquared = 0,
    RootMeanSquared = 1,
    Peak = 2,
    Count = 3,
    EMeterPeakType_MAX = 4,
};

// Size: 0xe8
class ULoudnessAnalyzer : public UAudioAnalyzer {
    /* 0x00a0 */ ULoudnessSettings* Settings;
    /* 0x00a8 */ FMulticastInlineDelegate OnOverallLoudnessResults;
    /* 0x00b8 */ FMulticastInlineDelegate OnPerChannelLoudnessResults;
    /* 0x00c8 */ FMulticastInlineDelegate OnLatestOverallLoudnessResults;
    /* 0x00d8 */ FMulticastInlineDelegate OnLatestPerChannelLoudnessResults;
};

// Size: 0x80
class ULoudnessNRT : public UAudioSynesthesiaNRT {
    /* 0x0078 */ ULoudnessNRTSettings* Settings;

    void GetChannelLoudnessAtTime(const float InSeconds, const int32_t InChannel, float& OutLoudness) const;
    void GetLoudnessAtTime(const float InSeconds, float& OutLoudness) const;
    void GetNormalizedChannelLoudnessAtTime(const float InSeconds, const int32_t InChannel, float& OutLoudness) const;
    void GetNormalizedLoudnessAtTime(const float InSeconds, float& OutLoudness) const;
};

// Size: 0x40
class ULoudnessNRTSettings : public UAudioSynesthesiaNRTSettings {
    /* 0x0028 */ float AnalysisPeriod;
    /* 0x002c */ float MinimumFrequency;
    /* 0x0030 */ float MaximumFrequency;
    /* 0x0034 */ ELoudnessNRTCurveTypeEnum CurveType;
    /* 0x0038 */ float NoiseFloorDb;
};

// Size: 0x10
struct FLoudnessResults {
    /* 0x0000 */ float Loudness;
    /* 0x0004 */ float NormalizedLoudness;
    /* 0x0008 */ float PerceptualEnergy;
    /* 0x000c */ float TimeSeconds;
};

// Size: 0x40
class ULoudnessSettings : public UAudioSynesthesiaSettings {
    /* 0x0028 */ float AnalysisPeriod;
    /* 0x002c */ float MinimumFrequency;
    /* 0x0030 */ float MaximumFrequency;
    /* 0x0034 */ ELoudnessCurveTypeEnum CurveType;
    /* 0x0038 */ float NoiseFloorDb;
    /* 0x003c */ float ExpectedMaxLoudness;
};

// Size: 0x148
class UMeterAnalyzer : public UAudioAnalyzer {
    /* 0x00a0 */ UMeterSettings* Settings;
    /* 0x00a8 */ FMulticastInlineDelegate OnOverallMeterResults;
    /* 0x00d0 */ FMulticastInlineDelegate OnPerChannelMeterResults;
    /* 0x00f8 */ FMulticastInlineDelegate OnLatestOverallMeterResults;
    /* 0x0120 */ FMulticastInlineDelegate OnLatestPerChannelMeterResults;
};

// Size: 0x14
struct FMeterResults {
    /* 0x0000 */ float TimeSeconds;
    /* 0x0004 */ float MeterValue;
    /* 0x0008 */ float PeakValue;
    /* 0x000c */ int32_t NumSamplesClipping;
    /* 0x0010 */ float ClippingValue;
};

// Size: 0x40
class UMeterSettings : public UAudioSynesthesiaSettings {
    /* 0x0028 */ float AnalysisPeriod;
    /* 0x002c */ EMeterPeakType PeakMode;
    /* 0x0030 */ int32_t MeterAttackTime;
    /* 0x0034 */ int32_t MeterReleaseTime;
    /* 0x0038 */ int32_t PeakHoldTime;
    /* 0x003c */ float ClippingThreshold;
};

// Size: 0x80
class UOnsetNRT : public UAudioSynesthesiaNRT {
    /* 0x0078 */ UOnsetNRTSettings* Settings;

    void GetChannelOnsetsBetweenTimes(const float InStartSeconds, const float InEndSeconds, const int32_t InChannel, TArray<float>& OutOnsetTimestamps, TArray<float>& OutOnsetStrengths) const;
    void GetNormalizedChannelOnsetsBetweenTimes(const float InStartSeconds, const float InEndSeconds, const int32_t InChannel, TArray<float>& OutOnsetTimestamps, TArray<float>& OutOnsetStrengths) const;
};

// Size: 0x40
class UOnsetNRTSettings : public UAudioSynesthesiaNRTSettings {
    /* 0x0028 */ bool bDownmixToMono;
    /* 0x002c */ float GranularityInSeconds;
    /* 0x0030 */ float Sensitivity;
    /* 0x0034 */ float MinimumFrequency;
    /* 0x0038 */ float MaximumFrequency;
};

// Size: 0x30
class USynesthesiaSpectrumAnalysisSettings : public UAudioSynesthesiaSettings {
    /* 0x0028 */ float AnalysisPeriod;
    /* 0x002c */ EFFTSize FFTSize;
    /* 0x002d */ EAudioSpectrumType SpectrumType;
    /* 0x002e */ EFFTWindowType WindowType;
    /* 0x002f */ bool bDownmixToMono;
};

// Size: 0xf8
class USynesthesiaSpectrumAnalyzer : public UAudioAnalyzer {
    /* 0x00a0 */ USynesthesiaSpectrumAnalysisSettings* Settings;
    /* 0x00a8 */ FMulticastInlineDelegate OnSpectrumResults;
    /* 0x00d0 */ FMulticastInlineDelegate OnLatestSpectrumResults;

    void GetCenterFrequencies(const float InSampleRate, TArray<float>& OutCenterFrequencies);
    int32_t GetNumCenterFrequencies() const;
};

// Size: 0x18
struct FSynesthesiaSpectrumResults {
    /* 0x0000 */ float TimeSeconds;
    /* 0x0008 */ TArray<float> SpectrumValues;
};

// Size: 0x360
class UAudioFrequencyRadialSlider : public UAudioRadialSlider {
};

// Size: 0x8c0
class UAudioFrequencySlider : public UAudioSliderBase {
    /* 0x08b0 */ FVector2D OutputRange;
};

// Size: 0x218
class UAudioMaterialButton : public UWidget {
    /* 0x0168 */ FAudioMaterialButtonStyle WidgetStyle;
    /* 0x01f0 */ FMulticastInlineDelegate OnButtonPressedChangedEvent;
    /* 0x0200 */ bool bIsPressed;

    bool GetIsPressed() const;
    void SetIsPressed(bool InPressed);
};

// Size: 0x88
struct FAudioMaterialButtonStyle : public FAudioMaterialWidgetStyle {
    /* 0x0018 */ FLinearColor ButtonMainColor;
    /* 0x0028 */ FLinearColor ButtonMainColorTint_1;
    /* 0x0038 */ FLinearColor ButtonMainColorTint_2;
    /* 0x0048 */ FLinearColor ButtonAccentColor;
    /* 0x0058 */ FLinearColor ButtonShadowColor;
    /* 0x0068 */ FLinearColor ButtonUnpressedOutlineColor;
    /* 0x0078 */ FLinearColor ButtonPressedOutlineColor;
};

// Size: 0xb8
class UAudioMaterialButtonWidgetStyle : public USlateWidgetStyleContainerBase {
    /* 0x0030 */ FAudioMaterialButtonStyle ButtonStyle;
};

// Size: 0x1e8
class UAudioMaterialEnvelope : public UWidget {
    /* 0x0168 */ FAudioMaterialEnvelopeStyle WidgetStyle;
    /* 0x01b0 */ FAudioMaterialEnvelopeSettings EnvelopeSettings;
};

// Size: 0x24
struct FAudioMaterialEnvelopeSettings {
    /* 0x0000 */ EAudioMaterialEnvelopeType EnvelopeType;
    /* 0x0004 */ float AttackCurve;
    /* 0x0008 */ float AttackValue;
    /* 0x000c */ float AttackTime;
    /* 0x0010 */ float DecayCurve;
    /* 0x0014 */ float DecayTime;
    /* 0x0018 */ float SustainValue;
    /* 0x001c */ float ReleaseCurve;
    /* 0x0020 */ float ReleaseTime;
};

// Size: 0x48
struct FAudioMaterialEnvelopeStyle : public FAudioMaterialWidgetStyle {
    /* 0x0018 */ FLinearColor CurveColor;
    /* 0x0028 */ FLinearColor BackgroundColor;
    /* 0x0038 */ FLinearColor OutlineColor;
};

// Size: 0x370
class UAudioMaterialKnob : public UWidget {
    /* 0x0170 */ FAudioMaterialKnobStyle WidgetStyle;
    /* 0x0330 */ FMulticastInlineDelegate OnKnobValueChanged;
    /* 0x0340 */ float Value;
    /* 0x0344 */ float TuneSpeed;
    /* 0x0348 */ float FineTuneSpeed;
    /* 0x034c */ bool bLocked;
    /* 0x034d */ bool bMouseUsesStep;
    /* 0x0350 */ float StepSize;

    float GetFineTuneSpeed() const;
    bool GetIsLocked() const;
    bool GetMouseUsesStep() const;
    float GetStepSize() const;
    float GetTuneSpeed() const;
    float GetValue();
    void SetFineTuneSpeed(float InValue);
    void SetLocked(bool InLocked);
    void SetMouseUsesStep(bool InUsesStep);
    void SetStepSize(float InValue);
    void SetTuneSpeed(float InValue);
    void SetValue(float InValue);
};

// Size: 0x1c0
struct FAudioMaterialKnobStyle : public FAudioMaterialWidgetStyle {
    /* 0x0018 */ FLinearColor KnobMainColor;
    /* 0x0028 */ FLinearColor KnobAccentColor;
    /* 0x0038 */ FLinearColor KnobShadowColor;
    /* 0x0048 */ FLinearColor KnobSmoothBevelColor;
    /* 0x0058 */ FLinearColor KnobIndicatorDotColor;
    /* 0x0068 */ FLinearColor KnobEdgeFillColor;
    /* 0x0078 */ FLinearColor KnobBarColor;
    /* 0x0088 */ FLinearColor KnobBarShadowColor;
    /* 0x0098 */ FLinearColor KnobBarFillMinColor;
    /* 0x00a8 */ FLinearColor KnobBarFillMidColor;
    /* 0x00b8 */ FLinearColor KnobBarFillMaxColor;
    /* 0x00c8 */ FLinearColor KnobBarFillTintColor;
    /* 0x00e0 */ FAudioTextBoxStyle TextBoxStyle;
};

// Size: 0x1f0
class UAudioMaterialKnobWidgetStyle : public USlateWidgetStyleContainerBase {
    /* 0x0030 */ FAudioMaterialKnobStyle KnobStyle;
};

// Size: 0x290
class UAudioMaterialMeter : public UWidget {
    /* 0x0168 */ FAudioMaterialMeterStyle WidgetStyle;
    /* 0x0258 */ uint8_t Orientation;
    /* 0x025c */ FDelegate MeterChannelInfoDelegate;
    /* 0x0280 */ TArray<FMeterChannelInfo> MeterChannelInfo;

    TArray<FMeterChannelInfo> GetMeterChannelInfo() const;
    TArray<FMeterChannelInfo> GetMeterChannelInfo__DelegateSignature();
    void SetMeterChannelInfo(const TArray<FMeterChannelInfo>& InMeterChannelInfo);
};

// Size: 0xf0
struct FAudioMaterialMeterStyle : public FAudioMaterialWidgetStyle {
    /* 0x0018 */ FLinearColor MeterFillMinColor;
    /* 0x0028 */ FLinearColor MeterFillMidColor;
    /* 0x0038 */ FLinearColor MeterFillMaxColor;
    /* 0x0048 */ FLinearColor MeterFillBackgroundColor;
    /* 0x0058 */ FVector2D MeterPadding;
    /* 0x0068 */ FVector2D ValueRangeDb;
    /* 0x0078 */ bool bShowScale;
    /* 0x0079 */ bool bScaleSide;
    /* 0x007c */ float ScaleHashOffset;
    /* 0x0080 */ float ScaleHashWidth;
    /* 0x0084 */ float ScaleHashHeight;
    /* 0x0088 */ int32_t DecibelsPerHash;
    /* 0x0090 */ FSlateFontInfo Font;
};

// Size: 0x120
class UAudioMaterialMeterWidgetStyle : public USlateWidgetStyleContainerBase {
    /* 0x0030 */ FAudioMaterialMeterStyle MeterStyle;
};

// Size: 0x300
class UAudioMaterialSlider : public UWidget {
    /* 0x0170 */ FAudioMaterialSliderStyle WidgetStyle;
    /* 0x02c0 */ FMulticastInlineDelegate OnValueChanged;
    /* 0x02d0 */ float Value;
    /* 0x02d4 */ uint8_t Orientation;
    /* 0x02d8 */ float TuneSpeed;
    /* 0x02dc */ float FineTuneSpeed;
    /* 0x02e0 */ bool bLocked;
    /* 0x02e1 */ bool bMouseUsesStep;
    /* 0x02e4 */ float StepSize;

    float GetFineTuneSpeed() const;
    bool GetIsLocked() const;
    bool GetMouseUsesStep() const;
    float GetStepSize() const;
    float GetTuneSpeed() const;
    float GetValue() const;
    void SetFineTuneSpeed(const float InValue);
    void SetLocked(bool bInLocked);
    void SetMouseUsesStep(bool bInUsesStep);
    void SetStepSize(float InValue);
    void SetTuneSpeed(const float InValue);
    void SetValue(float InValue);
};

// Size: 0x150
struct FAudioMaterialSliderStyle : public FAudioMaterialWidgetStyle {
    /* 0x0018 */ FLinearColor SliderBackgroundColor;
    /* 0x0028 */ FLinearColor SliderBackgroundAccentColor;
    /* 0x0038 */ FLinearColor SliderValueMainColor;
    /* 0x0048 */ FLinearColor SliderHandleMainColor;
    /* 0x0058 */ FLinearColor SliderHandleOutlineColor;
    /* 0x0070 */ FAudioTextBoxStyle TextBoxStyle;
};

// Size: 0x180
class UAudioMaterialSliderWidgetStyle : public USlateWidgetStyleContainerBase {
    /* 0x0030 */ FAudioMaterialSliderStyle SliderStyle;
};

// Size: 0x18
struct FAudioMaterialWidgetStyle : public FSlateWidgetStyle {
    /* 0x0008 */ UMaterialInterface* Material;
    /* 0x0010 */ FVector2f DesiredSize;
};

// Size: 0x650
class UAudioMeter : public UWidget {
    /* 0x0168 */ TArray<FMeterChannelInfo> MeterChannelInfo;
    /* 0x0178 */ FDelegate MeterChannelInfoDelegate;
    /* 0x0190 */ FAudioMeterStyle WidgetStyle;
    /* 0x05c0 */ uint8_t Orientation;
    /* 0x05c4 */ FLinearColor BackgroundColor;
    /* 0x05d4 */ FLinearColor MeterBackgroundColor;
    /* 0x05e4 */ FLinearColor MeterValueColor;
    /* 0x05f4 */ FLinearColor MeterPeakColor;
    /* 0x0604 */ FLinearColor MeterClippingColor;
    /* 0x0614 */ FLinearColor MeterScaleColor;
    /* 0x0624 */ FLinearColor MeterScaleLabelColor;

    TArray<FMeterChannelInfo> GetMeterChannelInfo() const;
    TArray<FMeterChannelInfo> GetMeterChannelInfo__DelegateSignature();
    void SetBackgroundColor(FLinearColor InValue);
    void SetMeterBackgroundColor(FLinearColor InValue);
    void SetMeterChannelInfo(const TArray<FMeterChannelInfo>& InMeterChannelInfo);
    void SetMeterClippingColor(FLinearColor InValue);
    void SetMeterPeakColor(FLinearColor InValue);
    void SetMeterScaleColor(FLinearColor InValue);
    void SetMeterScaleLabelColor(FLinearColor InValue);
    void SetMeterValueColor(FLinearColor InValue);
};

// Size: 0x68
struct FAudioMeterDefaultColorStyle : public FSlateWidgetStyle {
    /* 0x0008 */ FLinearColor MeterBackgroundColor;
    /* 0x0018 */ FLinearColor MeterValueColor;
    /* 0x0028 */ FLinearColor MeterPeakColor;
    /* 0x0038 */ FLinearColor MeterClippingColor;
    /* 0x0048 */ FLinearColor MeterScaleColor;
    /* 0x0058 */ FLinearColor MeterScaleLabelColor;
};

// Size: 0x430
struct FAudioMeterStyle : public FSlateWidgetStyle {
    /* 0x0010 */ FSlateBrush MeterValueImage;
    /* 0x00c0 */ FSlateBrush BackgroundImage;
    /* 0x0170 */ FSlateBrush MeterBackgroundImage;
    /* 0x0220 */ FSlateBrush MeterValueBackgroundImage;
    /* 0x02d0 */ FSlateBrush MeterPeakImage;
    /* 0x0380 */ FVector2D MeterSize;
    /* 0x0390 */ FVector2D MeterPadding;
    /* 0x03a0 */ float MeterValuePadding;
    /* 0x03a4 */ float PeakValueWidth;
    /* 0x03a8 */ FVector2D ValueRangeDb;
    /* 0x03b8 */ bool bShowScale;
    /* 0x03b9 */ bool bScaleSide;
    /* 0x03bc */ float ScaleHashOffset;
    /* 0x03c0 */ float ScaleHashWidth;
    /* 0x03c4 */ float ScaleHashHeight;
    /* 0x03c8 */ int32_t DecibelsPerHash;
    /* 0x03d0 */ FSlateFontInfo Font;
};

// Size: 0x630
class UAudioOscilloscope : public UWidget {
    /* 0x0170 */ FAudioOscilloscopePanelStyle OscilloscopeStyle;
    /* 0x05b0 */ UAudioBus* AudioBus;
    /* 0x05b8 */ float MaxTimeWindowMs;
    /* 0x05bc */ float TimeWindowMs;
    /* 0x05c0 */ float AnalysisPeriodMs;
    /* 0x05c4 */ bool bShowTimeGrid;
    /* 0x05c5 */ EXAxisLabelsUnit TimeGridLabelsUnit;
    /* 0x05c6 */ bool bShowAmplitudeGrid;
    /* 0x05c7 */ bool bShowAmplitudeLabels;
    /* 0x05c8 */ EYAxisLabelsUnit AmplitudeGridLabelsUnit;
    /* 0x05c9 */ EAudioOscilloscopeTriggerMode TriggerMode;
    /* 0x05cc */ float TriggerThreshold;
    /* 0x05d0 */ EAudioPanelLayoutType PanelLayoutType;
    /* 0x05d4 */ int32_t ChannelToAnalyze;

    bool CanTriggeringBeSet();
    TArray<float> GetOscilloscopeAudioSamples__DelegateSignature();
    void StartProcessing();
    void StopProcessing();
};

// Size: 0x440
struct FAudioOscilloscopePanelStyle : public FSlateWidgetStyle {
    /* 0x0010 */ FFixedSampleSequenceRulerStyle TimeRulerStyle;
    /* 0x0240 */ FSampledSequenceValueGridOverlayStyle ValueGridStyle;
    /* 0x02e0 */ FSampledSequenceViewerStyle WaveViewerStyle;
    /* 0x0420 */ FTriggerThresholdLineStyle TriggerThresholdLineStyle;
};

// Size: 0x360
class UAudioRadialSlider : public UWidget {
    /* 0x0168 */ float Value;
    /* 0x016c */ FDelegate ValueDelegate;
    /* 0x017c */ uint8_t WidgetLayout;
    /* 0x0180 */ FLinearColor CenterBackgroundColor;
    /* 0x0190 */ FLinearColor SliderProgressColor;
    /* 0x01a0 */ FLinearColor SliderBarColor;
    /* 0x01b0 */ FVector2D HandStartEndRatio;
    /* 0x01c0 */ FText UnitsText;
    /* 0x01d0 */ FLinearColor TextLabelBackgroundColor;
    /* 0x01e0 */ bool ShowLabelOnlyOnHover;
    /* 0x01e1 */ bool ShowUnitsText;
    /* 0x01e2 */ bool IsUnitsTextReadOnly;
    /* 0x01e3 */ bool IsValueTextReadOnly;
    /* 0x01e4 */ float SliderThickness;
    /* 0x01e8 */ FVector2D OutputRange;
    /* 0x01f8 */ FMulticastInlineDelegate OnValueChanged;

    float GetOutputValue(const float InSliderValue);
    float GetSliderValue(const float OutputValue);
    void SetCenterBackgroundColor(FLinearColor InValue);
    void SetHandStartEndRatio(const FVector2D InHandStartEndRatio);
    void SetOutputRange(const FVector2D InOutputRange);
    void SetShowLabelOnlyOnHover(const bool bShowLabelOnlyOnHover);
    void SetShowUnitsText(const bool bShowUnitsText);
    void SetSliderBarColor(FLinearColor InValue);
    void SetSliderProgressColor(FLinearColor InValue);
    void SetSliderThickness(const float InThickness);
    void SetTextLabelBackgroundColor(FSlateColor InColor);
    void SetUnitsText(const FText Units);
    void SetUnitsTextReadOnly(const bool bIsReadOnly);
    void SetValueTextReadOnly(const bool bIsReadOnly);
    void SetWidgetLayout(uint8_t InLayout);
};

// Size: 0x140
struct FAudioRadialSliderStyle : public FSlateWidgetStyle {
    /* 0x0010 */ FAudioTextBoxStyle TextBoxStyle;
    /* 0x00f0 */ FSlateColor CenterBackgroundColor;
    /* 0x0104 */ FSlateColor SliderBarColor;
    /* 0x0118 */ FSlateColor SliderProgressColor;
    /* 0x012c */ float LabelPadding;
    /* 0x0130 */ float DefaultSliderRadius;
};

// Size: 0x8c0
class UAudioSlider : public UAudioSliderBase {
    /* 0x08b0 */ TWeakObjectPtr<UCurveFloat> LinToOutputCurve;
    /* 0x08b8 */ TWeakObjectPtr<UCurveFloat> OutputToLinCurve;
};

// Size: 0x8b0
class UAudioSliderBase : public UWidget {
    /* 0x0168 */ float Value;
    /* 0x0170 */ FText UnitsText;
    /* 0x0180 */ FLinearColor TextLabelBackgroundColor;
    /* 0x0190 */ FDelegate TextLabelBackgroundColorDelegate;
    /* 0x01a0 */ bool ShowLabelOnlyOnHover;
    /* 0x01a1 */ bool ShowUnitsText;
    /* 0x01a2 */ bool IsUnitsTextReadOnly;
    /* 0x01a3 */ bool IsValueTextReadOnly;
    /* 0x01a4 */ FDelegate ValueDelegate;
    /* 0x01b4 */ FLinearColor SliderBackgroundColor;
    /* 0x01c4 */ FDelegate SliderBackgroundColorDelegate;
    /* 0x01d4 */ FLinearColor SliderBarColor;
    /* 0x01e4 */ FDelegate SliderBarColorDelegate;
    /* 0x01f4 */ FLinearColor SliderThumbColor;
    /* 0x0204 */ FDelegate SliderThumbColorDelegate;
    /* 0x0214 */ FLinearColor WidgetBackgroundColor;
    /* 0x0224 */ FDelegate WidgetBackgroundColorDelegate;
    /* 0x0234 */ uint8_t Orientation;
    /* 0x0238 */ FMulticastInlineDelegate OnValueChanged;

    float GetLinValue(const float OutputValue);
    float GetOutputValue(const float InSliderValue);
    float GetSliderValue(const float OutputValue);
    void SetShowLabelOnlyOnHover(const bool bShowLabelOnlyOnHover);
    void SetShowUnitsText(const bool bShowUnitsText);
    void SetSliderBackgroundColor(FLinearColor InValue);
    void SetSliderBarColor(FLinearColor InValue);
    void SetSliderThumbColor(FLinearColor InValue);
    void SetTextLabelBackgroundColor(FSlateColor InColor);
    void SetUnitsText(const FText Units);
    void SetUnitsTextReadOnly(const bool bIsReadOnly);
    void SetValueTextReadOnly(const bool bIsReadOnly);
    void SetWidgetBackgroundColor(FLinearColor InValue);
};

// Size: 0x650
struct FAudioSliderStyle : public FSlateWidgetStyle {
    /* 0x0010 */ FSliderStyle SliderStyle;
    /* 0x0450 */ FAudioTextBoxStyle TextBoxStyle;
    /* 0x0530 */ FSlateBrush WidgetBackgroundImage;
    /* 0x05e0 */ FSlateColor SliderBackgroundColor;
    /* 0x05f8 */ FVector2D SliderBackgroundSize;
    /* 0x0608 */ float LabelPadding;
    /* 0x060c */ FSlateColor SliderBarColor;
    /* 0x0620 */ FSlateColor SliderThumbColor;
    /* 0x0634 */ FSlateColor WidgetBackgroundColor;
};

// Size: 0x130
struct FAudioSpectrumPlotStyle : public FSlateWidgetStyle {
    /* 0x0008 */ FSlateColor BackgroundColor;
    /* 0x001c */ FSlateColor GridColor;
    /* 0x0030 */ FSlateColor AxisLabelColor;
    /* 0x0048 */ FSlateFontInfo AxisLabelFont;
    /* 0x00a8 */ FSlateColor SpectrumColor;
    /* 0x00bc */ FSlateColor CrosshairColor;
    /* 0x00d0 */ FSlateFontInfo CrosshairLabelFont;
};

// Size: 0xe0
struct FAudioTextBoxStyle : public FSlateWidgetStyle {
    /* 0x0010 */ FSlateBrush BackgroundImage;
    /* 0x00c0 */ FSlateColor BackgroundColor;
};

// Size: 0x380
class UAudioVectorscope : public UWidget {
    /* 0x0170 */ FAudioVectorscopePanelStyle VectorscopeStyle;
    /* 0x0310 */ UAudioBus* AudioBus;
    /* 0x0318 */ bool bShowGrid;
    /* 0x031c */ int32_t GridDivisions;
    /* 0x0320 */ float MaxDisplayPersistenceMs;
    /* 0x0324 */ float DisplayPersistenceMs;
    /* 0x0328 */ float Scale;
    /* 0x032c */ EAudioPanelLayoutType PanelLayoutType;

    TArray<float> GetVectorscopeAudioSamples__DelegateSignature();
    void StartProcessing();
    void StopProcessing();
};

// Size: 0x1a0
struct FAudioVectorscopePanelStyle : public FSlateWidgetStyle {
    /* 0x0008 */ FSampledSequenceValueGridOverlayStyle ValueGridStyle;
    /* 0x00b0 */ FSampledSequenceVectorViewerStyle VectorViewerStyle;
};

// Size: 0x360
class UAudioVolumeRadialSlider : public UAudioRadialSlider {
};

// Size: 0x8c0
class UAudioVolumeSlider : public UAudioSlider {
};

enum class EAudioColorGradient {
    BlackToWhite = 0,
    WhiteToBlack = 1,
    EAudioColorGradient_MAX = 2,
};

enum class EAudioMaterialEnvelopeType {
    AD = 0,
    ADSR = 1,
    EAudioMaterialEnvelopeType_MAX = 2,
};

enum class EAudioOscilloscopeTriggerMode {
    None = 0,
    Rising = 1,
    Falling = 2,
    EAudioOscilloscopeTriggerMode_MAX = 3,
};

enum class EAudioPanelLayoutType {
    Basic = 0,
    Advanced = 1,
    EAudioPanelLayoutType_MAX = 2,
};

enum class EAudioRadialSliderLayout {
    Layout_LabelTop = 0,
    Layout_LabelCenter = 1,
    Layout_LabelBottom = 2,
    Layout_MAX = 3,
};

enum class EAudioSpectrogramFrequencyAxisPixelBucketMode {
    Sample = 0,
    Peak = 1,
    Average = 2,
    EAudioSpectrogramFrequencyAxisPixelBucketMode_MAX = 3,
};

enum class EAudioSpectrogramFrequencyAxisScale {
    Linear = 0,
    Logarithmic = 1,
    EAudioSpectrogramFrequencyAxisScale_MAX = 2,
};

enum class EAudioSpectrumAnalyzerBallistics {
    Analog = 0,
    Digital = 1,
    EAudioSpectrumAnalyzerBallistics_MAX = 2,
};

enum class EAudioSpectrumAnalyzerType {
    FFT = 0,
    CQT = 1,
    EAudioSpectrumAnalyzerType_MAX = 2,
};

enum class EAudioSpectrumPlotFrequencyAxisPixelBucketMode {
    Sample = 0,
    Peak = 1,
    Average = 2,
    EAudioSpectrumPlotFrequencyAxisPixelBucketMode_MAX = 3,
};

enum class EAudioSpectrumPlotFrequencyAxisScale {
    Linear = 0,
    Logarithmic = 1,
    EAudioSpectrumPlotFrequencyAxisScale_MAX = 2,
};

enum class EAudioSpectrumPlotTilt {
    NoTilt = 0,
    Plus1_5dBPerOctave = 1,
    Plus3dBPerOctave = 2,
    Plus4_5dBPerOctave = 3,
    Plus6dBPerOctave = 4,
    EAudioSpectrumPlotTilt_MAX = 5,
};

enum class EAudioUnitsValueType {
    Linear = 0,
    Frequency = 1,
    Volume = 2,
    EAudioUnitsValueType_MAX = 3,
};

enum class EXAxisLabelsUnit {
    Samples = 0,
    Seconds = 1,
    EXAxisLabelsUnit_MAX = 2,
};

enum class EYAxisLabelsUnit {
    Linear = 0,
    Db = 1,
    EYAxisLabelsUnit_MAX = 2,
};

// Size: 0x230
struct FFixedSampleSequenceRulerStyle : public FSlateWidgetStyle {
    /* 0x0008 */ float HandleWidth;
    /* 0x000c */ FSlateColor HandleColor;
    /* 0x0020 */ FSlateBrush HandleBrush;
    /* 0x00d0 */ FSlateColor TicksColor;
    /* 0x00e4 */ FSlateColor TicksTextColor;
    /* 0x00f8 */ FSlateFontInfo TicksTextFont;
    /* 0x0158 */ float TicksTextOffset;
    /* 0x015c */ FSlateColor BackgroundColor;
    /* 0x0170 */ FSlateBrush BackgroundBrush;
    /* 0x0220 */ float DesiredWidth;
    /* 0x0224 */ float DesiredHeight;
};

// Size: 0xc
struct FMeterChannelInfo {
    /* 0x0000 */ float MeterValue;
    /* 0x0004 */ float PeakValue;
    /* 0x0008 */ float ClippingValue;
};

// Size: 0x28
struct FPlayheadOverlayStyle : public FSlateWidgetStyle {
    /* 0x0008 */ FSlateColor PlayheadColor;
    /* 0x001c */ float PlayheadWidth;
    /* 0x0020 */ float DesiredWidth;
    /* 0x0024 */ float DesiredHeight;
};

// Size: 0xa0
struct FSampledSequenceValueGridOverlayStyle : public FSlateWidgetStyle {
    /* 0x0008 */ FSlateColor GridColor;
    /* 0x001c */ float GridThickness;
    /* 0x0020 */ FSlateColor LabelTextColor;
    /* 0x0038 */ FSlateFontInfo LabelTextFont;
    /* 0x0098 */ float DesiredWidth;
    /* 0x009c */ float DesiredHeight;
};

// Size: 0xf0
struct FSampledSequenceVectorViewerStyle : public FSlateWidgetStyle {
    /* 0x0008 */ FSlateColor BackgroundColor;
    /* 0x0020 */ FSlateBrush BackgroundBrush;
    /* 0x00d0 */ FLinearColor LineColor;
    /* 0x00e0 */ float LineThickness;
};

// Size: 0x140
struct FSampledSequenceViewerStyle : public FSlateWidgetStyle {
    /* 0x0008 */ FSlateColor SequenceColor;
    /* 0x001c */ float SequenceLineThickness;
    /* 0x0020 */ FSlateColor MajorGridLineColor;
    /* 0x0034 */ FSlateColor MinorGridLineColor;
    /* 0x0048 */ FSlateColor ZeroCrossingLineColor;
    /* 0x005c */ float ZeroCrossingLineThickness;
    /* 0x0060 */ float SampleMarkersSize;
    /* 0x0064 */ FSlateColor SequenceBackgroundColor;
    /* 0x0080 */ FSlateBrush BackgroundBrush;
    /* 0x0130 */ float DesiredWidth;
    /* 0x0134 */ float DesiredHeight;
};

// Size: 0x7
struct FSpectrogramRackUnitSettings {
    /* 0x0000 */ EAudioSpectrumAnalyzerType AnalyzerType;
    /* 0x0001 */ EFFTSize FFTAnalyzerFFTSize;
    /* 0x0002 */ EConstantQFFTSizeEnum CQTAnalyzerFFTSize;
    /* 0x0003 */ EAudioSpectrogramFrequencyAxisPixelBucketMode PixelPlotMode;
    /* 0x0004 */ EAudioSpectrogramFrequencyAxisScale FrequencyScale;
    /* 0x0005 */ EAudioColorGradient ColorMap;
    /* 0x0006 */ uint8_t Orientation;
};

// Size: 0x9
struct FSpectrumAnalyzerRackUnitSettings {
    /* 0x0000 */ EAudioSpectrumAnalyzerBallistics Ballistics;
    /* 0x0001 */ EAudioSpectrumAnalyzerType AnalyzerType;
    /* 0x0002 */ EFFTSize FFTAnalyzerFFTSize;
    /* 0x0003 */ EConstantQFFTSizeEnum CQTAnalyzerFFTSize;
    /* 0x0004 */ EAudioSpectrumPlotTilt TiltSpectrum;
    /* 0x0005 */ EAudioSpectrumPlotFrequencyAxisPixelBucketMode PixelPlotMode;
    /* 0x0006 */ EAudioSpectrumPlotFrequencyAxisScale FrequencyScale;
    /* 0x0007 */ bool bDisplayFrequencyAxisLabels;
    /* 0x0008 */ bool bDisplaySoundLevelAxisLabels;
};

// Size: 0x18
struct FTriggerThresholdLineStyle : public FSlateWidgetStyle {
    /* 0x0008 */ FLinearColor LineColor;
};

// Size: 0x28
class UAutomationUtilsBlueprintLibrary : public UBlueprintFunctionLibrary {

    static void TakeGameplayAutomationScreenshot(const FString ScreenshotName, float MaxGlobalError, float MaxLocalError, FString MapNameOverride);
};

// Size: 0x120
class UBuildPatchManifest : public UObject {
    /* 0x0028 */ uint8_t ManifestFileVersion;
    /* 0x0029 */ bool bIsFileData;
    /* 0x002c */ uint32_t AppID;
    /* 0x0030 */ FString AppName;
    /* 0x0040 */ FString BuildVersion;
    /* 0x0050 */ FString LaunchExe;
    /* 0x0060 */ FString LaunchCommand;
    /* 0x0070 */ TSet<FString> PrereqIds;
    /* 0x00c0 */ FString PrereqName;
    /* 0x00d0 */ FString PrereqPath;
    /* 0x00e0 */ FString PrereqArgs;
    /* 0x00f0 */ TArray<FFileManifestData> FileManifestList;
    /* 0x0100 */ TArray<FChunkInfoData> ChunkList;
    /* 0x0110 */ TArray<FCustomFieldData> CustomFields;
};

// Size: 0x40
struct FChunkInfoData {
    /* 0x0000 */ FGuid Guid;
    /* 0x0010 */ uint64_t Hash;
    /* 0x0018 */ FSHAHashData ShaHash;
    /* 0x0030 */ int64_t FileSize;
    /* 0x0038 */ uint8_t GroupNumber;
};

// Size: 0x18
struct FChunkPartData {
    /* 0x0000 */ FGuid Guid;
    /* 0x0010 */ uint32_t Offset;
    /* 0x0014 */ uint32_t Size;
};

// Size: 0x20
struct FCustomFieldData {
    /* 0x0000 */ FString Key;
    /* 0x0010 */ FString Value;
};

// Size: 0x68
struct FFileManifestData {
    /* 0x0000 */ FString Filename;
    /* 0x0010 */ FSHAHashData FileHash;
    /* 0x0028 */ TArray<FChunkPartData> FileChunkParts;
    /* 0x0038 */ TArray<FString> InstallTags;
    /* 0x0048 */ bool bIsUnixExecutable;
    /* 0x0050 */ FString SymlinkTarget;
    /* 0x0060 */ bool bIsReadOnly;
    /* 0x0061 */ bool bIsCompressed;
};

// Size: 0x14
struct FSHAHashData {
    /* 0x0000 */ uint8_t Hash[20];
};

// Size: 0x2b0
class ACableActor : public AActor {
    /* 0x02a8 */ UCableComponent* CableComponent;
};

// Size: 0x740
class UCableComponent : public UMeshComponent {
    /* 0x0568 */ bool bAttachStart;
    /* 0x0569 */ bool bAttachEnd;
    /* 0x0570 */ FComponentReference AttachEndTo;
    /* 0x0598 */ FName AttachEndToSocketName;
    /* 0x05a0 */ FVector EndLocation;
    /* 0x05b8 */ float CableLength;
    /* 0x05bc */ int32_t NumSegments;
    /* 0x05c0 */ float SubstepTime;
    /* 0x05c4 */ int32_t SolverIterations;
    /* 0x05c8 */ bool bEnableStiffness;
    /* 0x05c9 */ bool bUseSubstepping;
    /* 0x05ca */ bool bSkipCableUpdateWhenNotVisible;
    /* 0x05cb */ bool bSkipCableUpdateWhenNotOwnerRecentlyRendered;
    /* 0x05cc */ bool bEnableCollision;
    /* 0x05d0 */ float CollisionFriction;
    /* 0x05d8 */ FVector CableForce;
    /* 0x05f0 */ float CableGravityScale;
    /* 0x05f4 */ float CableWidth;
    /* 0x05f8 */ int32_t NumSides;
    /* 0x05fc */ float TileMaterial;
    /* 0x0600 */ bool bResetAfterTeleport;
    /* 0x0604 */ float TeleportDistanceThreshold;
    /* 0x0608 */ float TeleportRotationThreshold;
    /* 0x060c */ bool bTeleportAfterReattach;

    AActor* GetAttachedActor() const;
    USceneComponent* GetAttachedComponent() const;
    void GetCableParticleLocations(TArray<FVector>& Locations) const;
    void SetAttachEndTo(AActor* Actor, FName ComponentProperty, FName SocketName);
    void SetAttachEndToComponent(USceneComponent* Component, FName SocketName);
};

// Size: 0x38
struct FAnamorphicDistortionParameters {
    /* 0x0000 */ float PixelAspect;
    /* 0x0004 */ float CX02;
    /* 0x0008 */ float CX04;
    /* 0x000c */ float CX22;
    /* 0x0010 */ float CX24;
    /* 0x0014 */ float CX44;
    /* 0x0018 */ float CY02;
    /* 0x001c */ float CY04;
    /* 0x0020 */ float CY22;
    /* 0x0024 */ float CY24;
    /* 0x0028 */ float CY44;
    /* 0x002c */ float SqueezeX;
    /* 0x0030 */ float SqueezeY;
    /* 0x0034 */ float LensRotation;
};

// Size: 0x108
class UAnamorphicLensDistortionModelHandler : public ULensDistortionModelHandlerBase {
};

// Size: 0x28
class UAnamorphicLensModel : public ULensModel {
};

// Size: 0x1
struct FBaseFocusCurve {
};

// Size: 0x8
struct FBaseFocusPoint {
};

// Size: 0x10
struct FBaseLensTable {
    /* 0x0008 */ TWeakObjectPtr<ULensFile> LensFile;
};

// Size: 0x3
struct FCalibratedMapFormat {
    /* 0x0000 */ ECalibratedMapPixelOrigin PixelOrigin;
    /* 0x0001 */ ECalibratedMapChannels UndistortionChannels;
    /* 0x0002 */ ECalibratedMapChannels DistortionChannels;
};

// Size: 0x650
class UCalibrationPointComponent : public UProceduralMeshComponent {
    /* 0x05e8 */ TMap<FString, FVector> SubPoints;
    /* 0x0638 */ bool bVisualizePointsInEditor;
    /* 0x063c */ float PointVisualizationScale;
    /* 0x0640 */ uint8_t VisualizationShape;

    void GetNamespacedPointNames(TArray<FString>& OutNamespacedNames) const;
    bool GetWorldLocation(FString InPointName, FVector& OutLocation) const;
    bool NamespacedSubpointName(FString InSubpointName, FString& OutNamespacedName) const;
    void RebuildVertices();
};

// Size: 0x300
class ACameraCalibrationCheckerboard : public AActor {
    /* 0x02a8 */ USceneComponent* Root;
    /* 0x02b0 */ UCalibrationPointComponent* TopLeft;
    /* 0x02b8 */ UCalibrationPointComponent* TopRight;
    /* 0x02c0 */ UCalibrationPointComponent* BottomLeft;
    /* 0x02c8 */ UCalibrationPointComponent* BottomRight;
    /* 0x02d0 */ UCalibrationPointComponent* Center;
    /* 0x02d8 */ int32_t NumCornerRows;
    /* 0x02dc */ int32_t NumCornerCols;
    /* 0x02e0 */ float SquareSideLength;
    /* 0x02e4 */ float Thickness;
    /* 0x02e8 */ UStaticMesh* CubeMesh;
    /* 0x02f0 */ UMaterialInterface* OddCubeMaterial;
    /* 0x02f8 */ UMaterialInterface* EvenCubeMaterial;

    void Rebuild();
};

// Size: 0x38
class UCameraCalibrationEditorSettings : public UDeveloperSettings {
};

// Size: 0x170
class UCameraCalibrationSettings : public UDeveloperSettings {
    /* 0x0038 */ TSoftObjectPtr<ULensFile> StartupLensFile;
    /* 0x0060 */ FIntPoint DisplacementMapResolution;
    /* 0x0068 */ float CalibrationInputTolerance;
    /* 0x006c */ float CheckerboardDetectionTimeout;
    /* 0x0070 */ TMap<UClass*, TSoftObjectPtr<UMaterialInterface>> DefaultUndistortionDisplacementMaterials;
    /* 0x00c0 */ TMap<UClass*, TSoftObjectPtr<UMaterialInterface>> DefaultDistortionDisplacementMaterials;
    /* 0x0110 */ TMap<UClass*, TSoftObjectPtr<UMaterialInterface>> DefaultDistortionMaterials;
    /* 0x0160 */ bool bEnableCalibrationDatasetImportExport;
};

// Size: 0x28
class UCameraCalibrationStep : public UObject {
};

// Size: 0x230
class UCameraCalibrationSubsystem : public UEngineSubsystem {
    /* 0x0030 */ ULensFile* DefaultLensFile;
    /* 0x0038 */ TMap<FName, UClass*> LensModelMap;
    /* 0x0088 */ TMap<FName, UClass*> CameraNodalOffsetAlgosMap;
    /* 0x00d8 */ TMap<FName, UClass*> CameraImageCenterAlgosMap;
    /* 0x0128 */ TMap<FName, UClass*> CameraCalibrationStepsMap;

    ULensDistortionModelHandlerBase* FindDistortionModelHandler(FDistortionHandlerPicker& DistortionHandlerPicker, bool bUpdatePicker) const;
    ULensDistortionModelHandlerBase* FindOrCreateDistortionModelHandler(FDistortionHandlerPicker& DistortionHandlerPicker, const UClass* LensModelClass);
    UClass* GetCameraCalibrationStep(FName Name) const;
    TArray<FName> GetCameraCalibrationSteps() const;
    UClass* GetCameraImageCenterAlgo(FName Name) const;
    TArray<FName> GetCameraImageCenterAlgos() const;
    UClass* GetCameraNodalOffsetAlgo(FName Name) const;
    TArray<FName> GetCameraNodalOffsetAlgos() const;
    ULensFile* GetDefaultLensFile() const;
    TArray<ULensDistortionModelHandlerBase*> GetDistortionModelHandlers(UCineCameraComponent* Component);
    ULensFile* GetLensFile(const FLensFilePicker& Picker) const;
    UMaterialInterface* GetOverlayMaterial(const FName& OverlayName) const;
    TArray<FName> GetOverlayMaterialNames() const;
    UClass* GetRegisteredLensModel(FName ModelName) const;
    void SetDefaultLensFile(ULensFile* NewDefaultLensFile);
    void UnregisterDistortionModelHandler(UCineCameraComponent* Component, ULensDistortionModelHandlerBase* handler);
};

// Size: 0x10
struct FCameraFeedInfo {
    /* 0x0000 */ FIntPoint Dimensions;
    /* 0x0008 */ float AspectRatio;
};

// Size: 0x30
class UCameraImageCenterAlgo : public UObject {
};

// Size: 0x28
class UCameraLensDistortionAlgo : public UObject {
};

// Size: 0x28
class UCameraNodalOffsetAlgo : public UObject {
};

// Size: 0x8
struct FDataTablePointInfoBase {
    /* 0x0000 */ float focus;
    /* 0x0004 */ float Zoom;
};

// Size: 0x30
struct FDerivedDistortionData {
    /* 0x0000 */ FDistortionData DistortionData;
    /* 0x0018 */ UTextureRenderTarget2D* UndistortionDisplacementMap;
    /* 0x0020 */ UTextureRenderTarget2D* DistortionDisplacementMap;
};

// Size: 0xc0
struct FDistortionCalibrationResult {
    /* 0x0000 */ float EvaluatedFocus;
    /* 0x0004 */ float EvaluatedZoom;
    /* 0x0008 */ double ReprojectionError;
    /* 0x0010 */ FFocalLengthInfo FocalLength;
    /* 0x0020 */ FImageCenterInfo ImageCenter;
    /* 0x0030 */ TArray<FTransform> CameraPoses;
    /* 0x0040 */ FNodalPointOffset NodalOffset;
    /* 0x0080 */ FDistortionInfo Parameters;
    /* 0x0090 */ FSTMapInfo STMap;
    /* 0x00a0 */ FString STMapFullPath;
    /* 0x00b0 */ FText ErrorMessage;
};

// Size: 0x18
struct FDistortionData {
    /* 0x0000 */ TArray<FVector2D> DistortedUVs;
    /* 0x0010 */ float OverscanFactor;
};

// Size: 0x88
struct FDistortionFocusCurve : public FBaseFocusCurve {
    /* 0x0000 */ FRichCurve MapBlendingCurve;
    /* 0x0080 */ float Zoom;
};

// Size: 0xa0
struct FDistortionFocusPoint : public FBaseFocusPoint {
    /* 0x0008 */ float focus;
    /* 0x0010 */ FRichCurve MapBlendingCurve;
    /* 0x0090 */ TArray<FDistortionZoomPoint> ZoomPoints;
};

// Size: 0x28
struct FDistortionHandlerPicker {
    /* 0x0000 */ UCineCameraComponent* TargetCameraComponent;
    /* 0x0008 */ FGuid DistortionProducerID;
    /* 0x0018 */ FString HandlerDisplayName;
};

// Size: 0x10
struct FDistortionInfo {
    /* 0x0000 */ TArray<float> Parameters;
};

// Size: 0x18
struct FDistortionPointInfo : public FDataTablePointInfoBase {
    /* 0x0008 */ FDistortionInfo DistortionInfo;
};

// Size: 0x30
struct FDistortionTable : public FBaseLensTable {
    /* 0x0010 */ TArray<FDistortionFocusPoint> FocusPoints;
    /* 0x0020 */ TArray<FDistortionFocusCurve> FocusCurves;
};

// Size: 0x18
struct FDistortionZoomPoint {
    /* 0x0000 */ float Zoom;
    /* 0x0008 */ FDistortionInfo DistortionInfo;
};

enum class ECalibratedMapChannels {
    RG = 0,
    BA = 1,
    None = 2,
    MAX = 3,
};

enum class ECalibratedMapPixelOrigin {
    TopLeft = 0,
    BottomLeft = 1,
    MAX = 2,
};

enum class ECalibrationPointVisualization {
    CalibrationPointVisualizationCube = 0,
    CalibrationPointVisualizationPyramid = 1,
    ECalibrationPointVisualization_MAX = 2,
};

enum class ELensDataCategory {
    Focus = 0,
    Iris = 1,
    Zoom = 2,
    Distortion = 3,
    ImageCenter = 4,
    STMap = 5,
    NodalOffset = 6,
    ELensDataCategory_MAX = 7,
};

enum class ELensDataMode {
    Parameters = 0,
    STMap = 1,
    ELensDataMode_MAX = 2,
};

enum class ELensDisplayUnit {
    Millimeters = 0,
    Pixels = 1,
    Normalized = 2,
    ELensDisplayUnit_MAX = 3,
};

// Size: 0x100
struct FEncodersTable {
    /* 0x0000 */ FRichCurve focus;
    /* 0x0080 */ FRichCurve Iris;
};

// Size: 0x108
struct FFocalLengthFocusCurve : public FBaseFocusCurve {
    /* 0x0000 */ FRichCurve Fx;
    /* 0x0080 */ FRichCurve Fy;
    /* 0x0100 */ float Zoom;
};

// Size: 0x120
struct FFocalLengthFocusPoint : public FBaseFocusPoint {
    /* 0x0008 */ float focus;
    /* 0x0010 */ FRichCurve Fx;
    /* 0x0090 */ FRichCurve Fy;
    /* 0x0110 */ TArray<FFocalLengthZoomPoint> ZoomPoints;
};

// Size: 0x10
struct FFocalLengthInfo {
    /* 0x0000 */ FVector2D FxFy;
};

// Size: 0x18
struct FFocalLengthPointInfo : public FDataTablePointInfoBase {
    /* 0x0008 */ FFocalLengthInfo FocalLengthInfo;
};

// Size: 0x30
struct FFocalLengthTable : public FBaseLensTable {
    /* 0x0010 */ TArray<FFocalLengthFocusPoint> FocusPoints;
    /* 0x0020 */ TArray<FFocalLengthFocusCurve> FocusCurves;
};

// Size: 0x20
struct FFocalLengthZoomPoint {
    /* 0x0000 */ float Zoom;
    /* 0x0008 */ FFocalLengthInfo FocalLengthInfo;
    /* 0x0018 */ bool bIsCalibrationPoint;
};

// Size: 0x108
struct FImageCenterFocusCurve : public FBaseFocusCurve {
    /* 0x0000 */ FRichCurve Cx;
    /* 0x0080 */ FRichCurve Cy;
    /* 0x0100 */ float Zoom;
};

// Size: 0x110
struct FImageCenterFocusPoint : public FBaseFocusPoint {
    /* 0x0008 */ float focus;
    /* 0x0010 */ FRichCurve Cx;
    /* 0x0090 */ FRichCurve Cy;
};

// Size: 0x10
struct FImageCenterInfo {
    /* 0x0000 */ FVector2D PrincipalPoint;
};

// Size: 0x18
struct FImageCenterPointInfo : public FDataTablePointInfoBase {
    /* 0x0008 */ FImageCenterInfo ImageCenterInfo;
};

// Size: 0x30
struct FImageCenterTable : public FBaseLensTable {
    /* 0x0010 */ TArray<FImageCenterFocusPoint> FocusPoints;
    /* 0x0020 */ TArray<FImageCenterFocusCurve> FocusCurves;
};

// Size: 0x1c
struct FLensDataCategoryEditorColor {
    /* 0x0000 */ FColor focus;
    /* 0x0004 */ FColor Iris;
    /* 0x0008 */ FColor Zoom;
    /* 0x000c */ FColor Distortion;
    /* 0x0010 */ FColor ImageCenter;
    /* 0x0014 */ FColor STMap;
    /* 0x0018 */ FColor NodalOffset;
};

// Size: 0xd0
class ULensDistortionModelHandlerBase : public UObject {
    /* 0x0028 */ UClass* LensModelClass;
    /* 0x0030 */ UMaterialInstanceDynamic* DistortionPostProcessMID;
    /* 0x0038 */ FLensDistortionState CurrentState;
    /* 0x0068 */ FCameraFilmbackSettings CameraFilmback;
    /* 0x0080 */ FString DisplayName;
    /* 0x0090 */ float OverscanFactor;
    /* 0x0098 */ UMaterialInstanceDynamic* UndistortionDisplacementMapMID;
    /* 0x00a0 */ UMaterialInstanceDynamic* DistortionDisplacementMapMID;
    /* 0x00a8 */ UTextureRenderTarget2D* UndistortionDisplacementMapRT;
    /* 0x00b0 */ UTextureRenderTarget2D* DistortionDisplacementMapRT;
    /* 0x00b8 */ FGuid DistortionProducerID;

    UTextureRenderTarget2D* GetDistortionDisplacementMap() const;
    UTextureRenderTarget2D* GetUndistortionDisplacementMap() const;
    bool IsModelSupported(const UClass*& ModelToSupport) const;
    void SetDistortionState(const FLensDistortionState& InNewState);
};

// Size: 0x30
struct FLensDistortionState {
    /* 0x0000 */ FDistortionInfo DistortionInfo;
    /* 0x0010 */ FFocalLengthInfo FocalLengthInfo;
    /* 0x0020 */ FImageCenterInfo ImageCenter;
};

// Size: 0x308
class ULensFile : public UObject {
    /* 0x0030 */ FLensInfo LensInfo;
    /* 0x0078 */ ELensDataMode DataMode;
    /* 0x0080 */ TMap<FString, FString> UserMetadata;
    /* 0x00d0 */ FEncodersTable EncodersTable;
    /* 0x01d0 */ FDistortionTable DistortionTable;
    /* 0x0200 */ FFocalLengthTable FocalLengthTable;
    /* 0x0230 */ FImageCenterTable ImageCenterTable;
    /* 0x0260 */ FNodalOffsetTable NodalOffsetTable;
    /* 0x0290 */ FSTMapTable STMapTable;
    /* 0x02d0 */ TArray<UTextureRenderTarget2D*> UndistortionDisplacementMapHolders;
    /* 0x02e0 */ TArray<UTextureRenderTarget2D*> DistortionDisplacementMapHolders;

    void AddDistortionPoint(float NewFocus, float NewZoom, const FDistortionInfo& NewPoint, const FFocalLengthInfo& NewFocalLength);
    void AddFocalLengthPoint(float NewFocus, float NewZoom, const FFocalLengthInfo& NewFocalLength);
    void AddImageCenterPoint(float NewFocus, float NewZoom, const FImageCenterInfo& NewPoint);
    void AddNodalOffsetPoint(float NewFocus, float NewZoom, const FNodalPointOffset& NewPoint);
    void AddSTMapPoint(float NewFocus, float NewZoom, const FSTMapInfo& NewPoint);
    void ChangeFocusPoint(ELensDataCategory InDataCategory, float InExistingFocus, float InNewFocus);
    void ChangeZoomPoint(ELensDataCategory InDataCategory, float InFocus, float InExistingZoom, float InNewZoom);
    void ClearAll();
    void ClearData(ELensDataCategory InDataCategory);
    bool EvaluateDistortionData(float InFocus, float InZoom, FVector2D InFilmback, ULensDistortionModelHandlerBase* InLensHandler) const;
    bool EvaluateDistortionParameters(float InFocus, float InZoom, FDistortionInfo& OutEvaluatedValue) const;
    bool EvaluateFocalLength(float InFocus, float InZoom, FFocalLengthInfo& OutEvaluatedValue) const;
    bool EvaluateImageCenterParameters(float InFocus, float InZoom, FImageCenterInfo& OutEvaluatedValue) const;
    bool EvaluateNodalPointOffset(float InFocus, float InZoom, FNodalPointOffset& OutEvaluatedValue) const;
    float EvaluateNormalizedFocus(float InNormalizedValue) const;
    float EvaluateNormalizedIris(float InNormalizedValue) const;
    bool GetDistortionPoint(float InFocus, float InZoom, FDistortionInfo& OutDistortionInfo) const;
    TArray<FDistortionPointInfo> GetDistortionPoints() const;
    bool GetFocalLengthPoint(float InFocus, float InZoom, FFocalLengthInfo& OutFocalLengthInfo) const;
    TArray<FFocalLengthPointInfo> GetFocalLengthPoints() const;
    bool GetImageCenterPoint(float InFocus, float InZoom, FImageCenterInfo& OutImageCenterInfo) const;
    TArray<FImageCenterPointInfo> GetImageCenterPoints() const;
    bool GetNodalOffsetPoint(float InFocus, float InZoom, FNodalPointOffset& OutNodalPointOffset) const;
    TArray<FNodalOffsetPointInfo> GetNodalOffsetPoints() const;
    bool GetSTMapPoint(float InFocus, float InZoom, FSTMapInfo& OutSTMapInfo) const;
    TArray<FSTMapPointInfo> GetSTMapPoints() const;
    int32_t GetTotalPointNum(ELensDataCategory InDataCategory) const;
    bool HasFocusEncoderMapping() const;
    bool HasFocusPoint(ELensDataCategory InDataCategory, float InFocus) const;
    bool HasIrisEncoderMapping() const;
    bool HasSamples(ELensDataCategory InDataCategory) const;
    bool HasZoomPoint(ELensDataCategory InDataCategory, float InFocus, float InZoom);
    void MergeFocusPoint(ELensDataCategory InDataCategory, float InSrcFocus, float InDestFocus, bool bReplaceExistingZoomPoints);
    void RemoveFocusPoint(ELensDataCategory InDataCategory, float InFocus);
    void RemoveZoomPoint(ELensDataCategory InDataCategory, float InFocus, float InZoom);
};

// Size: 0x24
struct FLensFileEvaluationInputs {
    /* 0x0000 */ float focus;
    /* 0x0004 */ float Iris;
    /* 0x0008 */ float Zoom;
    /* 0x000c */ FCameraFilmbackSettings Filmback;
    /* 0x0020 */ bool bIsValid;
};

// Size: 0x10
struct FLensFilePicker {
    /* 0x0000 */ bool bUseDefaultLensFile;
    /* 0x0008 */ ULensFile* LensFile;
};

// Size: 0x48
struct FLensInfo {
    /* 0x0000 */ FString LensModelName;
    /* 0x0010 */ FString LensSerialNumber;
    /* 0x0020 */ UClass* LensModel;
    /* 0x0028 */ FVector2D SensorDimensions;
    /* 0x0038 */ FIntPoint ImageDimensions;
    /* 0x0040 */ float SqueezeFactor;
};

// Size: 0x28
class ULensModel : public UObject {
};

// Size: 0x308
struct FNodalOffsetFocusCurve : public FBaseFocusCurve {
    /* 0x0000 */ FRichCurve LocationOffset[3];
    /* 0x0180 */ FRichCurve RotationOffset[3];
    /* 0x0300 */ float Zoom;
};

// Size: 0x310
struct FNodalOffsetFocusPoint : public FBaseFocusPoint {
    /* 0x0008 */ float focus;
    /* 0x0010 */ FRichCurve LocationOffset[3];
    /* 0x0190 */ FRichCurve RotationOffset[3];
};

// Size: 0x50
struct FNodalOffsetPointInfo : public FDataTablePointInfoBase {
    /* 0x0010 */ FNodalPointOffset NodalPointOffset;
};

// Size: 0x30
struct FNodalOffsetTable : public FBaseLensTable {
    /* 0x0010 */ TArray<FNodalOffsetFocusPoint> FocusPoints;
    /* 0x0020 */ TArray<FNodalOffsetFocusCurve> FocusCurves;
};

// Size: 0x40
struct FNodalPointOffset {
    /* 0x0000 */ FVector LocationOffset;
    /* 0x0020 */ FQuat RotationOffset;
};

// Size: 0x88
struct FSTMapFocusCurve : public FBaseFocusCurve {
    /* 0x0000 */ FRichCurve MapBlendingCurve;
    /* 0x0080 */ float Zoom;
};

// Size: 0xa0
struct FSTMapFocusPoint : public FBaseFocusPoint {
    /* 0x0008 */ float focus;
    /* 0x0010 */ FRichCurve MapBlendingCurve;
    /* 0x0090 */ TArray<FSTMapZoomPoint> ZoomPoints;
};

// Size: 0x10
struct FSTMapInfo {
    /* 0x0000 */ UTexture* DistortionMap;
    /* 0x0008 */ FCalibratedMapFormat MapFormat;
};

// Size: 0x18
struct FSTMapPointInfo : public FDataTablePointInfoBase {
    /* 0x0008 */ FSTMapInfo STMapInfo;
};

// Size: 0x30
struct FSTMapTable : public FBaseLensTable {
    /* 0x0010 */ TArray<FSTMapFocusPoint> FocusPoints;
    /* 0x0020 */ TArray<FSTMapFocusCurve> FocusCurves;
};

// Size: 0x50
struct FSTMapZoomPoint {
    /* 0x0000 */ float Zoom;
    /* 0x0008 */ FSTMapInfo STMapInfo;
    /* 0x0018 */ FDerivedDistortionData DerivedDistortionData;
    /* 0x0048 */ bool bIsCalibrationPoint;
};

// Size: 0x10
struct FSimulcamInfo {
    /* 0x0000 */ FIntPoint MediaResolution;
    /* 0x0008 */ float MediaPlateAspectRatio;
    /* 0x000c */ float CGLayerAspectRatio;
};

// Size: 0x14
struct FSphericalDistortionParameters {
    /* 0x0000 */ float K1;
    /* 0x0004 */ float K2;
    /* 0x0008 */ float K3;
    /* 0x000c */ float P1;
    /* 0x0010 */ float P2;
};

// Size: 0xe8
class USphericalLensDistortionModelHandler : public ULensDistortionModelHandlerBase {
};

// Size: 0x28
class USphericalLensModel : public ULensModel {
};

enum class ChaosDeformableSimSpace {
    World = 0,
    ComponentXf = 1,
    bone = 2,
    ChaosDeformableSimSpace_MAX = 3,
};

// Size: 0x84
struct FChaosSolverConfiguration {
    /* 0x0000 */ int32_t PositionIterations;
    /* 0x0004 */ int32_t VelocityIterations;
    /* 0x0008 */ int32_t ProjectionIterations;
    /* 0x000c */ float CollisionMarginFraction;
    /* 0x0010 */ float CollisionMarginMax;
    /* 0x0014 */ float CollisionCullDistance;
    /* 0x0018 */ float CollisionMaxPushOutVelocity;
    /* 0x001c */ float CollisionInitialOverlapDepenetrationVelocity;
    /* 0x0020 */ float ClusterConnectionFactor;
    /* 0x0024 */ EClusterUnionMethod ClusterUnionConnectionType;
    /* 0x0028 */ FChaosSolverDestructionSettings DestructionSettings;
    /* 0x003c */ bool bGenerateCollisionData;
    /* 0x0040 */ FSolverCollisionFilterSettings CollisionFilterSettings;
    /* 0x0050 */ bool bGenerateBreakData;
    /* 0x0054 */ FSolverBreakingFilterSettings BreakingFilterSettings;
    /* 0x0064 */ bool bGenerateTrailingData;
    /* 0x0068 */ FSolverTrailingFilterSettings TrailingFilterSettings;
    /* 0x0078 */ int32_t Iterations;
    /* 0x007c */ int32_t PushOutIterations;
    /* 0x0080 */ bool bGenerateContactGraph;
};

// Size: 0x14
struct FChaosSolverDestructionSettings {
    /* 0x0000 */ int32_t PerAdvanceBreaksAllowed;
    /* 0x0004 */ int32_t PerAdvanceBreaksRescheduleLimit;
    /* 0x0008 */ int32_t ClusteringParticleReleaseThrottlingMinCount;
    /* 0x000c */ int32_t ClusteringParticleReleaseThrottlingMaxCount;
    /* 0x0010 */ bool bOptimizeForRuntimeMemory;
};

// Size: 0x28
struct FClosestPhysicsObjectResult {
};

enum class EAllowConvexMergeMethod {
    ByProximity = 0,
    Any = 1,
    EAllowConvexMergeMethod_MAX = 2,
};

enum class EChaosBufferMode {
    Double = 0,
    Triple = 1,
    Num = 2,
    Invalid = 3,
    EChaosBufferMode_MAX = 4,
};

enum class EChaosSoftsSimulationSpace {
    WorldSpace = 0,
    ComponentSpace = 1,
    ReferenceBoneSpace = 2,
    EChaosSoftsSimulationSpace_MAX = 3,
};

enum class EChaosSolverTickMode {
    Fixed = 0,
    Variable = 1,
    VariableCapped = 2,
    VariableCappedWithTarget = 3,
    EChaosSolverTickMode_MAX = 4,
};

enum class EChaosThreadingMode {
    DedicatedThread = 0,
    TaskGraph = 1,
    SingleThread = 2,
    Num = 3,
    Invalid = 4,
    EChaosThreadingMode_MAX = 5,
};

enum class EClusterUnionMethod {
    PointImplicit = 0,
    DelaunayTriangulation = 1,
    MinimalSpanningSubsetDelaunayTriangulation = 2,
    PointImplicitAugmentedWithMinimalDelaunay = 3,
    BoundsOverlapFilteredDelaunayTriangulation = 4,
    None = 5,
    EClusterUnionMethod_MAX = 6,
};

enum class ECollisionTypeEnum {
    Chaos_Volumetric = 0,
    Chaos_Surface_Volumetric = 1,
    Chaos_Max = 2,
};

enum class EConnectionContactMethod {
    None = 0,
    ConvexHullContactArea = 1,
    EConnectionContactMethod_MAX = 2,
};

enum class EConvexHullProximityFilter {
    None = 0,
    BoundingBox = 1,
    EConvexHullProximityFilter_MAX = 2,
};

enum class EConvexOverlapRemoval {
    None = 0,
    All = 1,
    OnlyClusters = 2,
    OnlyClustersVsClusters = 3,
    EConvexOverlapRemoval_MAX = 4,
};

enum class EDamageModelTypeEnum {
    Chaos_Damage_Model_UserDefined_Damage_Threshold = 0,
    Chaos_Damage_Model_Material_Strength_And_Connectivity_DamageThreshold = 1,
    Chaos_Max = 2,
};

enum class EEmissionPatternTypeEnum {
    Chaos_Emission_Pattern_First_Frame = 0,
    Chaos_Emission_Pattern_On_Demand = 1,
    Chaos_Max = 2,
};

enum class EFieldCullingOperationType {
    Field_Culling_Inside = 0,
    Field_Culling_Outside = 1,
    Field_Culling_Operation_Max = 2,
    Field_Culling_MAX = 3,
};

enum class EFieldFalloffType {
    Field_FallOff_None = 0,
    Field_Falloff_Linear = 1,
    Field_Falloff_Inverse = 2,
    Field_Falloff_Squared = 3,
    Field_Falloff_Logarithmic = 4,
    Field_Falloff_Max = 5,
};

enum class EFieldFilterType {
    Field_Filter_Dynamic = 0,
    Field_Filter_Kinematic = 1,
    Field_Filter_Static = 2,
    Field_Filter_All = 3,
    Field_Filter_Sleeping = 4,
    Field_Filter_Disabled = 5,
    Field_Filter_Max = 6,
};

enum class EFieldIntegerType {
    Integer_DynamicState = 0,
    Integer_ActivateDisabled = 1,
    Integer_CollisionGroup = 2,
    Integer_PositionAnimated = 3,
    Integer_PositionStatic = 4,
    Integer_TargetMax = 5,
    Integer_MAX = 6,
};

enum class EFieldObjectType {
    Field_Object_Rigid = 0,
    Field_Object_Cloth = 1,
    Field_Object_Destruction = 2,
    Field_Object_Character = 3,
    Field_Object_All = 4,
    Field_Object_Max = 5,
};

enum class EFieldOperationType {
    Field_Multiply = 0,
    Field_Divide = 1,
    Field_Add = 2,
    Field_Substract = 3,
    Field_Operation_Max = 4,
};

enum class EFieldOutputType {
    Field_Output_Vector = 0,
    Field_Output_Scalar = 1,
    Field_Output_Integer = 2,
    Field_Output_Max = 3,
};

enum class EFieldPhysicsDefaultFields {
    Field_RadialIntMask = 0,
    Field_RadialFalloff = 1,
    Field_UniformVector = 2,
    Field_RadialVector = 3,
    Field_RadialVectorFalloff = 4,
    Field_EFieldPhysicsDefaultFields_Max = 5,
};

enum class EFieldPhysicsType {
    Field_None = 0,
    Field_DynamicState = 1,
    Field_LinearForce = 2,
    Field_ExternalClusterStrain = 3,
    Field_Kill = 4,
    Field_LinearVelocity = 5,
    Field_AngularVelociy = 6,
    Field_AngularTorque = 7,
    Field_InternalClusterStrain = 8,
    Field_DisableThreshold = 9,
    Field_SleepingThreshold = 10,
    Field_PositionStatic = 11,
    Field_PositionAnimated = 12,
    Field_PositionTarget = 13,
    Field_DynamicConstraint = 14,
    Field_CollisionGroup = 15,
    Field_ActivateDisabled = 16,
    Field_InitialLinearVelocity = 17,
    Field_InitialAngularVelocity = 18,
    Field_LinearImpulse = 19,
    Field_PhysicsType_Max = 20,
};

enum class EFieldPositionType {
    Field_Position_CenterOfMass = 0,
    Field_Position_PivotPoint = 1,
    Field_Position_Max = 2,
};

enum class EFieldResolutionType {
    Field_Resolution_Minimal = 0,
    Field_Resolution_DisabledParents = 1,
    Field_Resolution_Maximum = 2,
    Field_Resolution_Max = 3,
};

enum class EFieldScalarType {
    Scalar_ExternalClusterStrain = 0,
    Scalar_Kill = 1,
    Scalar_DisableThreshold = 2,
    Scalar_SleepingThreshold = 3,
    Scalar_InternalClusterStrain = 4,
    Scalar_DynamicConstraint = 5,
    Scalar_TargetMax = 6,
    Scalar_MAX = 7,
};

enum class EFieldVectorType {
    Vector_LinearForce = 0,
    Vector_LinearVelocity = 1,
    Vector_AngularVelocity = 2,
    Vector_AngularTorque = 3,
    Vector_PositionTarget = 4,
    Vector_InitialLinearVelocity = 5,
    Vector_InitialAngularVelocity = 6,
    Vector_LinearImpulse = 7,
    Vector_TargetMax = 8,
    Vector_MAX = 9,
};

enum class EGenerateConvexMethod {
    ExternalCollision = 0,
    ComputedFromGeometry = 1,
    IntersectExternalWithComputed = 2,
    EGenerateConvexMethod_MAX = 3,
};

enum class EGeometryCollectionCacheType {
    None = 0,
    Record = 1,
    Play = 2,
    RecordAndPlay = 3,
    EGeometryCollectionCacheType_MAX = 4,
};

enum class EGeometryCollectionPhysicsTypeEnum {
    Chaos_AngularVelocity = 0,
    Chaos_DynamicState = 1,
    Chaos_LinearVelocity = 2,
    Chaos_InitialAngularVelocity = 3,
    Chaos_InitialLinearVelocity = 4,
    Chaos_CollisionGroup = 5,
    Chaos_LinearForce = 6,
    Chaos_AngularTorque = 7,
    Chaos_DisableThreshold = 8,
    Chaos_SleepingThreshold = 9,
    Chaos_ExternalClusterStrain = 10,
    Chaos_InternalClusterStrain = 11,
    Chaos_LinearImpulse = 12,
    Chaos_Max = 13,
};

enum class EImplicitTypeEnum {
    Chaos_Implicit_Box = 0,
    Chaos_Implicit_Sphere = 1,
    Chaos_Implicit_Capsule = 2,
    Chaos_Implicit_LevelSet = 3,
    Chaos_Implicit_None = 4,
    Chaos_Implicit_Convex = 5,
    Chaos_Max = 6,
};

enum class EInitialVelocityTypeEnum {
    Chaos_Initial_Velocity_User_Defined = 0,
    Chaos_Initial_Velocity_None = 1,
    Chaos_Max = 2,
};

enum class EObjectStateTypeEnum {
    Chaos_NONE = 0,
    Chaos_Object_Sleeping = 1,
    Chaos_Object_Kinematic = 2,
    Chaos_Object_Static = 3,
    Chaos_Object_Dynamic = 4,
    Chaos_Object_UserDefined = 100,
    Chaos_Max = 101,
};

enum class EProximityContactMethod {
    MinOverlapInProjectionToMajorAxes = 0,
    ConvexHullSharpContact = 1,
    ConvexHullAreaContact = 2,
    EProximityContactMethod_MAX = 3,
};

enum class EProximityMethod {
    Precise = 0,
    ConvexHull = 1,
    EProximityMethod_MAX = 2,
};

enum class ESetMaskConditionType {
    Field_Set_Always = 0,
    Field_Set_IFF_NOT_Interior = 1,
    Field_Set_IFF_NOT_Exterior = 2,
    Field_MaskCondition_Max = 3,
    Field_MAX = 4,
};

enum class EWaveFunctionType {
    Field_Wave_Cosine = 0,
    Field_Wave_Gaussian = 1,
    Field_Wave_Falloff = 2,
    Field_Wave_Decay = 3,
    Field_Wave_Max = 4,
};

// Size: 0xb0
struct FFieldCollection : public FManagedArrayCollection {
};

// Size: 0xb0
struct FManagedArrayCollection {
};

// Size: 0xb8
struct FRecordedFrame {
    /* 0x0000 */ TArray<FTransform> Transforms;
    /* 0x0010 */ TArray<int32_t> TransformIndices;
    /* 0x0020 */ TArray<int32_t> PreviousTransformIndices;
    /* 0x0030 */ TArray<bool> DisabledFlags;
    /* 0x0040 */ TArray<FSolverCollisionData> Collisions;
    /* 0x0050 */ TArray<FSolverBreakingData> Breakings;
    /* 0x0060 */ TSet<FSolverTrailingData> Trailings;
    /* 0x00b0 */ float Timestamp;
};

// Size: 0x10
struct FRecordedTransformTrack {
    /* 0x0000 */ TArray<FRecordedFrame> Records;
};

// Size: 0x50
struct FSerializedSolverScene {
    /* 0x0000 */ TArray<FChaosVDParticleDataWrapper> ParticleData;
    /* 0x0010 */ TArray<FChaosVDJointConstraint> JointConstraintData;
    /* 0x0020 */ TArray<FChaosVDCharacterGroundConstraint> CharacterGroundConstraintData;
    /* 0x0030 */ TArray<FChaosVDParticlePairMidPhase> CollisionMidPhaseData;
};

// Size: 0x58
struct FSolverBreakingData {
    /* 0x0000 */ FVector Location;
    /* 0x0018 */ FVector Velocity;
    /* 0x0030 */ FVector AngularVelocity;
    /* 0x0048 */ float Mass;
    /* 0x004c */ int32_t ParticleIndex;
    /* 0x0050 */ int32_t ParticleIndexMesh;
};

// Size: 0x10
struct FSolverBreakingFilterSettings {
    /* 0x0000 */ bool FilterEnabled;
    /* 0x0004 */ float MinMass;
    /* 0x0008 */ float MinSpeed;
    /* 0x000c */ float MinVolume;
};

// Size: 0xc0
struct FSolverCollisionData {
    /* 0x0000 */ FVector Location;
    /* 0x0018 */ FVector AccumulatedImpulse;
    /* 0x0030 */ FVector Normal;
    /* 0x0048 */ FVector Velocity1;
    /* 0x0060 */ FVector Velocity2;
    /* 0x0078 */ FVector AngularVelocity1;
    /* 0x0090 */ FVector AngularVelocity2;
    /* 0x00a8 */ float Mass1;
    /* 0x00ac */ float Mass2;
    /* 0x00b0 */ int32_t ParticleIndex;
    /* 0x00b4 */ int32_t LevelsetIndex;
    /* 0x00b8 */ int32_t ParticleIndexMesh;
    /* 0x00bc */ int32_t LevelsetIndexMesh;
};

// Size: 0x10
struct FSolverCollisionFilterSettings {
    /* 0x0000 */ bool FilterEnabled;
    /* 0x0004 */ float MinMass;
    /* 0x0008 */ float MinSpeed;
    /* 0x000c */ float MinImpulse;
};

// Size: 0xc
struct FSolverRemovalFilterSettings {
    /* 0x0000 */ bool FilterEnabled;
    /* 0x0004 */ float MinMass;
    /* 0x0008 */ float MinVolume;
};

// Size: 0x58
struct FSolverTrailingData {
    /* 0x0000 */ FVector Location;
    /* 0x0018 */ FVector Velocity;
    /* 0x0030 */ FVector AngularVelocity;
    /* 0x0048 */ float Mass;
    /* 0x004c */ int32_t ParticleIndex;
    /* 0x0050 */ int32_t ParticleIndexMesh;
};

// Size: 0x10
struct FSolverTrailingFilterSettings {
    /* 0x0000 */ bool FilterEnabled;
    /* 0x0004 */ float MinMass;
    /* 0x0008 */ float MinSpeed;
    /* 0x000c */ float MinVolume;
};

// Size: 0xc0
struct FBreakingEvent : public FCacheEventBase {
    /* 0x0008 */ int32_t Index;
    /* 0x0010 */ FVector Location;
    /* 0x0030 */ FQuat Orientation;
    /* 0x0050 */ FVector Velocity;
    /* 0x0068 */ FVector AngularVelocity;
    /* 0x0080 */ float Mass;
    /* 0x0088 */ FVector BoundingBoxMin;
    /* 0x00a0 */ FVector BoundingBoxMax;
};

// Size: 0x8
struct FCacheEventBase {
};

// Size: 0x38
struct FCacheEventTrack {
    /* 0x0000 */ FName Name;
    /* 0x0008 */ UScriptStruct* Struct;
    /* 0x0010 */ TArray<float> TimeStamps;
};

// Size: 0xd0
struct FCacheSpawnableTemplate {
    /* 0x0000 */ UObject* DuplicatedTemplate;
    /* 0x0010 */ FTransform InitialTransform;
    /* 0x0070 */ FTransform ComponentTransform;
};

// Size: 0x390
class UChaosCache : public UObject {
    /* 0x0028 */ float RecordedDuration;
    /* 0x002c */ uint32_t NumRecordedFrames;
    /* 0x0030 */ EChaosCacheInterpolationMode InterpolationMode;
    /* 0x0038 */ TArray<int32_t> TrackToParticle;
    /* 0x0048 */ TArray<FPerParticleCacheData> ParticleTracks;
    /* 0x0058 */ TArray<int32_t> ChannelCurveToParticle;
    /* 0x0068 */ TMap<FName, FRichCurves> ChannelsTracks;
    /* 0x00b8 */ TMap<FName, FCompressedRichCurves> CompressedChannelsTracks;
    /* 0x0108 */ TMap<FName, FRichCurve> CurveData;
    /* 0x0158 */ TMap<FName, FParticleTransformTrack> NamedTransformTracks;
    /* 0x01a8 */ bool bCompressChannels;
    /* 0x01ac */ float ChannelsCompressionErrorThreshold;
    /* 0x01b0 */ float ChannelsCompressionSampleRate;
    /* 0x01b8 */ TScriptInterface<IChaosCacheData> CacheData;
    /* 0x01c8 */ TMap<FName, FCacheEventTrack> EventTracks;
    /* 0x0220 */ FCacheSpawnableTemplate Spawnable;
    /* 0x02f0 */ FGuid AdapterGuid;
    /* 0x0300 */ int32_t Version;
};

// Size: 0x40
class UChaosCacheCollection : public UObject {
    /* 0x0028 */ TArray<UChaosCache*> Caches;
    /* 0x0038 */ EChaosCacheInterpolationMode InterpolationMode;
};

// Size: 0x28
class IChaosCacheData : public UInterface {
};

// Size: 0x360
class AChaosCacheManager : public AActor {
    /* 0x02a8 */ UChaosCacheCollection* CacheCollection;
    /* 0x02b0 */ ECacheMode CacheMode;
    /* 0x02b1 */ EStartMode StartMode;
    /* 0x02b4 */ float StartTime;
    /* 0x02c0 */ TArray<FObservedComponent> ObservedComponents;

    void EnablePlayback(int32_t Index, bool bEnable);
    void EnablePlaybackByCache(FName InCacheName, bool bEnable);
    void ResetAllComponentTransforms();
    void ResetSingleTransform(int32_t InIndex);
    void SetCacheCollection(UChaosCacheCollection* InCacheCollection);
    void SetCurrentTime(float CurrentTime);
    void SetStartTime(float InStartTime);
    void TriggerAll();
    void TriggerComponent(UPrimitiveComponent* InComponent);
    void TriggerComponentByCache(FName InCacheName);
};

// Size: 0x360
class AChaosCachePlayer : public AChaosCacheManager {
};

// Size: 0xf0
struct FCollisionEvent : public FCacheEventBase {
    /* 0x0008 */ FVector Location;
    /* 0x0020 */ FVector AccumulatedImpulse;
    /* 0x0038 */ FVector Normal;
    /* 0x0050 */ FVector Velocity1;
    /* 0x0068 */ FVector Velocity2;
    /* 0x0080 */ FVector DeltaVelocity1;
    /* 0x0098 */ FVector DeltaVelocity2;
    /* 0x00b0 */ FVector AngularVelocity1;
    /* 0x00c8 */ FVector AngularVelocity2;
    /* 0x00e0 */ float Mass1;
    /* 0x00e4 */ float Mass2;
    /* 0x00e8 */ float PenetrationDepth;
};

// Size: 0x10
struct FCompressedRichCurves {
    /* 0x0000 */ TArray<FCompressedRichCurve> CompressedRichCurves;
};

enum class ECacheMode {
    None = 0,
    Play = 1,
    Record = 2,
    ECacheMode_MAX = 3,
};

enum class EChaosCacheInterpolationMode {
    QuatInterp = 0,
    EulerInterp = 1,
    DualQuatInterp = 2,
    EChaosCacheInterpolationMode_MAX = 3,
};

enum class EStartMode {
    Timed = 0,
    Triggered = 1,
    EStartMode_MAX = 2,
};

// Size: 0x10
struct FEnableStateEvent : public FCacheEventBase {
    /* 0x0008 */ int32_t Index;
    /* 0x000c */ bool bEnable;
};

// Size: 0x28
struct FMovieSceneChaosCacheParams : public FMovieSceneBaseCacheParams {
    /* 0x0020 */ UChaosCacheCollection* CacheCollection;
};

// Size: 0x138
class UMovieSceneChaosCacheSection : public UMovieSceneBaseCacheSection {
    /* 0x0110 */ FMovieSceneChaosCacheParams Params;
};

// Size: 0x50
struct FMovieSceneChaosCacheSectionTemplate : public FMovieSceneEvalTemplate {
    /* 0x0020 */ FMovieSceneChaosCacheSectionTemplateParameters Params;
};

// Size: 0x30
struct FMovieSceneChaosCacheSectionTemplateParameters : public FMovieSceneBaseCacheSectionTemplateParameters {
    /* 0x0008 */ FMovieSceneChaosCacheParams ChaosCacheParams;
};

// Size: 0x128
class UMovieSceneChaosCacheTrack : public UMovieSceneNameableTrack {
    /* 0x0118 */ TArray<UMovieSceneSection*> AnimationSections;
};

// Size: 0x48
class UMovieSceneSpawnableChaosCacheBinding : public UMovieSceneSpawnableActorBinding {
};

// Size: 0x180
struct FObservedComponent {
    /* 0x0000 */ FName CacheName;
    /* 0x0008 */ FComponentReference ComponentRef;
    /* 0x0030 */ FSoftComponentReference SoftComponentRef;
    /* 0x0078 */ bool bIsSimulating;
    /* 0x0079 */ bool bPlaybackEnabled;
    /* 0x0080 */ FDirectoryPath USDCacheDirectory;
};

// Size: 0x48
struct FParticleTransformTrack {
    /* 0x0000 */ FRawAnimSequenceTrack RawTransformTrack;
    /* 0x0030 */ float BeginOffset;
    /* 0x0034 */ bool bDeactivateOnEnd;
    /* 0x0038 */ TArray<float> KeyTimestamps;
};

// Size: 0x98
struct FPerParticleCacheData {
    /* 0x0000 */ FParticleTransformTrack TransformData;
    /* 0x0048 */ TMap<FName, FRichCurve> CurveData;
};

// Size: 0x10
struct FRichCurves {
    /* 0x0000 */ TArray<FRichCurve> RichCurves;
};

// Size: 0xb0
struct FTrailingEvent : public FCacheEventBase {
    /* 0x0008 */ int32_t Index;
    /* 0x0010 */ FVector Location;
    /* 0x0030 */ FQuat Orientation;
    /* 0x0050 */ FVector Velocity;
    /* 0x0068 */ FVector AngularVelocity;
    /* 0x0080 */ FVector BoundingBoxMin;
    /* 0x0098 */ FVector BoundingBoxMax;
};

// Size: 0x180
class UChaosClothConfig : public UClothConfigCommon {
    /* 0x0028 */ EClothMassMode MassMode;
    /* 0x002c */ float UniformMass;
    /* 0x0030 */ float TotalMass;
    /* 0x0034 */ float Density;
    /* 0x0038 */ float MinPerParticleMass;
    /* 0x003c */ FChaosClothWeightedValue EdgeStiffnessWeighted;
    /* 0x0044 */ FChaosClothWeightedValue BendingStiffnessWeighted;
    /* 0x004c */ bool bUseBendingElements;
    /* 0x0050 */ float BucklingRatio;
    /* 0x0054 */ FChaosClothWeightedValue BucklingStiffnessWeighted;
    /* 0x005c */ FChaosClothWeightedValue FlatnessRatio;
    /* 0x0064 */ FChaosClothWeightedValue AreaStiffnessWeighted;
    /* 0x006c */ float VolumeStiffness;
    /* 0x0070 */ FChaosClothWeightedValue TetherStiffness;
    /* 0x0078 */ FChaosClothWeightedValue TetherScale;
    /* 0x0080 */ bool bUseGeodesicDistance;
    /* 0x0084 */ float ShapeTargetStiffness;
    /* 0x0088 */ float CollisionThickness;
    /* 0x008c */ float FrictionCoefficient;
    /* 0x0090 */ bool bUseCCD;
    /* 0x0091 */ bool bUseSelfCollisions;
    /* 0x0094 */ float SelfCollisionThickness;
    /* 0x0098 */ float SelfCollisionFriction;
    /* 0x009c */ bool bUseSelfIntersections;
    /* 0x009d */ bool bUseSelfCollisionSpheres;
    /* 0x00a0 */ float SelfCollisionSphereRadius;
    /* 0x00a4 */ float SelfCollisionSphereStiffness;
    /* 0x00a8 */ float SelfCollisionSphereRadiusCullMultiplier;
    /* 0x00ac */ bool bUseLegacyBackstop;
    /* 0x00b0 */ float DampingCoefficient;
    /* 0x00b4 */ float LocalDampingCoefficient;
    /* 0x00b8 */ bool bUsePointBasedWindModel;
    /* 0x00bc */ FChaosClothWeightedValue Drag;
    /* 0x00c4 */ bool bEnableOuterDrag;
    /* 0x00c8 */ FChaosClothWeightedValue OuterDrag;
    /* 0x00d0 */ FChaosClothWeightedValue Lift;
    /* 0x00d8 */ bool bEnableOuterLift;
    /* 0x00dc */ FChaosClothWeightedValue OuterLift;
    /* 0x00e4 */ bool bUseGravityOverride;
    /* 0x00e8 */ float GravityScale;
    /* 0x00f0 */ FVector Gravity;
    /* 0x0108 */ FChaosClothWeightedValue Pressure;
    /* 0x0110 */ FChaosClothWeightedValue AnimDriveStiffness;
    /* 0x0118 */ FChaosClothWeightedValue AnimDriveDamping;
    /* 0x0120 */ EChaosSoftsSimulationSpace VelocityScaleSpace;
    /* 0x0128 */ FVector LinearVelocityScale;
    /* 0x0140 */ bool bEnableLinearVelocityClamping;
    /* 0x0144 */ FVector3f MaxLinearVelocity;
    /* 0x0150 */ bool bEnableLinearAccelerationClamping;
    /* 0x0154 */ FVector3f MaxLinearAcceleration;
    /* 0x0160 */ float AngularVelocityScale;
    /* 0x0164 */ bool bEnableAngularVelocityClamping;
    /* 0x0168 */ float MaxAngularVelocity;
    /* 0x016c */ bool bEnableAngularAccelerationClamping;
    /* 0x0170 */ float MaxAngularAcceleration;
    /* 0x0174 */ float FictitiousAngularScale;
    /* 0x0178 */ bool bUseTetrahedralConstraints;
    /* 0x0179 */ bool bUseThinShellVolumeConstraints;
    /* 0x017a */ bool bUseContinuousCollisionDetection;
};

// Size: 0x38
class UChaosClothSharedSimConfig : public UClothSharedConfigCommon {
    /* 0x0028 */ int32_t IterationCount;
    /* 0x002c */ int32_t MaxIterationCount;
    /* 0x0030 */ int32_t SubdivisionCount;
    /* 0x0034 */ bool bUseLocalSpaceSimulation;
    /* 0x0035 */ bool bUseXPBDConstraints;
};

// Size: 0x8
struct FChaosClothWeightedValue {
    /* 0x0000 */ float Low;
    /* 0x0004 */ float High;
};

// Size: 0x50
class UChaosClothingInteractor : public UClothingInteractor {

    void ResetAndTeleport(bool bReset, bool bTeleport);
    void SetAerodynamics(float DragCoefficient, float LiftCoefficient, FVector WindVelocity);
    void SetAnimDrive(FVector2D AnimDriveStiffness, FVector2D AnimDriveDamping);
    void SetAnimDriveLinear(float AnimDriveStiffness);
    void SetBackstop(bool bEnabled);
    void SetCollision(float CollisionThickness, float FrictionCoefficient, bool bUseCCD, float SelfCollisionThickness);
    void SetDamping(float DampingCoefficient, float LocalDampingCoefficient);
    void SetGravity(float GravityScale, bool bIsGravityOverridden, FVector GravityOverride);
    void SetLongRangeAttachment(FVector2D TetherStiffness, FVector2D TetherScale);
    void SetLongRangeAttachmentLinear(float TetherStiffness, float TetherScale);
    void SetMaterial(FVector2D EdgeStiffness, FVector2D BendingStiffness, FVector2D AreaStiffness);
    void SetMaterialBuckling(FVector2D BucklingRatio, FVector2D BucklingStiffness);
    void SetMaterialLinear(float EdgeStiffness, float BendingStiffness, float AreaStiffness);
    void SetPressure(FVector2D Pressure);
    void SetVelocityClamps(bool bEnableLinearVelocityClamping, FVector MaxLinearVelocity, bool bEnableLinearAccelerationClamping, FVector MaxLinearAcceleration, bool bEnableAngularVelocityClamping, float MaxAngularVelocity, bool bEnableAngularAccelerationClamping, float MaxAngularAcceleration);
    void SetVelocityScale(FVector LinearVelocityScale, float AngularVelocityScale, float FictitiousAngularScale);
    void SetWind(FVector2D Drag, FVector2D Lift, float AirDensity, FVector WindVelocity, FVector2D OuterDrag, FVector2D OuterLift);
};

// Size: 0x28
class UChaosClothingSimulationFactory : public UClothingSimulationFactory {
};

// Size: 0xb0
class UChaosClothingSimulationInteractor : public UClothingSimulationInteractor {
};

enum class EChaosClothTetherMode {
    FastTetherFastLength = 0,
    AccurateTetherFastLength = 1,
    AccurateTetherAccurateLength = 2,
    MaxChaosClothTetherMode = 3,
    EChaosClothTetherMode_MAX = 4,
};

enum class EChaosWeightMapTarget {
    None = 0,
    MaxDistance = 1,
    BackstopDistance = 2,
    BackstopRadius = 3,
    AnimDriveStiffness = 4,
    TetherEndsMask = 201,
    AnimDriveDamping = 5,
    TetherStiffness = 6,
    TetherScale = 7,
    Drag = 8,
    Lift = 9,
    EdgeStiffness = 10,
    BendingStiffness = 11,
    AreaStiffness = 12,
    BucklingStiffness = 13,
    Pressure = 14,
    FlatnessRatio = 15,
    OuterDrag = 16,
    OuterLift = 17,
    MAX = 18,
};

// Size: 0x30
struct FBreakEventCallbackWrapper {
};

// Size: 0xc0
class UChaosDebugDrawComponent : public UActorComponent {
};

// Size: 0x30
class UChaosDebugDrawSubsystem : public UWorldSubsystem {
};

// Size: 0x3
struct FChaosDebugSubstepControl {
    /* 0x0000 */ bool bPause;
    /* 0x0001 */ bool bSubstep;
    /* 0x0002 */ bool bStep;
};

// Size: 0xc0
class UChaosEventListenerComponent : public UActorComponent {
};

// Size: 0x2d0
class UChaosGameplayEventDispatcher : public UChaosEventListenerComponent {
    /* 0x0180 */ TMap<UPrimitiveComponent*, FChaosHandlerSet> CollisionEventRegistrations;
    /* 0x01d0 */ TMap<UPrimitiveComponent*, FBreakEventCallbackWrapper> BreakEventRegistrations;
    /* 0x0220 */ TMap<UPrimitiveComponent*, FRemovalEventCallbackWrapper> RemovalEventRegistrations;
    /* 0x0270 */ TMap<UPrimitiveComponent*, FCrumblingEventCallbackWrapper> CrumblingEventRegistrations;
};

// Size: 0x58
struct FChaosHandlerSet {
    /* 0x0008 */ TSet<UObject*> ChaosHandlers;
};

// Size: 0x28
class IChaosNotifyHandlerInterface : public UInterface {
};

// Size: 0xc0
struct FChaosPhysicsCollisionInfo {
    /* 0x0000 */ UPrimitiveComponent* Component;
    /* 0x0008 */ UPrimitiveComponent* OtherComponent;
    /* 0x0010 */ FVector Location;
    /* 0x0028 */ FVector Normal;
    /* 0x0040 */ FVector AccumulatedImpulse;
    /* 0x0058 */ FVector Velocity;
    /* 0x0070 */ FVector OtherVelocity;
    /* 0x0088 */ FVector AngularVelocity;
    /* 0x00a0 */ FVector OtherAngularVelocity;
    /* 0x00b8 */ float Mass;
    /* 0x00bc */ float OtherMass;
};

// Size: 0x28
class UChaosSolver : public UObject {
};

// Size: 0x4a8
class AChaosSolverActor : public AActor {
    /* 0x02b0 */ FChaosSolverConfiguration Properties;
    /* 0x0334 */ float TimeStepMultiplier;
    /* 0x0338 */ int32_t CollisionIterations;
    /* 0x033c */ int32_t PushOutIterations;
    /* 0x0340 */ int32_t PushOutPairIterations;
    /* 0x0344 */ float ClusterConnectionFactor;
    /* 0x0348 */ EClusterConnectionTypeEnum ClusterUnionConnectionType;
    /* 0x0349 */ bool DoGenerateCollisionData;
    /* 0x034c */ FSolverCollisionFilterSettings CollisionFilterSettings;
    /* 0x035c */ bool DoGenerateBreakingData;
    /* 0x0360 */ FSolverBreakingFilterSettings BreakingFilterSettings;
    /* 0x0370 */ bool DoGenerateTrailingData;
    /* 0x0374 */ FSolverTrailingFilterSettings TrailingFilterSettings;
    /* 0x0384 */ float MassScale;
    /* 0x0388 */ bool bHasFloor;
    /* 0x038c */ float FloorHeight;
    /* 0x0390 */ FChaosDebugSubstepControl ChaosDebugSubstepControl;
    /* 0x0398 */ UBillboardComponent* SpriteComponent;
    /* 0x03a0 */ FDataflowSimulationAsset SimulationAsset;
    /* 0x0498 */ UChaosGameplayEventDispatcher* GameplayEventDispatcherComponent;

    void SetAsCurrentWorldSolver();
    void SetSolverActive(bool bActive);
};

// Size: 0x28
class UChaosSolverEngineBlueprintLibrary : public UBlueprintFunctionLibrary {

    static FHitResult ConvertPhysicsCollisionToHitResult(const FChaosPhysicsCollisionInfo& PhysicsCollision);
};

// Size: 0x60
class UChaosSolverSettings : public UDeveloperSettings {
    /* 0x0040 */ FSoftClassPath DefaultChaosSolverActorClass;
};

// Size: 0x18
struct FChaosVDChannelStateChangeCommandMessage {
    /* 0x0000 */ FChaosVDDataChannelState NewState;
};

// Size: 0x28
struct FChaosVDChannelStateChangeResponseMessage {
    /* 0x0000 */ FGuid InstanceId;
    /* 0x0010 */ FChaosVDDataChannelState NewState;
};

// Size: 0x18
struct FChaosVDDataChannelState {
    /* 0x0000 */ FString ChannelName;
    /* 0x0010 */ bool bIsEnabled;
    /* 0x0011 */ bool bCanChangeChannelState;
};

// Size: 0x1
struct FChaosVDFullSessionInfoRequestMessage {
};

// Size: 0x28
struct FChaosVDFullSessionInfoResponseMessage {
    /* 0x0000 */ FGuid InstanceId;
    /* 0x0010 */ TArray<FChaosVDDataChannelState> DataChannelsStates;
    /* 0x0020 */ bool bIsRecording;
};

// Size: 0x50
struct FChaosVDRecordingStatusMessage {
    /* 0x0000 */ FGuid InstanceId;
    /* 0x0010 */ bool bIsRecording;
    /* 0x0014 */ float ElapsedTime;
    /* 0x0018 */ FChaosVDTraceDetails TraceDetails;
};

// Size: 0x10
struct FChaosVDSessionPing {
    /* 0x0000 */ FGuid ControllerInstanceId;
};

// Size: 0x38
struct FChaosVDSessionPong {
    /* 0x0000 */ FGuid InstanceId;
    /* 0x0010 */ FGuid SessionId;
    /* 0x0020 */ FString SessionName;
    /* 0x0030 */ uint8_t BuildTargetType;
};

// Size: 0x18
struct FChaosVDStartRecordingCommandMessage {
    /* 0x0000 */ EChaosVDRecordingMode RecordingMode;
    /* 0x0008 */ FString Target;
};

// Size: 0x1
struct FChaosVDStopRecordingCommandMessage {
};

// Size: 0x30
struct FCrumblingEventCallbackWrapper {
};

// Size: 0x90
struct FDataflowRigidSolverProxy : public FDataflowPhysicsSolverProxy {
};

enum class EChaosVDRemoteSessionAttributes {
    None = 0,
    SupportsDataChannelChange = 1,
    CanExpire = 2,
    IsMultiSessionWrapper = 4,
    EChaosVDRemoteSessionAttributes_MAX = 5,
};

enum class EChaosVDRemoteSessionReadyState {
    Ready = 0,
    Busy = 1,
    EChaosVDRemoteSessionReadyState_MAX = 2,
};

enum class EClusterConnectionTypeEnum {
    Chaos_PointImplicit = 0,
    Chaos_DelaunayTriangulation = 1,
    Chaos_MinimalSpanningSubsetDelaunayTriangulation = 2,
    Chaos_PointImplicitAugmentedWithMinimalDelaunay = 3,
    Chaos_BoundsOverlapFilteredDelaunayTriangulation = 4,
    Chaos_None = 5,
    Chaos_EClsuterCreationParameters_Max = 6,
    Chaos_MAX = 7,
};

// Size: 0x30
struct FRemovalEventCallbackWrapper {
};

// Size: 0x28
class UChaosVDRuntimeBlueprintLibrary : public UBlueprintFunctionLibrary {

    static void RecordDebugDrawBox(const UObject* WorldContext, const FBox& InBox, FName Tag, FLinearColor Color);
    static void RecordDebugDrawLine(const UObject* WorldContext, const FVector& InStartLocation, const FVector& InEndLocation, FName Tag, FLinearColor Color);
    static void RecordDebugDrawSphere(const UObject* WorldContext, const FVector& InCenter, float Radius, FName Tag, FLinearColor Color);
    static void RecordDebugDrawVector(const UObject* WorldContext, const FVector& InStartLocation, const FVector& InVector, FName Tag, FLinearColor Color);
};

// Size: 0x70
struct FChaosVDAABBTreeDataWrapper : public FChaosVDAccelerationStructureBase {
    /* 0x0018 */ int32_t RootNodeIndex;
    /* 0x001c */ int32_t TreeDepth;
    /* 0x0020 */ int32_t NodesNum;
    /* 0x0024 */ int32_t LeavesNum;
    /* 0x0028 */ bool bDynamicTree;
    /* 0x002c */ int32_t MaxChildrenInLeaf;
    /* 0x0030 */ int32_t MaxTreeDepth;
    /* 0x0038 */ double MaxPayloadBounds;
};

// Size: 0x58
struct FChaosVDAABBTreeLeafDataWrapper : public FChaosVDWrapperDataBase {
    /* 0x0010 */ TArray<FChaosVDAABBTreePayloadBoundsElement> Elements;
    /* 0x0020 */ FBox Bounds;
};

// Size: 0x90
struct FChaosVDAABBTreeNodeDataWrapper : public FChaosVDWrapperDataBase {
    /* 0x0010 */ FBox ChildrenBounds[2];
    /* 0x0080 */ int32_t ChildrenNodes[2];
    /* 0x0088 */ int32_t ParentNode;
    /* 0x008c */ bool bLeaf;
    /* 0x008c */ bool bDirtyNode;
};

// Size: 0x88
struct FChaosVDAABBTreePayloadBoundsElement : public FChaosVDWrapperDataBase {
    /* 0x0010 */ int32_t ParticleIndex;
    /* 0x0018 */ FBox Bounds;
};

// Size: 0x18
struct FChaosVDAccelerationStructureBase : public FChaosVDWrapperDataBase {
    /* 0x0010 */ int32_t SolverId;
    /* 0x0014 */ EChaosVDAccelerationStructureType Type;
};

// Size: 0x50
struct FChaosVDAccelerationStructureContainer {
};

// Size: 0x68
struct FChaosVDBVCellElementDataWrapper : public FChaosVDWrapperDataBase {
    /* 0x0010 */ FBox Bounds;
    /* 0x0048 */ int32_t ParticleIndex;
};

// Size: 0x40
struct FChaosVDBoundingVolumeDataWrapper : public FChaosVDAccelerationStructureBase {
    /* 0x0038 */ double MaxPayloadBounds;
};

// Size: 0x138
struct FChaosVDCharacterGroundConstraint : public FChaosVDConstraintDataWrapperBase {
    /* 0x0014 */ int32_t ConstraintIndex;
    /* 0x0020 */ FChaosVDCharacterGroundConstraintStateDataWrapper State;
    /* 0x0078 */ FChaosVDCharacterGroundConstraintSettingsDataWrapper Settings;
    /* 0x00e0 */ FChaosVDCharacterGroundConstraintDataDataWrapper Data;
};

// Size: 0x58
struct FChaosVDCharacterGroundConstraintDataDataWrapper : public FChaosVDWrapperDataBase {
    /* 0x0010 */ FVector GroundNormal;
    /* 0x0028 */ FVector TargetDeltaPosition;
    /* 0x0040 */ double TargetDeltaFacing;
    /* 0x0048 */ double GroundDistance;
    /* 0x0050 */ double CosMaxWalkableSlopeAngle;
};

// Size: 0x68
struct FChaosVDCharacterGroundConstraintSettingsDataWrapper : public FChaosVDWrapperDataBase {
    /* 0x0010 */ FVector VerticalAxis;
    /* 0x0028 */ double TargetHeight;
    /* 0x0030 */ double RadialForceLimit;
    /* 0x0038 */ double FrictionForceLimit;
    /* 0x0040 */ double TwistTorqueLimit;
    /* 0x0048 */ double SwingTorqueLimit;
    /* 0x0050 */ double CosMaxWalkableSlopeAngle;
    /* 0x0058 */ double DampingFactor;
    /* 0x0060 */ double AssumedOnGroundHeight;
};

// Size: 0x58
struct FChaosVDCharacterGroundConstraintStateDataWrapper : public FChaosVDWrapperDataBase {
    /* 0x0020 */ bool bDisabled;
    /* 0x0028 */ FVector SolverAppliedForce;
    /* 0x0040 */ FVector SolverAppliedTorque;
};

// Size: 0x18
struct FChaosVDCollisionChannelInfo {
    /* 0x0000 */ FString DisplayName;
    /* 0x0010 */ int32_t CollisionChannel;
    /* 0x0014 */ bool bIsTraceType;
};

// Size: 0x300
struct FChaosVDCollisionChannelsInfoContainer {
    /* 0x0000 */ FChaosVDCollisionChannelInfo CustomChannelsNames[32];
};

// Size: 0x10
struct FChaosVDCollisionFilterData {
    /* 0x0000 */ uint32_t Word0;
    /* 0x0004 */ uint32_t Word1;
    /* 0x0008 */ uint32_t Word2;
    /* 0x000c */ uint32_t Word3;
};

// Size: 0x30
struct FChaosVDCollisionMaterial {
    /* 0x0000 */ int32_t FaceIndex;
    /* 0x0004 */ float MaterialDynamicFriction;
    /* 0x0008 */ float MaterialStaticFriction;
    /* 0x000c */ float MaterialRestitution;
    /* 0x0010 */ float DynamicFriction;
    /* 0x0014 */ float StaticFriction;
    /* 0x0018 */ float Restitution;
    /* 0x001c */ float RestitutionThreshold;
    /* 0x0020 */ float InvMassScale0;
    /* 0x0024 */ float InvMassScale1;
    /* 0x0028 */ float InvInertiaScale0;
    /* 0x002c */ float InvInertiaScale1;
};

// Size: 0x18
struct FChaosVDCollisionObjectQueryParams : public FChaosVDWrapperDataBase {
    /* 0x0010 */ uint8_t ObjectTypesToQuery;
    /* 0x0011 */ uint8_t IgnoreMask;
};

// Size: 0x68
struct FChaosVDCollisionQueryParams : public FChaosVDWrapperDataBase {
    /* 0x0010 */ FName TraceTag;
    /* 0x0018 */ FName OwnerTag;
    /* 0x0020 */ bool bTraceComplex;
    /* 0x0020 */ bool bFindInitialOverlaps;
    /* 0x0020 */ bool bReturnFaceIndex;
    /* 0x0020 */ bool bReturnPhysicalMaterial;
    /* 0x0020 */ bool bIgnoreBlocks;
    /* 0x0020 */ bool bIgnoreTouches;
    /* 0x0020 */ bool bSkipNarrowPhase;
    /* 0x0020 */ bool bTraceIntoSubComponents;
    /* 0x0021 */ bool bReplaceHitWithSubComponents;
    /* 0x0022 */ uint8_t IgnoreMask;
    /* 0x0048 */ TArray<FName> IgnoredActorsNames;
    /* 0x0058 */ TArray<FName> IgnoredComponentsNames;
};

// Size: 0x40
struct FChaosVDCollisionResponseParams : public FChaosVDWrapperDataBase {
};

// Size: 0x8
struct FChaosVDConnectivityEdge {
    /* 0x0000 */ int32_t SiblingParticleID;
    /* 0x0004 */ float Strain;
};

// Size: 0x280
struct FChaosVDConstraint {
    /* 0x0000 */ bool bIsCurrent;
    /* 0x0000 */ bool bDisabled;
    /* 0x0000 */ bool bUseManifold;
    /* 0x0000 */ bool bUseIncrementalManifold;
    /* 0x0000 */ bool bCanRestoreManifold;
    /* 0x0000 */ bool bWasManifoldRestored;
    /* 0x0000 */ bool bIsQuadratic0;
    /* 0x0000 */ bool bIsQuadratic1;
    /* 0x0001 */ bool bIsProbe;
    /* 0x0001 */ bool bCCDEnabled;
    /* 0x0001 */ bool bCCDSweepEnabled;
    /* 0x0001 */ bool bModifierApplied;
    /* 0x0001 */ bool bMaterialSet;
    /* 0x0004 */ FChaosVDCollisionMaterial Material;
    /* 0x0038 */ FVector AccumulatedImpulse;
    /* 0x0050 */ EChaosVDContactShapesType ShapesType;
    /* 0x0060 */ FTransform ShapeWorldTransforms[2];
    /* 0x0120 */ FTransform ImplicitTransforms[2];
    /* 0x01e0 */ float CullDistance;
    /* 0x01e8 */ TArray<float> CollisionMargins;
    /* 0x01f8 */ float CollisionTolerance;
    /* 0x01fc */ int32_t ClosestManifoldPointIndex;
    /* 0x0200 */ int32_t ExpectedNumManifoldPoints;
    /* 0x0208 */ FVector LastShapeWorldPositionDelta;
    /* 0x0220 */ FQuat LastShapeWorldRotationDelta;
    /* 0x0240 */ float Stiffness;
    /* 0x0244 */ float MinInitialPhi;
    /* 0x0248 */ float InitialOverlapDepenetrationVelocity;
    /* 0x024c */ float CCDTimeOfImpact;
    /* 0x0250 */ float CCDEnablePenetration;
    /* 0x0254 */ float CCDTargetPenetration;
    /* 0x0258 */ TArray<FChaosVDManifoldPoint> ManifoldPoints;
    /* 0x0268 */ int32_t Particle0Index;
    /* 0x026c */ int32_t Particle1Index;
    /* 0x0270 */ int32_t SolverId;
};

// Size: 0x10
struct FChaosVDConstraintDataWrapperBase : public FChaosVDWrapperDataBase {
};

// Size: 0x58
struct FChaosVDContactPoint {
    /* 0x0000 */ FVector ShapeContactPoints[2];
    /* 0x0030 */ FVector ShapeContactNormal;
    /* 0x0048 */ float Phi;
    /* 0x004c */ int32_t FaceIndex;
    /* 0x0050 */ EChaosVDContactPointType ContactType;
};

// Size: 0x60
struct FChaosVDDebugDrawBoxDataWrapper : public FChaosVDDebugDrawShapeBase {
    /* 0x0028 */ FBox Box;
};

// Size: 0x90
struct FChaosVDDebugDrawImplicitObjectDataWrapper : public FChaosVDDebugDrawShapeBase {
};

// Size: 0x60
struct FChaosVDDebugDrawLineDataWrapper : public FChaosVDDebugDrawShapeBase {
    /* 0x0028 */ FVector StartLocation;
    /* 0x0040 */ FVector EndLocation;
    /* 0x0058 */ bool bIsArrow;
};

// Size: 0x28
struct FChaosVDDebugDrawShapeBase : public FChaosVDWrapperDataBase {
    /* 0x0010 */ int32_t SolverId;
    /* 0x0014 */ FName Tag;
    /* 0x001c */ FColor Color;
    /* 0x0020 */ EChaosVDParticleContext ThreadContext;
};

// Size: 0x48
struct FChaosVDDebugDrawSphereDataWrapper : public FChaosVDDebugDrawShapeBase {
    /* 0x0028 */ FVector Origin;
    /* 0x0040 */ float Radius;
};

// Size: 0x40
struct FChaosVDDebugShapeDataContainer {
};

// Size: 0x20
struct FChaosVDFRigidParticleControlFlags : public FChaosVDWrapperDataBase {
    /* 0x0010 */ bool bGravityEnabled;
    /* 0x0011 */ bool bCCDEnabled;
    /* 0x0012 */ bool bOneWayInteractionEnabled;
    /* 0x0013 */ bool bInertiaConditioningEnabled;
    /* 0x0014 */ int32_t GravityGroupIndex;
    /* 0x0018 */ bool bMACDEnabled;
    /* 0x0019 */ bool bGyroscopicTorqueEnabled;
    /* 0x001a */ uint8_t PositionSolverIterationCount;
    /* 0x001b */ uint8_t VelocitySolverIterationCount;
    /* 0x001c */ uint8_t ProjectionSolverIterationCount;
};

// Size: 0x50
struct FChaosVDGTJointStateDataWrapper : public FChaosVDWrapperDataBase {
    /* 0x0010 */ bool bIsBreaking;
    /* 0x0010 */ bool bIsBroken;
    /* 0x0010 */ bool bDriveTargetChanged;
    /* 0x0010 */ bool bIsViolating;
    /* 0x0018 */ FVector Force;
    /* 0x0030 */ FVector Torque;
    /* 0x0048 */ float LinearViolation;
    /* 0x004c */ float AngularViolation;
};

// Size: 0x3c0
struct FChaosVDJointConstraint : public FChaosVDConstraintDataWrapperBase {
    /* 0x0014 */ int32_t ConstraintIndex;
    /* 0x0020 */ FChaosVDJointStateDataWrapper PhysicsThreadJointState;
    /* 0x0080 */ FChaosVDGTJointStateDataWrapper GameThreadJointState;
    /* 0x00d0 */ FChaosVDJointSettingsDataWrapper JointSettings;
};

// Size: 0x2f0
struct FChaosVDJointSettingsDataWrapper : public FChaosVDWrapperDataBase {
    /* 0x0010 */ FTransform ConnectorTransforms[2];
    /* 0x00d0 */ double Stiffness;
    /* 0x00d8 */ double LinearProjection;
    /* 0x00e0 */ double AngularProjection;
    /* 0x00e8 */ double ShockPropagation;
    /* 0x00f0 */ double TeleportDistance;
    /* 0x00f8 */ double TeleportAngle;
    /* 0x0100 */ double ParentInvMassScale;
    /* 0x0108 */ bool bCollisionEnabled;
    /* 0x0108 */ bool bMassConditioningEnabled;
    /* 0x0108 */ bool bUseLinearSolver;
    /* 0x0108 */ bool bSoftLinearLimitsEnabled;
    /* 0x0108 */ bool bSoftTwistLimitsEnabled;
    /* 0x0108 */ bool bSoftSwingLimitsEnabled;
    /* 0x0108 */ bool bAngularSLerpPositionDriveEnabled;
    /* 0x0108 */ bool bAngularSLerpVelocityDriveEnabled;
    /* 0x0109 */ bool bAngularTwistPositionDriveEnabled;
    /* 0x0109 */ bool bAngularTwistVelocityDriveEnabled;
    /* 0x0109 */ bool bAngularSwingPositionDriveEnabled;
    /* 0x0109 */ bool bAngularSwingVelocityDriveEnabled;
    /* 0x010c */ EChaosVDJointMotionType LinearMotionTypes[3];
    /* 0x0118 */ double LinearLimit;
    /* 0x0120 */ EChaosVDJointMotionType AngularMotionTypes[3];
    /* 0x0130 */ FVector AngularLimits;
    /* 0x0148 */ EChaosVDJointForceMode LinearSoftForceMode;
    /* 0x014c */ EChaosVDJointForceMode AngularSoftForceMode;
    /* 0x0150 */ double SoftLinearStiffness;
    /* 0x0158 */ double SoftLinearDamping;
    /* 0x0160 */ double SoftTwistStiffness;
    /* 0x0168 */ double SoftTwistDamping;
    /* 0x0170 */ double SoftSwingStiffness;
    /* 0x0178 */ double SoftSwingDamping;
    /* 0x0180 */ double LinearRestitution;
    /* 0x0188 */ double TwistRestitution;
    /* 0x0190 */ double SwingRestitution;
    /* 0x0198 */ double LinearContactDistance;
    /* 0x01a0 */ double TwistContactDistance;
    /* 0x01a8 */ double SwingContactDistance;
    /* 0x01b0 */ FVector LinearDrivePositionTarget;
    /* 0x01c8 */ FVector LinearDriveVelocityTarget;
    /* 0x01e0 */ bool bLinearPositionDriveEnabled0;
    /* 0x01e0 */ bool bLinearPositionDriveEnabled1;
    /* 0x01e0 */ bool bLinearPositionDriveEnabled2;
    /* 0x01e0 */ bool bLinearVelocityDriveEnabled0;
    /* 0x01e0 */ bool bLinearVelocityDriveEnabled1;
    /* 0x01e0 */ bool bLinearVelocityDriveEnabled2;
    /* 0x01e4 */ EChaosVDJointForceMode LinearDriveForceMode;
    /* 0x01e8 */ FVector LinearDriveStiffness;
    /* 0x0200 */ FVector LinearDriveDamping;
    /* 0x0218 */ FVector LinearDriveMaxForce;
    /* 0x0230 */ FQuat AngularDrivePositionTarget;
    /* 0x0250 */ FVector AngularDriveVelocityTarget;
    /* 0x0268 */ EChaosVDJointForceMode AngularDriveForceMode;
    /* 0x0270 */ FVector AngularDriveStiffness;
    /* 0x0288 */ FVector AngularDriveDamping;
    /* 0x02a0 */ FVector AngularDriveMaxTorque;
    /* 0x02b8 */ double LinearBreakForce;
    /* 0x02c0 */ double LinearPlasticityLimit;
    /* 0x02c8 */ EChaosVDPlasticityType LinearPlasticityType;
    /* 0x02d0 */ double LinearPlasticityInitialDistanceSquared;
    /* 0x02d8 */ double AngularBreakTorque;
    /* 0x02e0 */ double AngularPlasticityLimit;
    /* 0x02e8 */ double ContactTransferScale;
};

// Size: 0xd8
struct FChaosVDJointSolverSettingsDataWrapper : public FChaosVDWrapperDataBase {
    /* 0x0010 */ double SwingTwistAngleTolerance;
    /* 0x0018 */ double PositionTolerance;
    /* 0x0020 */ double AngleTolerance;
    /* 0x0028 */ double MinParentMassRatio;
    /* 0x0030 */ double MaxInertiaRatio;
    /* 0x0038 */ double MinSolverStiffness;
    /* 0x0040 */ double MaxSolverStiffness;
    /* 0x0048 */ int32_t NumIterationsAtMaxSolverStiffness;
    /* 0x004c */ int32_t NumShockPropagationIterations;
    /* 0x0050 */ bool bUseLinearSolver;
    /* 0x0050 */ bool bSortEnabled;
    /* 0x0050 */ bool bSolvePositionLast;
    /* 0x0050 */ bool bUsePositionBasedDrives;
    /* 0x0050 */ bool bEnableTwistLimits;
    /* 0x0050 */ bool bEnableSwingLimits;
    /* 0x0050 */ bool bEnableDrives;
    /* 0x0058 */ double LinearStiffnessOverride;
    /* 0x0060 */ double TwistStiffnessOverride;
    /* 0x0068 */ double SwingStiffnessOverride;
    /* 0x0070 */ double LinearProjectionOverride;
    /* 0x0078 */ double AngularProjectionOverride;
    /* 0x0080 */ double ShockPropagationOverride;
    /* 0x0088 */ double LinearDriveStiffnessOverride;
    /* 0x0090 */ double LinearDriveDampingOverride;
    /* 0x0098 */ double AngularDriveStiffnessOverride;
    /* 0x00a0 */ double AngularDriveDampingOverride;
    /* 0x00a8 */ double SoftLinearStiffnessOverride;
    /* 0x00b0 */ double SoftLinearDampingOverride;
    /* 0x00b8 */ double SoftTwistStiffnessOverride;
    /* 0x00c0 */ double SoftTwistDampingOverride;
    /* 0x00c8 */ double SoftSwingStiffnessOverride;
    /* 0x00d0 */ double SoftSwingDampingOverride;
};

// Size: 0x60
struct FChaosVDJointStateDataWrapper : public FChaosVDWrapperDataBase {
    /* 0x0020 */ bool bDisabled;
    /* 0x0020 */ bool bBroken;
    /* 0x0020 */ bool bBreaking;
    /* 0x0020 */ bool bDriveTargetChanged;
    /* 0x0020 */ bool bEnabledDuringResim;
    /* 0x0028 */ FVector LinearImpulse;
    /* 0x0040 */ FVector AngularImpulse;
    /* 0x0058 */ EChaosVDJointReSimType ResimType;
    /* 0x005c */ EChaosVDJointSyncType SyncState;
};

// Size: 0x50
struct FChaosVDKinematicTarget : public FChaosVDWrapperDataBase {
    /* 0x0010 */ FQuat Rotation;
    /* 0x0030 */ FVector position;
    /* 0x0048 */ EChaosVDKinematicTargetMode Mode;
};

// Size: 0x130
struct FChaosVDManifoldPoint {
    /* 0x0000 */ bool bDisabled;
    /* 0x0000 */ bool bWasRestored;
    /* 0x0000 */ bool bWasReplaced;
    /* 0x0000 */ bool bHasStaticFrictionAnchor;
    /* 0x0000 */ bool bIsValid;
    /* 0x0000 */ bool bInsideStaticFrictionCone;
    /* 0x0008 */ FVector NetPushOut;
    /* 0x0020 */ FVector NetImpulse;
    /* 0x0038 */ float TargetPhi;
    /* 0x003c */ float InitialPhi;
    /* 0x0040 */ FVector ShapeAnchorPoints[2];
    /* 0x0070 */ FVector InitialShapeContactPoints[2];
    /* 0x00a0 */ FChaosVDContactPoint ContactPoint;
    /* 0x00f8 */ FVector ShapeContactPoints[2];
};

// Size: 0x50
struct FChaosVDMultiSolverDebugShapeDataContainer {
};

// Size: 0x40
struct FChaosVDParticleBounds : public FChaosVDWrapperDataBase {
    /* 0x0010 */ FVector MMin;
    /* 0x0028 */ FVector MMax;
};

// Size: 0xb0
struct FChaosVDParticleCluster : public FChaosVDWrapperDataBase {
    /* 0x0010 */ int32_t ParentParticleID;
    /* 0x0014 */ int32_t NumChildren;
    /* 0x0020 */ FTransform ChildToParent;
    /* 0x0080 */ int32_t ClusterGroupIndex;
    /* 0x0084 */ bool bInternalCluster;
    /* 0x0088 */ float CollisionImpulse;
    /* 0x008c */ float ExternalStrains;
    /* 0x0090 */ float InternalStrains;
    /* 0x0094 */ float Strain;
    /* 0x0098 */ TArray<FChaosVDConnectivityEdge> ConnectivityEdges;
    /* 0x00a8 */ bool bIsAnchored;
    /* 0x00a9 */ bool bUnbreakable;
    /* 0x00aa */ bool bIsChildToParentLocked;
};

// Size: 0x3f0
struct FChaosVDParticleDataWrapper : public FChaosVDWrapperDataBase {
    /* 0x0010 */ int32_t DirtyFlagsBits;
    /* 0x0014 */ EChaosVDParticleContext ParticleContext;
    /* 0x0018 */ uint32_t GeometryHash;
    /* 0x0020 */ FString DebugName;
    /* 0x0038 */ int32_t ParticleIndex;
    /* 0x003c */ int32_t SolverId;
    /* 0x0040 */ EChaosVDParticleType Type;
    /* 0x0050 */ FChaosVDParticlePositionRotation ParticlePositionRotation;
    /* 0x00a0 */ FChaosVDParticleVelocities ParticleVelocities;
    /* 0x00e0 */ FChaosVDParticleBounds ParticleInflatedBounds;
    /* 0x0120 */ FChaosVDKinematicTarget ParticleKinematicTarget;
    /* 0x0170 */ FChaosVDVSmooth ParticleVWSmooth;
    /* 0x01b0 */ FChaosVDParticleDynamics ParticleDynamics;
    /* 0x0220 */ FChaosVDParticleDynamicMisc ParticleDynamicsMisc;
    /* 0x0290 */ FChaosVDParticleMassProps ParticleMassProps;
    /* 0x0320 */ FChaosVDParticleCluster ParticleCluster;
    /* 0x03d0 */ TArray<FChaosVDShapeCollisionData> CollisionDataPerShape;
};

// Size: 0x70
struct FChaosVDParticleDynamicMisc : public FChaosVDWrapperDataBase {
    /* 0x0010 */ double MLinearEtherDrag;
    /* 0x0018 */ double MAngularEtherDrag;
    /* 0x0020 */ double MMaxLinearSpeedSq;
    /* 0x0028 */ double MMaxAngularSpeedSq;
    /* 0x0030 */ float MInitialOverlapDepenetrationVelocity;
    /* 0x0034 */ float MSleepThresholdMultiplier;
    /* 0x0038 */ int32_t MCollisionGroup;
    /* 0x003c */ EChaosVDObjectStateType MObjectState;
    /* 0x003d */ EChaosVDSleepType MSleepType;
    /* 0x0040 */ uint32_t MCollisionConstraintFlag;
    /* 0x0048 */ FChaosVDFRigidParticleControlFlags MControlFlags;
    /* 0x0068 */ bool bDisabled;
};

// Size: 0x70
struct FChaosVDParticleDynamics : public FChaosVDWrapperDataBase {
    /* 0x0010 */ FVector MAcceleration;
    /* 0x0028 */ FVector MAngularAcceleration;
    /* 0x0040 */ FVector MLinearImpulseVelocity;
    /* 0x0058 */ FVector MAngularImpulseVelocity;
};

// Size: 0x90
struct FChaosVDParticleMassProps : public FChaosVDWrapperDataBase {
    /* 0x0010 */ FVector MCenterOfMass;
    /* 0x0030 */ FQuat MRotationOfMass;
    /* 0x0050 */ FVector MI;
    /* 0x0068 */ FVector MInvI;
    /* 0x0080 */ double MM;
    /* 0x0088 */ double MInvM;
};

// Size: 0x28
struct FChaosVDParticlePairMidPhase {
    /* 0x0000 */ int32_t SolverId;
    /* 0x0004 */ EChaosVDMidPhaseType MidPhaseType;
    /* 0x0005 */ bool bIsActive;
    /* 0x0005 */ bool bIsCCD;
    /* 0x0005 */ bool bIsCCDActive;
    /* 0x0005 */ bool bIsSleeping;
    /* 0x0005 */ bool bIsModified;
    /* 0x0008 */ int32_t LastUsedEpoch;
    /* 0x000c */ int32_t Particle0Idx;
    /* 0x0010 */ int32_t Particle1Idx;
    /* 0x0018 */ TArray<FChaosVDConstraint> Constraints;
};

// Size: 0x50
struct FChaosVDParticlePositionRotation : public FChaosVDWrapperDataBase {
    /* 0x0010 */ FVector MX;
    /* 0x0030 */ FQuat MR;
};

// Size: 0x40
struct FChaosVDParticleVelocities : public FChaosVDWrapperDataBase {
    /* 0x0010 */ FVector MV;
    /* 0x0028 */ FVector MW;
};

// Size: 0x180
struct FChaosVDQueryDataWrapper {
    /* 0x0000 */ int32_t ID;
    /* 0x0004 */ int32_t ParentQueryID;
    /* 0x0008 */ int32_t WorldSolverID;
    /* 0x000c */ bool bIsRetryQuery;
    /* 0x0020 */ FQuat GeometryOrientation;
    /* 0x0040 */ EChaosVDSceneQueryType Type;
    /* 0x0044 */ EChaosVDSceneQueryMode Mode;
    /* 0x0048 */ FVector StartLocation;
    /* 0x0060 */ FVector EndLocation;
    /* 0x0078 */ int32_t CollisionChannel;
    /* 0x0080 */ FChaosVDCollisionQueryParams CollisionQueryParams;
    /* 0x00e8 */ FChaosVDCollisionResponseParams CollisionResponseParams;
    /* 0x0128 */ FChaosVDCollisionObjectQueryParams CollisionObjectQueryParams;
    /* 0x0150 */ TArray<FChaosVDQueryVisitStep> Hits;
};

// Size: 0x58
struct FChaosVDQueryFastData : public FChaosVDWrapperDataBase {
    /* 0x0010 */ FVector Dir;
    /* 0x0028 */ FVector InvDir;
    /* 0x0040 */ double CurrentLength;
    /* 0x0048 */ double InvCurrentLength;
    /* 0x0050 */ bool bParallel0;
    /* 0x0050 */ bool bParallel1;
    /* 0x0050 */ bool bParallel2;
};

// Size: 0x68
struct FChaosVDQueryHitData : public FChaosVDWrapperDataBase {
    /* 0x0010 */ float Distance;
    /* 0x0014 */ int32_t FaceIdx;
    /* 0x0018 */ uint16_t Flags;
    /* 0x0020 */ FVector WorldPosition;
    /* 0x0038 */ FVector WorldNormal;
    /* 0x0050 */ FVector FaceNormal;
};

// Size: 0x150
struct FChaosVDQueryVisitStep : public FChaosVDWrapperDataBase {
    /* 0x0014 */ EChaosVDSceneQueryVisitorType Type;
    /* 0x0018 */ uint32_t ShapeIndex;
    /* 0x001c */ int32_t ParticleIndex;
    /* 0x0020 */ FTransform ParticleTransform;
    /* 0x0080 */ FChaosVDQueryFastData QueryFastData;
    /* 0x00d8 */ EChaosVDCollisionQueryHitType HitType;
    /* 0x00e0 */ FChaosVDQueryHitData HitData;
    /* 0x0148 */ EChaosVDSQVisitRejectReason RejectReason;
};

// Size: 0xa0
struct FChaosVDSceneQueriesDataContainer {
};

// Size: 0x2c
struct FChaosVDShapeCollisionData {
    /* 0x0000 */ EChaosVDCollisionTraceFlag CollisionTraceType;
    /* 0x0004 */ bool bSimCollision;
    /* 0x0004 */ bool bQueryCollision;
    /* 0x0004 */ bool bIsProbe;
    /* 0x0008 */ FChaosVDCollisionFilterData QueryData;
    /* 0x0018 */ FChaosVDCollisionFilterData SimData;
    /* 0x0028 */ bool bIsComplex;
    /* 0x0029 */ bool bIsValid;
};

// Size: 0x38
struct FChaosVDTraceDetails {
    /* 0x0000 */ FGuid TraceGuid;
    /* 0x0010 */ FGuid SessionGuid;
    /* 0x0020 */ FString TraceTarget;
    /* 0x0030 */ bool bIsConnected;
    /* 0x0031 */ EChaosVDRecordingMode Mode;
};

// Size: 0x40
struct FChaosVDVSmooth : public FChaosVDWrapperDataBase {
    /* 0x0010 */ FVector MV;
    /* 0x0028 */ FVector MW;
};

// Size: 0x10
struct FChaosVDWrapperDataBase {
    /* 0x0008 */ bool bHasValidData;
};

enum class EChaosVDAABBTreeNodeFlags {
    None = 0,
    IsLeaf = 1,
    IsDirty = 2,
    EChaosVDAABBTreeNodeFlags_MAX = 3,
};

enum class EChaosVDAccelerationStructureType {
    BoundingVolume = 0,
    AABBTree = 1,
    AABBTreeBV = 2,
    Collection = 3,
    Unknown = 4,
    EChaosVDAccelerationStructureType_MAX = 5,
};

enum class EChaosVDCollisionQueryHitType {
    None = 0,
    Touch = 1,
    Block = 2,
    EChaosVDCollisionQueryHitType_MAX = 3,
};

enum class EChaosVDCollisionQueryParamsFlags {
    None = 0,
    TraceComplex = 1,
    FindInitialOverlaps = 2,
    ReturnFaceIndex = 4,
    ReturnPhysicalMaterial = 8,
    IgnoreBlocks = 16,
    IgnoreTouches = 32,
    SkipNarrowPhase = 64,
    TraceIntoSubComponents = 128,
    ReplaceHitWithSubComponents = 256,
    EChaosVDCollisionQueryParamsFlags_MAX = 257,
};

enum class EChaosVDCollisionShapeDataFlags {
    None = 0,
    SimCollision = 1,
    QueryCollision = 2,
    IsProbe = 4,
    EChaosVDCollisionShapeDataFlags_MAX = 5,
};

enum class EChaosVDCollisionTraceFlag {
    UseDefault = 0,
    UseSimpleAndComplex = 1,
    UseSimpleAsComplex = 2,
    UseComplexAsSimple = 3,
    MAX = 4,
};

enum class EChaosVDConstraintFlags {
    None = 0,
    IsCurrent = 1,
    Disabled = 2,
    UseManifold = 4,
    UseIncrementalManifold = 8,
    CanRestoreManifold = 16,
    WasManifoldRestored = 32,
    IsQuadratic0 = 64,
    IsQuadratic1 = 128,
    IsProbe = 256,
    CCDEnabled = 512,
    CCDSweepEnabled = 1024,
    ModifierApplied = 2048,
    MaterialSet = 4096,
    EChaosVDConstraintFlags_MAX = 4097,
};

enum class EChaosVDContactPointType {
    Unknown = 0,
    VertexPlane = 1,
    EdgeEdge = 2,
    PlaneVertex = 3,
    VertexVertex = 4,
    EChaosVDContactPointType_MAX = 5,
};

enum class EChaosVDContactShapesType {
    Unknown = 0,
    SphereSphere = 1,
    SphereCapsule = 2,
    SphereBox = 3,
    SphereConvex = 4,
    SphereTriMesh = 5,
    SphereHeightField = 6,
    SpherePlane = 7,
    CapsuleCapsule = 8,
    CapsuleBox = 9,
    CapsuleConvex = 10,
    CapsuleTriMesh = 11,
    CapsuleHeightField = 12,
    BoxBox = 13,
    BoxConvex = 14,
    BoxTriMesh = 15,
    BoxHeightField = 16,
    BoxPlane = 17,
    ConvexConvex = 18,
    ConvexTriMesh = 19,
    ConvexHeightField = 20,
    GenericConvexConvex = 21,
    LevelSetLevelSet = 22,
    NumShapesTypes = 23,
    EChaosVDContactShapesType_MAX = 24,
};

enum class EChaosVDGTJointStateFlags {
    None = 0,
    IsBreaking = 1,
    IsBroken = 2,
    DriveTargetChanged = 4,
    IsViolating = 8,
    EChaosVDGTJointStateFlags_MAX = 9,
};

enum class EChaosVDJointForceMode {
    Acceleration = 0,
    Force = 1,
    EChaosVDJointForceMode_MAX = 2,
};

enum class EChaosVDJointMotionType {
    Free = 0,
    Limited = 1,
    Locked = 2,
    EChaosVDJointMotionType_MAX = 3,
};

enum class EChaosVDJointReSimType {
    FullResim = 0,
    ResimAsFollower = 1,
    EChaosVDJointReSimType_MAX = 2,
};

enum class EChaosVDJointSettingsFlags {
    None = 0,
    CollisionEnabled = 1,
    MassConditioningEnabled = 2,
    AngularSLerpPositionDriveEnabled = 4,
    AngularSLerpVelocityDriveEnabled = 8,
    AngularTwistPositionDriveEnabled = 16,
    AngularTwistVelocityDriveEnabled = 32,
    AngularSwingPositionDriveEnabled = 64,
    AngularSwingVelocityDriveEnabled = 128,
    SoftLinearLimitsEnabled = 256,
    SoftTwistLimitsEnabled = 512,
    SoftSwingLimitsEnabled = 1024,
    LinearPositionDriveEnabled0 = 2048,
    LinearPositionDriveEnable1 = 4096,
    LinearPositionDriveEnable2 = 8192,
    LinearVelocityDriveEnabled0 = 16384,
    LinearVelocityDriveEnabled1 = 32768,
    LinearVelocityDriveEnabled2 = 65536,
    UseLinearSolver = 131072,
    EChaosVDJointSettingsFlags_MAX = 131073,
};

enum class EChaosVDJointSolverSettingsFlags {
    None = 0,
    UseLinearSolver = 1,
    SortEnabled = 2,
    SolvePositionLast = 4,
    UsePositionBasedDrives = 8,
    EnableTwistLimits = 16,
    EnableSwingLimits = 32,
    EnableDrives = 64,
    EChaosVDJointSolverSettingsFlags_MAX = 65,
};

enum class EChaosVDJointStateFlags {
    None = 0,
    Disabled = 1,
    Broken = 2,
    Breaking = 4,
    DriveTargetChanged = 8,
    EnabledDuringResim = 16,
    EChaosVDJointStateFlags_MAX = 17,
};

enum class EChaosVDJointSyncType {
    InSync = 0,
    HardDesync = 1,
    EChaosVDJointSyncType_MAX = 2,
};

enum class EChaosVDKinematicTargetMode {
    None = 0,
    Reset = 1,
    Position = 2,
    Velocity = 3,
    EChaosVDKinematicTargetMode_MAX = 4,
};

enum class EChaosVDManifoldPointFlags {
    None = 0,
    Disabled = 1,
    WasRestored = 2,
    WasReplaced = 4,
    HasStaticFrictionAnchor = 8,
    IsValid = 16,
    InsideStaticFrictionCone = 32,
    EChaosVDManifoldPointFlags_MAX = 33,
};

enum class EChaosVDMidPhaseFlags {
    None = 0,
    IsActive = 1,
    IsCCD = 2,
    IsCCDActive = 4,
    IsSleeping = 8,
    IsModified = 16,
    EChaosVDMidPhaseFlags_MAX = 17,
};

enum class EChaosVDMidPhaseType {
    Generic = 0,
    ShapePair = 1,
    SphereApproximation = 2,
    Unknown = 3,
    EChaosVDMidPhaseType_MAX = 4,
};

enum class EChaosVDObjectStateType {
    Uninitialized = 0,
    Sleeping = 1,
    Kinematic = 2,
    Static = 3,
    Dynamic = 4,
    Count = 5,
    EChaosVDObjectStateType_MAX = 6,
};

enum class EChaosVDParticleContext {
    Invalid = 0,
    GameThread = 1,
    PhysicsThread = 2,
    EChaosVDParticleContext_MAX = 3,
};

enum class EChaosVDParticleType {
    Static = 0,
    Kinematic = 1,
    Rigid = 2,
    Clustered = 3,
    StaticMesh = 4,
    SkeletalMesh = 5,
    GeometryCollection = 6,
    Unknown = 7,
    EChaosVDParticleType_MAX = 8,
};

enum class EChaosVDPlasticityType {
    Free = 0,
    Shrink = 1,
    Grow = 2,
    EChaosVDPlasticityType_MAX = 3,
};

enum class EChaosVDQueryFastDataParallelFlags {
    None = 0,
    Parallel0 = 1,
    Parallel1 = 2,
    Parallel2 = 4,
    EChaosVDQueryFastDataParallelFlags_MAX = 5,
};

enum class EChaosVDRecordingMode {
    Invalid = 0,
    Live = 1,
    File = 2,
    EChaosVDRecordingMode_MAX = 3,
};

enum class EChaosVDSQHitFlags {
    None = 0,
    Position = 1,
    Normal = 2,
    Distance = 4,
    UV = 8,
    MTD = 512,
    FaceIndex = 1024,
    EChaosVDSQHitFlags_MAX = 1025,
};

enum class EChaosVDSQVisitRejectReason {
    None = 0,
    NoHit = 1,
    PreFilter = 2,
    PostFilter = 3,
    ColocatedHitHasWorseNormal = 4,
    FailedFastBoundTest = 5,
    EChaosVDSQVisitRejectReason_MAX = 6,
};

enum class EChaosVDSceneQueryMode {
    Single = 0,
    Multi = 1,
    Test = 2,
    Invalid = 3,
    EChaosVDSceneQueryMode_MAX = 4,
};

enum class EChaosVDSceneQueryType {
    Invalid = 0,
    Sweep = 1,
    Overlap = 2,
    RayCast = 3,
    EChaosVDSceneQueryType_MAX = 4,
};

enum class EChaosVDSceneQueryVisitorType {
    Invalid = 0,
    BroadPhase = 1,
    NarrowPhase = 2,
    EChaosVDSceneQueryVisitorType_MAX = 3,
};

enum class EChaosVDSleepType {
    MaterialSleep = 0,
    NeverSleep = 1,
    EChaosVDSleepType_MAX = 2,
};

// Size: 0x14
struct FCameraFilmbackSettings {
    /* 0x0000 */ float SensorWidth;
    /* 0x0004 */ float SensorHeight;
    /* 0x0008 */ float SensorHorizontalOffset;
    /* 0x000c */ float SensorVerticalOffset;
    /* 0x0010 */ float SensorAspectRatio;
};

// Size: 0x60
struct FCameraFocusSettings {
    /* 0x0000 */ ECameraFocusMethod FocusMethod;
    /* 0x0004 */ float ManualFocusDistance;
    /* 0x0008 */ FCameraTrackingFocusSettings TrackingFocusSettings;
    /* 0x0050 */ bool bSmoothFocusChanges;
    /* 0x0054 */ float FocusSmoothingInterpSpeed;
    /* 0x0058 */ float FocusOffset;
};

// Size: 0x1c
struct FCameraLensSettings {
    /* 0x0000 */ float MinFocalLength;
    /* 0x0004 */ float MaxFocalLength;
    /* 0x0008 */ float MinFStop;
    /* 0x000c */ float MaxFStop;
    /* 0x0010 */ float MinimumFocusDistance;
    /* 0x0014 */ float SqueezeFactor;
    /* 0x0018 */ int32_t DiaphragmBladeCount;
};

// Size: 0x68
struct FCameraLookatTrackingSettings {
    /* 0x0000 */ bool bEnableLookAtTracking;
    /* 0x0000 */ bool bDrawDebugLookAtTrackingPosition;
    /* 0x0004 */ float LookAtTrackingInterpSpeed;
    /* 0x0020 */ TSoftObjectPtr<AActor> ActorToTrack;
    /* 0x0048 */ FVector RelativeOffset;
    /* 0x0060 */ bool bAllowRoll;
};

// Size: 0x2d8
class ACameraRig_Crane : public AActor {
    /* 0x02a8 */ float CranePitch;
    /* 0x02ac */ float CraneYaw;
    /* 0x02b0 */ float CraneArmLength;
    /* 0x02b4 */ bool bLockMountPitch;
    /* 0x02b5 */ bool bLockMountYaw;
    /* 0x02b8 */ USceneComponent* TransformComponent;
    /* 0x02c0 */ USceneComponent* CraneYawControl;
    /* 0x02c8 */ USceneComponent* CranePitchControl;
    /* 0x02d0 */ USceneComponent* CraneCameraMount;
};

// Size: 0x2c8
class ACameraRig_Rail : public AActor {
    /* 0x02a8 */ float CurrentPositionOnRail;
    /* 0x02ac */ bool bLockOrientationToRail;
    /* 0x02b0 */ USceneComponent* TransformComponent;
    /* 0x02b8 */ USplineComponent* RailSplineComponent;
    /* 0x02c0 */ USceneComponent* RailCameraMount;

    USplineComponent* GetRailSplineComponent();
};

// Size: 0x48
struct FCameraTrackingFocusSettings {
    /* 0x0000 */ TSoftObjectPtr<AActor> ActorToTrack;
    /* 0x0028 */ FVector RelativeOffset;
    /* 0x0040 */ bool bDrawDebugTrackingFocusPoint;
};

// Size: 0xab0
class ACineCameraActor : public ACameraActor {
    /* 0x0a30 */ FCameraLookatTrackingSettings LookatTrackingSettings;

    UCineCameraComponent* GetCineCameraComponent() const;
};

// Size: 0xba0
class UCineCameraComponent : public UCameraComponent {
    /* 0x0a80 */ FCameraFilmbackSettings FilmbackSettings;
    /* 0x0a94 */ FCameraFilmbackSettings Filmback;
    /* 0x0aa8 */ FCameraLensSettings LensSettings;
    /* 0x0ac8 */ FCameraFocusSettings FocusSettings;
    /* 0x0b28 */ FPlateCropSettings CropSettings;
    /* 0x0b2c */ float CurrentFocalLength;
    /* 0x0b30 */ float CurrentAperture;
    /* 0x0b34 */ float CurrentFocusDistance;
    /* 0x0b38 */ bool bOverride_CustomNearClippingPlane;
    /* 0x0b3c */ float CustomNearClippingPlane;
    /* 0x0b48 */ TArray<FNamedFilmbackPreset> FilmbackPresets;
    /* 0x0b58 */ TArray<FNamedLensPreset> LensPresets;
    /* 0x0b68 */ FString DefaultFilmbackPresetName;
    /* 0x0b78 */ FString DefaultFilmbackPreset;
    /* 0x0b88 */ FString DefaultLensPresetName;
    /* 0x0b98 */ float DefaultLensFocalLength;
    /* 0x0b9c */ float DefaultLensFStop;

    FString GetCropPresetName() const;
    FString GetDefaultFilmbackPresetName() const;
    FString GetFilmbackPresetName() const;
    static TArray<FNamedFilmbackPreset> GetFilmbackPresetsCopy();
    float GetHorizontalFieldOfView() const;
    float GetHorizontalProjectionOffset() const;
    FString GetLensPresetName() const;
    static TArray<FNamedLensPreset> GetLensPresetsCopy();
    float GetVerticalFieldOfView() const;
    float GetVerticalProjectionOffset() const;
    void SetCropPresetByName(FString InPresetName);
    void SetCropSettings(const FPlateCropSettings& NewCropSettings);
    void SetCurrentAperture(const float NewCurrentAperture);
    void SetCurrentFocalLength(float InFocalLength);
    void SetCustomNearClippingPlane(const float NewCustomNearClippingPlane);
    void SetFilmback(const FCameraFilmbackSettings& NewFilmback);
    void SetFilmbackPresetByName(FString InPresetName);
    void SetFocusSettings(const FCameraFocusSettings& NewFocusSettings);
    void SetLensPresetByName(FString InPresetName);
    void SetLensSettings(const FCameraLensSettings& NewLensSettings);
};

// Size: 0xb0
class UCineCameraSettings : public UDeveloperSettings {
    /* 0x0038 */ FString DefaultLensPresetName;
    /* 0x0048 */ float DefaultLensFocalLength;
    /* 0x004c */ float DefaultLensFStop;
    /* 0x0050 */ TArray<FNamedLensPreset> LensPresets;
    /* 0x0060 */ FString DefaultFilmbackPreset;
    /* 0x0070 */ TArray<FNamedFilmbackPreset> FilmbackPresets;
    /* 0x0080 */ FString DefaultCropPresetName;
    /* 0x0090 */ TArray<FNamedPlateCropPreset> CropPresets;

    static UCineCameraSettings* GetCineCameraSettings();
    bool GetCropPresetByName(const FString PresetName, FPlateCropSettings& CropSettings);
    TArray<FString> GetCropPresetNames() const;
    bool GetFilmbackPresetByName(const FString PresetName, FCameraFilmbackSettings& FilmbackSettings);
    TArray<FString> GetFilmbackPresetNames() const;
    bool GetLensPresetByName(const FString PresetName, FCameraLensSettings& LensSettings);
    TArray<FString> GetLensPresetNames() const;
    void SetCropPresets(const TArray<FNamedPlateCropPreset>& InCropPresets);
    void SetDefaultCropPresetName(const FString InDefaultCropPresetName);
    void SetDefaultFilmbackPreset(const FString InDefaultFilmbackPreset);
    void SetDefaultLensFStop(const float InDefaultLensFStop);
    void SetDefaultLensFocalLength(const float InDefaultLensFocalLength);
    void SetDefaultLensPresetName(const FString InDefaultLensPresetName);
    void SetFilmbackPresets(const TArray<FNamedFilmbackPreset>& InFilmbackPresets);
    void SetLensPresets(const TArray<FNamedLensPreset>& InLensPresets);
};

enum class ECameraFocusMethod {
    DoNotOverride = 0,
    Manual = 1,
    Tracking = 2,
    Disable = 3,
    MAX = 4,
};

// Size: 0x38
struct FNamedFilmbackPreset {
    /* 0x0000 */ FString Name;
    /* 0x0010 */ FText DisplayName;
    /* 0x0020 */ FCameraFilmbackSettings FilmbackSettings;
};

// Size: 0x30
struct FNamedLensPreset {
    /* 0x0000 */ FString Name;
    /* 0x0010 */ FCameraLensSettings LensSettings;
};

// Size: 0x18
struct FNamedPlateCropPreset {
    /* 0x0000 */ FString Name;
    /* 0x0010 */ FPlateCropSettings CropSettings;
};

// Size: 0x4
struct FPlateCropSettings {
    /* 0x0000 */ float AspectRatio;
};

// Size: 0x28
class UClothConfigCommon : public UClothConfigBase {
};

// Size: 0x130
struct FClothConfig_Legacy {
    /* 0x0000 */ EClothingWindMethod_Legacy WindMethod;
    /* 0x0004 */ FClothConstraintSetup_Legacy VerticalConstraintConfig;
    /* 0x0014 */ FClothConstraintSetup_Legacy HorizontalConstraintConfig;
    /* 0x0024 */ FClothConstraintSetup_Legacy BendConstraintConfig;
    /* 0x0034 */ FClothConstraintSetup_Legacy ShearConstraintConfig;
    /* 0x0044 */ float SelfCollisionRadius;
    /* 0x0048 */ float SelfCollisionStiffness;
    /* 0x004c */ float SelfCollisionCullScale;
    /* 0x0050 */ FVector Damping;
    /* 0x0068 */ float Friction;
    /* 0x006c */ float WindDragCoefficient;
    /* 0x0070 */ float WindLiftCoefficient;
    /* 0x0078 */ FVector LinearDrag;
    /* 0x0090 */ FVector AngularDrag;
    /* 0x00a8 */ FVector LinearInertiaScale;
    /* 0x00c0 */ FVector AngularInertiaScale;
    /* 0x00d8 */ FVector CentrifugalInertiaScale;
    /* 0x00f0 */ float SolverFrequency;
    /* 0x00f4 */ float StiffnessFrequency;
    /* 0x00f8 */ float GravityScale;
    /* 0x0100 */ FVector GravityOverride;
    /* 0x0118 */ bool bUseGravityOverride;
    /* 0x011c */ float TetherStiffness;
    /* 0x0120 */ float TetherLimit;
    /* 0x0124 */ float CollisionThickness;
    /* 0x0128 */ float AnimDriveSpringStiffness;
    /* 0x012c */ float AnimDriveDamperStiffness;
};

// Size: 0x10
struct FClothConstraintSetup_Legacy {
    /* 0x0000 */ float Stiffness;
    /* 0x0004 */ float StiffnessMultiplier;
    /* 0x0008 */ float StretchLimit;
    /* 0x000c */ float CompressionLimit;
};

// Size: 0x158
struct FClothLODDataCommon {
    /* 0x0000 */ FClothPhysicalMeshData PhysicalMeshData;
    /* 0x0128 */ bool bUseMultipleInfluences;
    /* 0x012c */ float SkinningKernelRadius;
    /* 0x0130 */ bool bSmoothTransition;
};

// Size: 0x1b8
class UClothLODDataCommon_Legacy : public UObject {
    /* 0x0028 */ UClothPhysicalMeshDataBase_Legacy* PhysicalMeshData;
    /* 0x0030 */ FClothPhysicalMeshData ClothPhysicalMeshData;
    /* 0x0158 */ FClothCollisionData CollisionData;
};

// Size: 0x30
struct FClothParameterMask_Legacy {
    /* 0x0000 */ FName MaskName;
    /* 0x0008 */ EWeightMapTargetCommon CurrentTarget;
    /* 0x000c */ float MaxValue;
    /* 0x0010 */ float MinValue;
    /* 0x0018 */ TArray<float> Values;
    /* 0x0028 */ bool bEnabled;
};

// Size: 0x128
struct FClothPhysicalMeshData {
    /* 0x0000 */ TArray<FVector3f> Vertices;
    /* 0x0010 */ TArray<FVector3f> Normals;
    /* 0x0020 */ TArray<uint32_t> Indices;
    /* 0x0030 */ TMap<uint32_t, FPointWeightMap> WeightMaps;
    /* 0x0080 */ TArray<float> InverseMasses;
    /* 0x0090 */ TArray<FClothVertBoneData> BoneData;
    /* 0x00a0 */ TSet<int32_t> SelfCollisionVertexSet;
    /* 0x00f0 */ FClothTetherData EuclideanTethers;
    /* 0x0100 */ FClothTetherData GeodesicTethers;
    /* 0x0110 */ int32_t MaxBoneWeights;
    /* 0x0114 */ int32_t NumFixedVerts;
    /* 0x0118 */ TArray<uint32_t> SelfCollisionIndices;
};

// Size: 0x28
class UClothSharedConfigCommon : public UClothConfigCommon {
};

// Size: 0x10
struct FClothTetherData {
};

// Size: 0xd8
class UClothingAssetCommon : public UClothingAssetBase {
    /* 0x0038 */ UPhysicsAsset* PhysicsAsset;
    /* 0x0040 */ TMap<FName, UClothConfigBase*> ClothConfigs;
    /* 0x0090 */ TArray<FClothLODDataCommon> LODData;
    /* 0x00a0 */ TArray<int32_t> LodMap;
    /* 0x00b0 */ TArray<FName> UsedBoneNames;
    /* 0x00c0 */ TArray<int32_t> UsedBoneIndices;
    /* 0x00d0 */ int32_t ReferenceBoneIndex;
};

// Size: 0x28
class UClothingAssetCustomData : public UObject {
};

enum class EClothMassMode {
    UniformMass = 0,
    TotalMass = 1,
    Density = 2,
    MaxClothMassMode = 3,
    EClothMassMode_MAX = 4,
};

enum class EClothingWindMethod_Legacy {
    Legacy = 0,
    Accurate = 1,
    EClothingWindMethod_MAX = 2,
};

enum class EWeightMapTargetCommon {
    None = 0,
    MaxDistance = 1,
    BackstopDistance = 2,
    BackstopRadius = 3,
    AnimDriveStiffness = 4,
    AnimDriveDamping_DEPRECATED = 5,
    FirstUserTarget = 6,
    LastUserTarget = 200,
    TetherEndsMask = 201,
    EWeightMapTargetCommon_MAX = 202,
};

// Size: 0x10
struct FPointWeightMap {
    /* 0x0000 */ TArray<float> Values;
};

// Size: 0x40
struct FClothCollisionData {
    /* 0x0000 */ TArray<FClothCollisionPrim_Sphere> Spheres;
    /* 0x0010 */ TArray<FClothCollisionPrim_SphereConnection> SphereConnections;
    /* 0x0020 */ TArray<FClothCollisionPrim_Convex> Convexes;
    /* 0x0030 */ TArray<FClothCollisionPrim_Box> Boxes;
};

// Size: 0x60
struct FClothCollisionPrim_Box {
    /* 0x0000 */ FVector LocalPosition;
    /* 0x0020 */ FQuat LocalRotation;
    /* 0x0040 */ FVector HalfExtents;
    /* 0x0058 */ int32_t BoneIndex;
};

// Size: 0x28
struct FClothCollisionPrim_Convex {
    /* 0x0000 */ TArray<FClothCollisionPrim_ConvexFace> Faces;
    /* 0x0010 */ TArray<FVector> SurfacePoints;
    /* 0x0020 */ int32_t BoneIndex;
};

// Size: 0x30
struct FClothCollisionPrim_ConvexFace {
    /* 0x0000 */ FPlane Plane;
    /* 0x0020 */ TArray<int32_t> Indices;
};

// Size: 0x20
struct FClothCollisionPrim_Sphere {
    /* 0x0000 */ int32_t BoneIndex;
    /* 0x0004 */ float Radius;
    /* 0x0008 */ FVector LocalPosition;
};

// Size: 0x20
struct FClothCollisionPrim_SphereConnection {
    /* 0x0000 */ int32_t SphereIndices[2];
    /* 0x0008 */ FVector OneSidedPlaneNormal;
};

// Size: 0x28
class UClothConfigBase : public UObject {
};

// Size: 0xe0
class UClothPhysicalMeshDataBase_Legacy : public UObject {
    /* 0x0028 */ TArray<FVector3f> Vertices;
    /* 0x0038 */ TArray<FVector3f> Normals;
    /* 0x0048 */ TArray<uint32_t> Indices;
    /* 0x0058 */ TArray<float> InverseMasses;
    /* 0x0068 */ TArray<FClothVertBoneData> BoneData;
    /* 0x0078 */ int32_t NumFixedVerts;
    /* 0x007c */ int32_t MaxBoneWeights;
    /* 0x0080 */ TArray<uint32_t> SelfCollisionIndices;
};

// Size: 0x28
class UClothSharedSimConfigBase : public UObject {
};

// Size: 0x4c
struct FClothVertBoneData {
    /* 0x0000 */ int32_t NumInfluences;
    /* 0x0004 */ uint16_t BoneIndices[12];
    /* 0x001c */ float BoneWeights[12];
};

// Size: 0x38
class UClothingAssetBase : public UObject {
    /* 0x0028 */ FGuid AssetGuid;
};

// Size: 0x30
class UClothingInteractor : public UObject {
};

// Size: 0x28
class UClothingSimulationFactory : public UObject {
};

// Size: 0x90
class UClothingSimulationInteractor : public UObject {
    /* 0x0028 */ TMap<FName, UClothingInteractor*> ClothingInteractors;

    void ClothConfigUpdated();
    void DisableGravityOverride();
    void EnableGravityOverride(const FVector& InVector);
    UClothingInteractor* GetClothingInteractor(FString ClothingAssetName) const;
    int32_t GetNumCloths() const;
    int32_t GetNumDynamicParticles() const;
    int32_t GetNumIterations() const;
    int32_t GetNumKinematicParticles() const;
    int32_t GetNumSubsteps() const;
    float GetSimulationTime() const;
    void PhysicsAssetUpdated();
    void SetAnimDriveSpringStiffness(float InStiffness);
    void SetMaxNumIterations(int32_t MaxNumIterations);
    void SetNumIterations(int32_t NumIterations);
    void SetNumSubsteps(int32_t NumSubSteps);
};

enum class EClothingTeleportMode {
    None = 0,
    Teleport = 1,
    TeleportAndReset = 2,
    HardReset = 3,
    EClothingTeleportMode_MAX = 4,
};

// Size: 0x1a0
class UClothConfigNv : public UClothConfigCommon {
    /* 0x0028 */ EClothingWindMethodNv ClothingWindMethod;
    /* 0x002c */ FClothConstraintSetupNv VerticalConstraint;
    /* 0x003c */ FClothConstraintSetupNv HorizontalConstraint;
    /* 0x004c */ FClothConstraintSetupNv BendConstraint;
    /* 0x005c */ FClothConstraintSetupNv ShearConstraint;
    /* 0x006c */ float SelfCollisionRadius;
    /* 0x0070 */ float SelfCollisionStiffness;
    /* 0x0074 */ float SelfCollisionCullScale;
    /* 0x0078 */ FVector Damping;
    /* 0x0090 */ float Friction;
    /* 0x0094 */ float WindDragCoefficient;
    /* 0x0098 */ float WindLiftCoefficient;
    /* 0x00a0 */ FVector LinearDrag;
    /* 0x00b8 */ FVector AngularDrag;
    /* 0x00d0 */ FVector LinearInertiaScale;
    /* 0x00e8 */ FVector AngularInertiaScale;
    /* 0x0100 */ FVector CentrifugalInertiaScale;
    /* 0x0118 */ float SolverFrequency;
    /* 0x011c */ float StiffnessFrequency;
    /* 0x0120 */ float GravityScale;
    /* 0x0128 */ FVector GravityOverride;
    /* 0x0140 */ bool bUseGravityOverride;
    /* 0x0144 */ float TetherStiffness;
    /* 0x0148 */ float TetherLimit;
    /* 0x014c */ float CollisionThickness;
    /* 0x0150 */ float AnimDriveSpringStiffness;
    /* 0x0154 */ float AnimDriveDamperStiffness;
    /* 0x0158 */ EClothingWindMethod_Legacy WindMethod;
    /* 0x015c */ FClothConstraintSetup_Legacy VerticalConstraintConfig;
    /* 0x016c */ FClothConstraintSetup_Legacy HorizontalConstraintConfig;
    /* 0x017c */ FClothConstraintSetup_Legacy BendConstraintConfig;
    /* 0x018c */ FClothConstraintSetup_Legacy ShearConstraintConfig;
};

// Size: 0x10
struct FClothConstraintSetupNv {
    /* 0x0000 */ float Stiffness;
    /* 0x0004 */ float StiffnessMultiplier;
    /* 0x0008 */ float StretchLimit;
    /* 0x000c */ float CompressionLimit;
};

// Size: 0x120
class UClothPhysicalMeshDataNv_Legacy : public UClothPhysicalMeshDataBase_Legacy {
    /* 0x00e0 */ TArray<float> MaxDistances;
    /* 0x00f0 */ TArray<float> BackstopDistances;
    /* 0x0100 */ TArray<float> BackstopRadiuses;
    /* 0x0110 */ TArray<float> AnimDriveMultipliers;
};

// Size: 0x28
class UClothingSimulationFactoryNv : public UClothingSimulationFactory {
};

// Size: 0x90
class UClothingSimulationInteractorNv : public UClothingSimulationInteractor {

    void SetAnimDriveDamperStiffness(float InStiffness);
};

enum class EClothingWindMethodNv {
    Legacy = 0,
    Accurate = 1,
    EClothingWindMethodNv_MAX = 2,
};

// Size: 0xc0
class UCompositeCorePluginSettings : public UDeveloperSettings {
    /* 0x0038 */ bool bApplyPreExposure;
    /* 0x0038 */ bool bApplyFXAA;
    /* 0x0040 */ TArray<FSoftClassPath> DisabledPrimitiveClasses;
    /* 0x0050 */ TArray<FSoftClassPath> AllowedComponentClasses;
    /* 0x0060 */ int32_t SceneViewExtensionPriority;
};

// Size: 0x50
class UCompositeCoreSubsystem : public UTickableWorldSubsystem {

    void RegisterPrimitive(UPrimitiveComponent* InPrimitiveComponent);
    void UnregisterPrimitive(UPrimitiveComponent* InPrimitiveComponent);
};

enum class ECompositeCoreMergeOp {
    None = 0,
    Over = 1,
    Add = 2,
    Multiply = 3,
    Divide = 4,
    ECompositeCoreMergeOp_MAX = 5,
};

// Size: 0x250
class UHoldoutCompositeComponent : public USceneComponent {
    /* 0x0240 */ bool bIsEnabled;

    bool IsEnabled() const;
    void SetEnabled(bool bInEnabled);
};

// Size: 0x10
struct FArrayShaderValue {
    /* 0x0000 */ TArray<uint8_t> ArrayOfValues;
};

// Size: 0x28
class UComputeDataInterface : public UObject {
};

// Size: 0x28
class UComputeDataProvider : public UObject {
};

// Size: 0xe0
class UComputeGraph : public UObject {
    /* 0x0028 */ TArray<UComputeKernel*> KernelInvocations;
    /* 0x0038 */ TArray<UComputeDataInterface*> DataInterfaces;
    /* 0x0048 */ TArray<FComputeGraphEdge> GraphEdges;
    /* 0x0058 */ TArray<UClass*> Bindings;
    /* 0x0068 */ TArray<int32_t> DataInterfaceToBinding;
};

// Size: 0xd8
class UComputeGraphComponent : public UActorComponent {
    /* 0x00b8 */ UComputeGraph* ComputeGraph;
    /* 0x00c0 */ FComputeGraphInstance ComputeGraphInstance;

    void CreateDataProviders(int32_t InBindingIndex, UObject* InBindingObject);
    void DestroyDataProviders();
    void QueueExecute();
};

// Size: 0x38
struct FComputeGraphEdge {
    /* 0x0000 */ int32_t KernelIndex;
    /* 0x0004 */ int32_t KernelBindingIndex;
    /* 0x0008 */ int32_t DataInterfaceIndex;
    /* 0x000c */ int32_t DataInterfaceBindingIndex;
    /* 0x0010 */ bool bKernelInput;
    /* 0x0018 */ FString BindingFunctionNameOverride;
    /* 0x0028 */ FString BindingFunctionNamespace;
};

// Size: 0x18
struct FComputeGraphInstance {
    /* 0x0000 */ TArray<UComputeDataProvider*> DataProviders;
};

// Size: 0x38
class UComputeKernel : public UObject {
    /* 0x0028 */ UComputeKernelSource* KernelSource;
    /* 0x0030 */ int32_t KernelFlags;
};

// Size: 0x20
struct FComputeKernelDefinition {
    /* 0x0000 */ FString Symbol;
    /* 0x0010 */ FString Define;
};

// Size: 0x10
struct FComputeKernelDefinitionSet {
    /* 0x0000 */ TArray<FComputeKernelDefinition> Defines;
};

// Size: 0xa8
class UComputeKernelFromText : public UComputeKernelSource {
    /* 0x0098 */ FFilePath SourceFile;
};

// Size: 0x18
struct FComputeKernelPermutationBool {
    /* 0x0000 */ FString Name;
    /* 0x0010 */ bool Value;
};

// Size: 0x10
struct FComputeKernelPermutationSet {
    /* 0x0000 */ TArray<FComputeKernelPermutationBool> BooleanOptions;
};

// Size: 0x58
struct FComputeKernelPermutationVector {
    /* 0x0000 */ TMap<FString, uint32_t> Permutations;
    /* 0x0050 */ uint32_t BitCount;
};

// Size: 0x98
class UComputeKernelSource : public UObject {
    /* 0x0028 */ FString EntryPoint;
    /* 0x0038 */ FIntVector GroupSize;
    /* 0x0048 */ FComputeKernelPermutationSet PermutationSet;
    /* 0x0058 */ FComputeKernelDefinitionSet DefinitionsSet;
    /* 0x0068 */ TArray<UComputeSource*> AdditionalSources;
    /* 0x0078 */ TArray<FShaderFunctionDefinition> ExternalInputs;
    /* 0x0088 */ TArray<FShaderFunctionDefinition> ExternalOutputs;
};

// Size: 0x38
class UComputeSource : public UObject {
    /* 0x0028 */ TArray<UComputeSource*> AdditionalSources;
};

// Size: 0x48
class UComputeSourceFromText : public UComputeSource {
    /* 0x0038 */ FFilePath SourceFile;
};

enum class EComputeKernelFlags {
    IsDefaultKernel = 1,
    IsolatedMemoryWrites = 2,
    EComputeKernelFlags_MAX = 3,
};

enum class EShaderFundamentalDimensionType {
    Scalar = 0,
    Vector = 1,
    Matrix = 2,
    EShaderFundamentalDimensionType_MAX = 3,
};

enum class EShaderFundamentalType {
    Bool = 0,
    Int = 1,
    Uint = 2,
    Float = 3,
    Struct = 4,
    None = 255,
    EShaderFundamentalType_MAX = 256,
};

enum class EShaderParamBindingType {
    None = 0,
    ConstantParameter = 1,
    ReadOnlyResource = 2,
    ReadWriteResource = 3,
    EShaderParamBindingType_MAX = 4,
};

enum class EShaderParamModifier {
    None = 0,
    In = 1,
    Out = 2,
    InOut = 3,
    EShaderParamModifier_MAX = 4,
};

enum class EShaderResourceType {
    None = 0,
    Texture1D = 1,
    Texture2D = 2,
    Texture3D = 3,
    TextureCube = 4,
    Buffer = 5,
    StructuredBuffer = 6,
    ByteAddressBuffer = 7,
    EShaderResourceType_MAX = 8,
};

// Size: 0x28
struct FShaderFunctionDefinition {
    /* 0x0000 */ FString Name;
    /* 0x0010 */ TArray<FShaderParamTypeDefinition> ParamTypes;
    /* 0x0020 */ bool bHasReturnType;
};

// Size: 0x30
struct FShaderParamTypeDefinition {
    /* 0x0000 */ FString TypeDeclaration;
    /* 0x0010 */ FString Name;
    /* 0x0020 */ FShaderValueTypeHandle ValueType;
    /* 0x0028 */ uint16_t ArrayElementCount;
    /* 0x002a */ EShaderParamBindingType BindingType;
    /* 0x002b */ EShaderResourceType ResourceType;
    /* 0x002c */ EShaderParamModifier modifier;
};

// Size: 0x20
struct FShaderValueContainer {
    /* 0x0000 */ TArray<uint8_t> ShaderValue;
    /* 0x0010 */ TArray<FArrayShaderValue> ArrayList;
};

// Size: 0x20
struct FShaderValueType {
    /* 0x0000 */ EShaderFundamentalType Type;
    /* 0x0001 */ EShaderFundamentalDimensionType DimensionType;
    /* 0x0004 */ FName Name;
    /* 0x000c */ bool bIsDynamicArray;
};

// Size: 0x8
struct FShaderValueTypeHandle {
};

// Size: 0x110
struct FConstraintAndActiveChannel {
    /* 0x0000 */ FMovieSceneConstraintChannel ActiveChannel;
    /* 0x0108 */ UTickableConstraint* ConstraintCopyToSpawn;
};

// Size: 0x50
class UConstraintSubsystem : public UEngineSubsystem {
    /* 0x0030 */ FMulticastSparseDelegate OnConstraintAddedToSystem_BP;
    /* 0x0031 */ FMulticastSparseDelegate OnConstraintRemovedFromSystem_BP;
    /* 0x0038 */ TArray<FConstraintsInWorld> ConstraintsInWorld;

    void OnConstraintAddedToSystem__DelegateSignature(UConstraintSubsystem* Mananger, UTickableConstraint* Constraint);
    void OnConstraintRemovedFromSystem__DelegateSignature(UConstraintSubsystem* Mananger, UTickableConstraint* Constraint, bool bDoNotCompensate);
};

// Size: 0x40
struct FConstraintTickFunction : public FTickFunction {
};

// Size: 0x2b0
class AConstraintsActor : public AActor {
    /* 0x02a8 */ UConstraintsManager* ConstraintsManager;
};

// Size: 0x28
